[
  {
    "name": "Harsh Ghodkar",
    "age": "22",
    "devpost": "/harshghodkar",
    "github": "@Saviour1001",
    "linkedin": "/in/harsh-ghodkar",
    "website": "github.com/Saviour1001",
    "about": "Harsh Ghodkar has made a name for himself in the hacker community as a blockchain developer and educator. He is the founder of Blocktrain, a community where he teaches blockchain development for free. Harsh is passionate about helping people learn new skills, and he uses his experience to bring new voices into the world of tech.\n\nHarsh first discovered his fascination with computers in high school. He started with C++ and was hooked right away, quickly moving on to different frameworks and languages. He says, “I consider programmers to be magicians because they can create value out of thin air by hitting buttons on a keyboard.” Harsh dove into hackathons soon after, trying different approaches and formats to hone his skills. The time-bound model of hackathons provided the right kind of pressure for him to focus and create.\n\nHis first event, HackNagpur 2020, was all he needed to jumpstart his hacking career and engagement with blockchain technology. Harsh's experience in hackathons has expanded his skill set and helped him create a strong portfolio. Winning hackathons motivated him to keep improving, and soon he started getting invites from hackathon organizers to serve as a mentor and judge—he was even accepted into the Major League Hacking (MLH) Fellowship, collaborating with the core developers of Solana.\n\nHarsh's newfound passion for blockchain development led him to found Blocktrain, a learning platform for beginners to help them get started in the blockchain space. His content supports  other developers engaging with Web3, and he has formed a team of motivated individuals to grow the community. Harsh has written various articles and created videos in Hindi to help Indian developers learn about blockchain.\n\nBlocktrain has been a huge success, with its YouTube channel reaching almost 8,000 subscribers and the website getting over 50k monthly visits. Harsh has given back to the hacker community in many ways, including by making blockchain development more accessible to underserved beginners. He is proud to say that, “Now, if I visit any IRL event, I always find people who have used my content.”\n\nHarsh is a core member of GirlScript Summer of Code, an open source event targeted at beginners. He also organizes events like Build Station and local seminars to help other developers learn. He has teamed up with different organizations to make these events possible, including GitHub, Polygon,  Shardeum, Flow Blockchain, and local college groups.\n\nHarsh is passionate about the educational power of coding. Not only has he expanded his own knowledge of tech in leaps and bounds, he has dedicated himself to helping others learn new skills. His contributions to hackathons, especially as a mentor, have made new technologies more accessible. Harsh's impact on the hacker community will continue to grow as he inspires others to learn and advance their careers.",
    "url": "https://top.mlh.io/2023/profiles/harsh-ghodkar"
  },
  {
    "name": "Angela Chen",
    "age": "20",
    "devpost": "/angc",
    "github": "@angelachenn",
    "linkedin": "/in/-angela-chen",
    "website": "",
    "about": "When Angela was in her sophomore year, she had no idea what she wanted to study in college. She tested the waters in different fields, but what stood out to her the most was her Intro to Computer Science course. Although her first programs were for basic calculations, like one which found the greatest common denominator between two numbers, Angela quickly realized that computer programs could be used to solve a whole host of problems. What appealed to Angela about a career in technology were the countless opportunities to learn new things and pivot to new projects. She says, “technology unlocked purpose and motivation for me—there is always something new to learn.”\n\nDuring her junior year, when the COVID-19 pandemic swept the globe, Angela dedicated herself to learning coding online. Motivated by having something tangible to show for her efforts, she developed applications related to her own interests. Angela watched countless videos and read numerous articles, but struggled to stay motivated in her pursuit. When she attended her first hackathon, MasseyHacks VI, she discovered a new source of motivation. The format of hackathons made learning easier and gave her the direction she needed to advance her career.\n\nAngela was one of two girls in her high school computer engineering class in Ottawa, and constantly felt underestimated by her peers due to her gender. As a result, Angela is passionate about increasing accessibility in tech. She joined Project Tech Careers (PTC) in 2020 and is currently PTC’s Chief People Officer. With PTC, she organized monthly events for middle and high school students, developing curriculum for everything from basic coding literacy to professional career development.\n\nAngela strives to serve underrepresented communities and has helped drive engagement among female-identifying students.“There is a lack of representation in the technology field,” Angela says, adding, “I believe proper representation and a strong support system are critical to nurturing and encouraging anyone to take risks and pursue learning, regardless of the area.” In 2020, Angela competed in the Technovation Challenge, a global community for girls in tech. The mission resonated with her, and she subsequently joined as a student ambassador, hosting workshops, inviting students, and building an environment where aspiring hackers felt empowered to tackle real-world issues.\n\nAngela has participated in numerous hackathons herself, most recently speaking at Hack the North, Canada’s largest hackathon, and hacking at ConUHacks VII. Through Major League Hacking, Angela was introduced to ETHGlobal. Angela’s team competed at ETHToronto and placed in the top 5, which eventually led to earning a full scholarship to attend ETHLisbon and world-renowned tech conference Web Summit in Portugal. Through her first hackathon, Angela was introduced to Shopify and later admitted to their selective Dev Degree program. She currently interns as a security engineer at Shopify while earning her bachelor’s degree in computer science from Carleton University.",
    "url": "https://top.mlh.io/2023/profiles/angela-chen"
  },
  {
    "name": "Dhiraj Chauhan",
    "age": "20",
    "devpost": "/cdhiraj40",
    "github": "@cdhiraj40",
    "linkedin": "/in/cdhiraj40",
    "website": "cdhiraj40.dev",
    "about": "Dhiraj Chauhan is a constant advocate for open source and public learning. A third-year computer science student from Mumbai, India, Dhiraj formerly worked as a full-stack developer at Ironforge, and he specializes in Android, Web, and Solana blockchain development.\n\nHis support for public learning drives him to constantly share his knowledge with others. He loves to speak at events and has conducted multiple seminars to encourage and mentor students who are interested in programming, open source, and building tech communities.\n\nDhiraj is a Google Summer of Code mentor at 52°North (where he started last year as a participant). He was also a Major League Hacking (MLH) Fellow in 2022, collaborating with Solana Labs through our Web3 Engineering track. Along with that, he is a GitHub Campus Expert and actively promotes open source in his local community. Dhiraj attributes his achievements to open source and believes in its power to facilitate collaborative learning and growth.\n\nHis path wasn’t always easy, though. At first, Dhiraj wasn’t sure technology was for him. He remembers that at the start of his journey as a programmer, “I struggled to write even a single line of code or make sense of the concepts.” Yet he persevered and learned Python, eventually starting Android development and learning about open source technology. He credits his brother for pushing him to persevere and work harder.\n\nOnce he enrolled at the Thakur College of Engineering, he couldn’t find a community where he could discuss what he was learning. The solution? He and his colleagues founded Cerritus Coders, a student-run community focusing on open-source, project-based learning, helping students learn and develop their coding skills. Under Dhiraj's leadership, Cerritus Coders has grown to over 400 people and has had a significant impact on the hacker community. He says, “Through our efforts, we have organized multiple events and impacted thousands of students, giving them a platform for learning, building, and sharing.”\n\nDhiraj got hooked on hackathons through his first hackathon, MLH HackFit in November 2021. The competition and teamwork aspects of HackFit showed him the potential of MLH hackathons to build community and inspire learning.\n\nDhiraj believes in sharing his knowledge, and enjoys mentoring and teaching others. He has organized 10+ events impacting thousands of students and helping them grow their skill sets. His efforts have had a significant impact on the hacker community. He states, “This journey through technology, communities, and hackathons has definitely been amazing. I am grateful for the opportunity to be part of such inspiring, supportive, and inclusive communities, which have surely changed my life.” With his knowledge, skills, and dedication, he is sure to continue making a difference in the technology world and inspiring others to do the same.",
    "url": "https://top.mlh.io/2023/profiles/dhiraj-chauhan"
  },
  {
    "name": "Jeremy Su",
    "age": "17",
    "devpost": "/jeremysu64",
    "github": "@bulletchicken",
    "linkedin": "/in/jeremy-su-9a0057236",
    "website": "",
    "about": "Jeremy Su says, “it was like trying to teach a fish fluid dynamics” when his parents sent him to a programming camp to spend two weeks learning Python. “I wasn’t interested in programming before the camp, and I still wasn’t interested after.” After discovering Java, Jeremy had a temporary surge of inspiration and felt like a hacker from a movie, but it quickly subsided.\n\nInspired by the hackathon scene from the Korean drama Start-Up, and hoping to make his programming journey more enjoyable, Jeremy started to research hackathons. He stumbled on the Major League Hacking (MLH) community and decided to register for the first hackathon he could participate in, SimpliHacks 2.0. His older sister was one of his teammates, guiding him through APIs and showing him React. The experience introduced him to web development, which he says “felt like breaking free from the Matrix,” and once again got him excited about tech. Over the course of the 48-hour hackathon, Jeremy says that though he did not sleep or shower, he learned more than he ever thought possible and had so much fun that he almost forgot to eat! Jeremy was brand new to React but still handled the functionality of their project, Nourpact, which was designed to help eliminate food waste and won 1st for Best Domain Name and 2nd place for the College Division.\n\nOf his hackathon experience, Jeremy says, “before I joined the hacker community, I felt quite lost in life. I didn’t have many goals, whether in school or otherwise. However, participating in hackathons and creating connections with people there helped me to realize my interest in programming.” Since SimpliHacks, Jeremy has continued to develop his programming skill set, pursuing AI and machine learning projects. He participated in several more hackathons and submitted winning projects at Hack the Valley 7, DeltaHacks IX, uOttaHack 5, and more. Jeremy credits the friends he has made through the hacker community with inspiring him to always aim higher and become a better leader.\n\nJeremy also has a passion for sharing his love of technology with others, and says, “while I enjoy every aspect of a hackathon, from the prizes to the people, it’s the opportunity to help aspiring hackers that truly excites me.” At each hackathon he has participated in, Jeremy has gone out of his way to choose teammates who have an interest in pursuing careers in STEM fields but aren’t sure where to start. He loves helping people uncover their inner genius by finding and leveraging their own unique strengths within STEM.\n\nBeyond hackathons, at his high school in Markham, Ontario, Jeremy is the President of the Science Club, and recently started a chapter for STEM Fellowship. Between hosting workshops and promoting hackathons with the STEM Fellowship, Jeremy is also working to create the school’s first physics team. Currently, Jeremy is the lead organizer of AliceHacks, where he is encouraging projects with a touch of “goofiness, imagination, and creativity, rather than just technicality.” Always seeking new challenges, Jeremy has also joined and competed with the FIRST Robotics Team, Markham FireBirds. His engagement in his community has allowed him to reach new heights while helping others unlock their passions.",
    "url": "https://top.mlh.io/2023/profiles/jeremy-su"
  },
  {
    "name": "Trinh Le",
    "age": "24",
    "devpost": "/12trinhle",
    "github": "@trinhmle",
    "linkedin": "/in/trinh-le-5413631a2",
    "website": "",
    "about": "As an undergrad at the University of Texas at Dallas (UTD), Trinh Le knew about hackathons and computer science, but was committed to pursuing a career in medicine. Her first hackathon changed her entire trajectory. HackUTD VIII was the first event she attended. She was unsure of what to expect at first, but after winning first place for a sponsor challenge, she said, “even though I felt like we built something basic and could have done more, I was very proud of our accomplishment. Winning was the start of it all.”\n\nThat hackathon kicked off a flurry of events as Trinh made it her goal to enter as many as possible. Soon, she discovered—and grew to love—the community that goes along with hackathons. As she remembers, “We were like a traveling band going around on a hackathon tour and encouraged as many people as we could to partake in our weekly road trips around Texas. Not only did I learn so much from my new friends and teammates, I felt like I was part of the hacker community.” Trinh sees the people she meets at hackathons as her reason to continue learning and evolving as a coder.\n\nHackathons did more than just solidify her coding skills, though. They let her open up as a person and come out of her shell. At hackathons, she met like-minded people with similar interests working together towards a common goal, creating tangible projects with real-world applications. At 2023 HackTAMU, Trinh gathered an unlikely group of newcomers and led them to create a valuable and dynamic project. Trinh remembers teaching a teammate React Native and Expo while also designing the pages of the application. Working together as a team, they were able to bring together a finished project and even win the Best Use of MatLab prize!\n\nTrinh Le began coding later in her student career, but that hasn’t slowed her down. Ever since she discovered her love for technology and hackathons, she has been on a mission to share her knowledge with others. Her constant commitment to newcomers in the hacker community has made hackathons more accessible. She dedicates as much time to looking for opportunities to help others as she does to discovering new boba tea shops.\n\nShe says about her entry into the world of hacking: “I was only a beginner but the possibilities were infinite.” Though she’s already accomplished a lot, those infinite possibilities are still ahead of her.",
    "url": "https://top.mlh.io/2023/profiles/trinh-le"
  },
  {
    "name": "Michelle Shen",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "/in/michelle-shen-b912ba179",
    "website": "",
    "about": "Michelle Shen was introduced to technology by chance after being roped into helping her friend organize a CodeDay DC hackathon in high school. At the time, Michelle didn’t see herself as a coder, but as she worked closely with her team to grow the event to accommodate hundreds of attendees, she was able to meet so many incredible people that made her feel welcome in the community. Through her meaningful experience organizing CodeDay DC, she says, “I fell in love with the creativity and acceptance I found in the hacker community.”\n\nIt wasn’t until after Michelle had graduated high school and started her chemical engineering degree at Georgia Tech (GT) that she registered for her first hackathon as a participant: a hackathon hosted by Women at the College of Computing at Georgia Tech, where her team placed 1st in the Education category. That experience gave her the motivation to continue learning about technology, which eventually developed into a strong passion for the power of creation involved in programming.\n\nMichelle has continued to stay involved in the community by organizing hackathons for others. At Georgia Tech, she got involved with the HexLabs technology team, helping to organize hackathons such as Georgia Tech’s flagship HackGT. The summer after her freshman year, Michelle was selected for the Major League Hacking (MLH) Fellowship's Production Engineering track, where she learned how to take a project from idea to production. Working with two other fellows, Michelle created a meaningful project that ended up winning them 1st prize at the MLH Fellowship’s project expo. Michelle enjoyed the experience so much that she reapplied and was accepted into the MLH Fellowship again, this time for the Open Source track. As an Open Source fellow, she collaborated with Meta to roll out changes on their Hip-Hop Virtual Machine that are still being used by developers across the company.\n\nFollowing these impactful fellowship experiences, Michelle has continued to gain experience as a Software Development Intern for PENTA Construction Management and a Software Engineering Intern with Stripe.\n\nGiving back to the MLH and broader hacker community, Michelle was recently featured on a panel at The Linux Foundation Member Summit to promote exciting new partnerships between Linux Foundation teams and the MLH Fellowship for future student fellows. She has also written a post on the MLH blog speaking on her experience getting into the tech field and opened herself up to advising students still nurturing their interest in coding.\n\nFostering a more inclusive and accepting environment in the hacker community is incredibly important to Michelle. She’s been heavily involved in the Society of Women Engineers (SWE) since beginning college. Moving from a general member to committee chair to becoming VP of Finance of her college chapter, she helped lead the largest minority-interest student organization on campus. She now serves on the Society’s National Finance Committee helping chapters around the nation maintain their finances.\n\nRecently, she was also an organizer, mentor, and judge for Georgia Tech SWE’s first high school hackathon, which introduced students from the local Atlanta community to coding through hands-on workshops and events. Through the organization, she also volunteers her time to mentor female students considering STEM majors and help with female recruitment events at Georgia Tech.",
    "url": "https://top.mlh.io/2023/profiles/michelle-shen"
  },
  {
    "name": "Anam Ansari",
    "age": "20",
    "devpost": "/anamansari062",
    "github": "@anamansari062",
    "linkedin": "/in/anamansari062",
    "website": "",
    "about": "Anam Ansari already had a passion for programming when she attended her first hackathon, Android Buzz 2021. Hackathons provided her the perfect outlet for her creativity and problem-solving skills. She attended many more, including events sponsored by Major League Hacking (MLH), and her achievements were recognized with multiple awards. Hackathons honed her technical skills, and she is now proficient in Android development, Rust, Python, and Solana. She says, “I have always preferred a project-based approach to learning, and I like to customize what I learn. Participating in hackathons has taught me a lot about teamwork.”\n\nOn top of her hackathon successes, Anam is a dedicated open-source contributor. In 2022, Anam participated in the open source track of the MLH Fellowship. She believes collaboration is essential to the success of software development and is committed to making opportunities in tech more accessible to everyone. She is proud to say, “As a woman in a field where we are often discouraged, I've made it a personal goal to break down those barriers.”\n\nThrough Cerritus Coders, an open-source community that she co-founded, Anam has created a space where developers come together to share knowledge and build collaborative projects. Cerritus Coders has expanded to become an MLH guild and participates in events like Global Hack Week and Local Hack Day.\n\nAnam also excels in mentoring—whether working with groups as a Google Developer Student Club (GDSC) Lead or reaching out to support hackathon attendees one-on-one. Anam has also worked with Lean-In Hacks, where she mentored women in tech and helped them develop their skills and confidence. Her leadership has been instrumental in inspiring students to pursue careers in tech and has helped bolster a passionate and innovative community of developers.\n\nWhen asked about her impact on the hacker community, Anam reflects on her experiences as a mentor and judge. She has seen some fantastic projects and teams motivated to build great things, but she has also witnessed teams struggling and on the verge of giving up. In cases like these, she enjoys personally reaching out and helping these new hackers. For example, at CodeDay Mumbai she helped nervous high schoolers gain the confidence to participate in the event. She embodies inclusivity at every level—building up the community one hacker at a time.",
    "url": "https://top.mlh.io/2023/profiles/anam-ansari"
  },
  {
    "name": "Ayush Paul",
    "age": "17",
    "devpost": "",
    "github": "@citricacid2",
    "linkedin": "/in/ayush-paul-nc",
    "website": "",
    "about": "Ayush Paul has always been fueled by a desire for self-reliance. After he learned to code with Python in 5th grade, he spent countless hours tinkering with different programs, scouring the internet for tutorials, guides, and other resources to help him grow. Ayush says, “I wanted to make everything I could by myself from scratch.” This passion drove him to explore everything from web development to machine learning to hardware, and he soon realized that technology was not just a means of building software, but a tool to improve people’s lives and solve real-world problems.\n\nThere weren’t many students his age interested in programming at his school in Concord, North Carolina. Early on, Ayush found several forums on Reddit and spent time on GitHub to connect with the hacker community. Discord servers provided more opportunities, but it wasn’t until Ayush found the Hack Club community on Slack that he truly felt welcomed and supported. He attended numerous Hack Club events and soon founded a chapter at his school.\n\n“From my early days on forums to my involvement with Hack Club, I have always been passionate about sharing my knowledge and resources with others,” Ayush says. Through Hack Club, Ayush flew out to San Francisco to attend Assemble, which he sees as a formative part of his hacking career. Ayush says, “my experience at Assemble opened my eyes to the power of the hacker community to affect positive change.”\n\nInspired by his experience at Assemble, Ayush founded Queen City Hacks (QCH), a hackathon through which he aims to empower underprivileged high school students to code their own solutions to social problems. The hackathon is entirely funded by sponsors, and Ayush strives to create an educational environment for attendees to learn and create transformative projects. Through his work with QCH, Ayush says he has already seen incredible projects tackling the homelessness crisis, improving equity through educational games, and increasing access to blood donations in Charlotte.\n\nTo Ayush, founding QCH has been his greatest project to date. With the assistance of the Major League Hacking (MLH) Pizza Fund, the event brought together students from all over the Charlotte, North Carolina area to collaborate and innovate. Ayush made sure the event included targeted support, useful workshops, and even a robotics demonstration by FIRST® Tech Challenge teams. Ayush has continued to provide mentorship by co-organizing UniHacks, an official Major League Hacking (MLH) season event.\n\nAyush’s involvement in the hacker community has also included roles on his robotics team, a stint working with local science museum Discovery Place’s volunteering department, and even the founding of Bit by Byte, a nonprofit focused on promoting computer science education in North Carolina. Through his work, Ayush hopes to inspire other young programmers to use their skills and knowledge to create meaningful change in their communities. When he is not programming, Ayush can often be found scuba diving off the Atlantic coast. Ayush says being underwater is like “stepping into another universe entirely,” and the tranquility he finds there helps him reset and unwind.",
    "url": "https://top.mlh.io/2023/profiles/ayush-paul"
  },
  {
    "name": "Alex Breazu",
    "age": "22",
    "devpost": "/Proxence",
    "github": "@proxence",
    "linkedin": "/in/alex-breazu",
    "website": "",
    "about": "Alex Breazu has loved technology for as long as he can remember. From streaming Nintendo games on YouTube and reconstructing toys as a child, he has risen to become a talented and motivated hacker. His early tinkering with machines led him to pursue a degree in mechanical engineering at the University of Georgia (UGA).\n\nIn college, Alex discovered a passion for software engineering after participating in UGAHacks 5. He loved the beginner-friendly approach many hackathons offer. He remembers, “Eventually, [my team] created a really exciting project that was designed to help out hackers who were overwhelmed or dealing with stress by providing a quick funny gif they could watch. Our team ended up winning the prize for the best first-time hackers at the event and this was a monumental moment in my journey with technology.”\n\nSince then, Alex has been an active member of the hacker community. His UGAHacks5 team returned for UGAHacks 6 the next year and won a sponsored prize that included a summer internship offer. That opportunity changed the trajectory of his career as he realized he wanted to pursue software engineering after graduation. Alex spent over a year interning at NCR, pivoting from mechanical engineering into a software-focused career.\n\nAlex is adept at turning interests into strong career moves. One of his favorite hobbies is taking care of houseplants (currently, owning over 20 of them). Struggling with the complexities of plant health, Alex constructed a tool that he says combines “my mechanical engineering coursework and software engineering experience…to help me take better care of them.” He has turned this tool into the foundation of a startup that is planned to launch soon!\n\nAlex has also stepped up as a leader and mentor in various tech organizations at his university. He was the Logistics and Community Engagement Director of UGAHacks 8, where he planned every stage of the hackathon’s logistics and managed a team of seven organizers. He is also the Lead Organizer for Google Developer Groups Athens, creating events that cater to new developers, students, and experienced professionals. In addition, he is a Student Ambassador for the UGA College of Engineering, representing the college both on campus and around the state of Georgia.\n\nAlex Breazu is a talented and dedicated individual who has made a name for himself in the hacker community. His love for technology, coding, and hackathons has led him to pursue a career in software engineering and placed him in many leadership roles on campus. Alex’s leadership has inspired many others to pursue technology and coding, and he is sure to achieve even more success in the future.",
    "url": "https://top.mlh.io/2023/profiles/alex-breazu"
  },
  {
    "name": "Kevin Chen",
    "age": "21",
    "devpost": "",
    "github": "@Winter-1314",
    "linkedin": "/in/kchen1314",
    "website": "kevslab.tech",
    "about": "As early as elementary school, Kevin Chen was using his tech skills to help teachers with their computers and was their go-to resource for fixing audio and video equipment. In junior high, he volunteered as a library assistant and spent the summer building a computer lab for his school. He wanted to continue working with technology when he got to high school, and despite a policy of only allowing upperclassmen to work as library assistants, Kevin landed the role. He immediately took on the challenge of figuring out the school’s analog to digital media conversion system. “Through all of these experiences,” Kevin says, “I discovered that technology was where I could make a real impact on people’s lives.”\n\nKevin knew he wanted to pursue a career in technology, but his freshman year at the University of Maryland, Baltimore County (UMBC) found him torn between majors in information systems, computer science, and computer engineering. When his Intro to Computer Science professor mentioned hackUMBC, Kevin decided the worst-case scenario would be extra time to work on his class project. The hackathon ended up meaning much more than that, and Kevin says, “participating in hackUMBC solidified my decision to pursue computer science.”  Since his first hackathon experience, Kevin has participated in many more, including HackHPC.\n\nHis experience at hackUMBC introduced Kevin to the hacker community, which has become a central part of his life. “Being a part of the hacker community has taught me some of life’s most valuable lessons,” he says, “and I have learned not to be afraid of making decisions because if they lead to mistakes, it is never too late to fix them.”\n\nAs a first-generation college student, Kevin found guidance in the hacker community. The support of his new peers and mentors inspired him to take on leadership roles. He returned to hackUMBC as an organizer, hoping to help other aspiring hackers find their footing. He has since worked as both the External Vice President and Director of hackUMBC, co-founded UMBC Gaming and Esports, and served as a Major League Hacking (MLH) Coach. Kevin believes in fostering an inclusive environment and has tirelessly worked to inspire people of all backgrounds and careers to participate in hackathons. As an MLH Coach, Kevin participates in as many Global Hack Week streams as he can, and often finds himself leading beginner-friendly streams. With MLH, Kevin says he is particularly focused on “breaking down the barriers of entry into the tech space, helping people overcome the feeling that they don’t know anything and won’t fit in.”\n\nKevin says his journey is only just beginning. He has stayed involved in UMBC’s hacker community by competing in the Collegiate Cyber Defense Competition and working as a Senior Infrastructure Engineer with UMBC’s nationally recognized CyberDawgs team. He has further developed his skills in UX/UI and software engineering through internships with the Maryland Department of Health and investment management firm T. Rowe Price. He continues to help others at his university as the Head Teaching Assistant of UMBC’s Computer Science Department. From hosting Global Hack Week streams to mentoring new hackers, Kevin is constantly looking for ways to welcome more people into the world of hackathons.",
    "url": "https://top.mlh.io/2023/profiles/kevin-chen"
  },
  {
    "name": "Chukwuemeka Mba",
    "age": "21",
    "devpost": "/reallifenero",
    "github": "@reallifenero",
    "linkedin": "/in/emekamba",
    "website": "reallifenero.com",
    "about": "Chukwuemeka Mba knows the importance of teamwork. Personal ambition and achievement are components of success, but support is crucial. He attributes his ascent through the hackathon world to his network of friends for inspiring him and helping him reach his goals.\n\nChukwuemeka is originally from Lagos, Nigeria, but currently lives in Boston. These cities may seem like worlds apart, but one thing has bridged the two: technology. Growing up, a friend with experience in Blockchain convinced Chukwuemeka to get into programming as a path to a bright future. He jumped into Python, and over the next several months created his first web application using Python Django. HTML and CSS were his next stepping stones, and before he knew it, he was developing multiple applications.\n\nTeamwork and networking have been continual allies for Chukwuemeka. As he developed his programming skill set, a friend introduced him to Major League Hacking (MLH), and that experience launched his hacking career. His first hackathon was BC Hacks 2022, where he fell in love with the hackathon environment and how attendees could raise each other up all the way to victory. He says, “I lost a handful of them early on, which was quite discouraging until I won my first. That was when I understood the value of teams.”\n\nIn the time since BC Hacks, Chukwuemeka has accomplished so much. He went from a hackathon attendee and open source contributor to a Fellow in the MLH Fellowship. His progression into coaching and mentoring has benefitted many hackers looking for guidance, and the feeling is mutual. As he says, “The hacker community in its entirety has introduced me to wonderful personalities and strengthened my knowledge of the fact that I am not alone. There are many more hackers here that are as enthusiastic about learning and giving back as I am.”\n\nWhile the community has been instrumental to his success, Chukwuemeka can also thank his personal drive and perseverance for getting him where he is today. His dedication to coding, from teaching himself multiple programming languages to immersing himself in hackathons, has opened new doors for him. He says, “I went from selling groceries at a local store in Boston to winning multiple hackathons. It just goes to show what is possible with a vision.”\n\nThis determination can be seen in his approach to the MLH Fellowship. He applied for the MLH Fellowship Prep Program early in his hackathon career and was denied, but he did not give up. He bolstered his hacking resume and re-applied twice, and was finally accepted into the MLH Fellowship program. He does not take for granted the dedication and resilience he showed, and knows that giving back to the MLH community is the greatest gift he can offer in return.\n\nChukwuemeka is a prime example of harnessing the power of collaboration, but maintaining an exceptional work ethic to carry you to your dreams. Whether he is learning a new programming language or bouncing ideas off of other hackers, he is constantly moving forward and looking for the next challenge. As he states, “Technology as a whole has changed my outlook on life to one of transcendental optimism.” With that attitude, Chukwuemeka’s future looks bright.",
    "url": "https://top.mlh.io/2023/profiles/chukwuemeka-mba"
  },
  {
    "name": "Vaibhav Kadam",
    "age": "21",
    "devpost": "/vvkadam2001",
    "github": "@4lph4v",
    "linkedin": "/in/4lph4v",
    "website": "profile.4lph4v.co/",
    "about": "Vaibhav Kadam is an accomplished hacker and cybersecurity expert based in Pune, Maharashtra, India. He is currently a student at Savitribai Phule Pune University, pursuing a degree in computer engineering, and is an Intern Security Consultant at Securityium.\n\nVaibhav's love for technology and coding actually started during his first year of computer engineering, when he wrote his first Python program: a simple calculator. He was immediately impressed with the versatility of the programming language, which led him to explore other areas of technology. One such area was cybersecurity. During the COVID-19 pandemic, Vaibhav attended a cybersecurity workshop that immediately captured his attention, sparking an interest in ethical hacking. Since then, his passion for coding has ignited, and he has focused on programming with an emphasis on cybersecurity as a career.\n\nVaibhav's exposure to the hacker community started when he jumped into his first hackathon, Hack The Mountains 2.0 in June 2021. Suddenly, he had found his place in the world. He says, “I discovered the value of community and the immense benefits of connecting with like-minded individuals. It was this realization that led me to explore various communities and engage in several Major League Hacking (MLH) hackathons.” He was impressed by the hackathons, but others were noticing his success too. He received second place in Lights, Camera, Hacktion! and has not looked in the rearview mirror since.\n\nVaibhav now shouts the benefits of hackathons from the rooftops. He has established a community called Club TechBrewers, through which he organizes and leads a variety of virtual events like UI/UX workshops, Android development workshops, and introductory Git and Github sessions. Additionally, Vaibhav has worked with other communities to organize events such as Azure DevDay Pune, .NET Day, and Flutter Forwarded Extended. He has also organized several offline events within the community, including TechBrewers Meetups and TechBrewers CelCon. These experiences have helped him build lasting relationships within many communities and work with people of all backgrounds.\n\nThroughout his journey in the hacker community, Vaibhav has made a positive impact by leveraging his expertise and knowledge of cybersecurity. He accomplishes this by delivering seminars providing valuable insights and knowledge to his peers. These sessions have been popular! His offline session \"SSRF: Overview and Exploits\" garnered over 250 attendees. Moreover, he has actively worked towards building a community that is inclusive, supportive, and conducive to learning, which he believes has helped increase the number of individuals pursuing a career in cybersecurity.\n\nVaibhav is currently applying his expertise as an Intern Security Consultant at Securityium OPC Pvt. Ltd., honing his cybersecurity skills and supporting their mission to safeguard businesses through ethical hacking. Vaibhav's dedication to the hacker community and his passion for cybersecurity have not gone unnoticed. He has been invited to speak at the upcoming GDSC WOW Pune event—just one more way his impact is being recognized in the community.",
    "url": "https://top.mlh.io/2023/profiles/vaibhav-kadam"
  },
  {
    "name": "Dorsa Rohani",
    "age": "17",
    "devpost": "/dorsa-rohani",
    "github": "@DorsaRoh",
    "linkedin": "/in/dorsarohani",
    "website": "dorsarohani.com/",
    "about": "When she was little, Dorsa dreamed of using computer science to explore the universe and discover the cosmos. Her sister Sophie’s cancer diagnosis changed the course of her life. Initially given a bleak medical prognosis, Sophie fought resiliently, a testament to both her tremendous strength and the cutting-edge technology which advanced her treatment. Dorsa says the experience instilled in her a “deep sense of awe and appreciation for the power of innovation.”\n\nAmidst the COVID-19 pandemic, Dorsa felt a strong desire for change as she tried to come to terms with the reality of her sister’s diagnosis. It was only after attending her first hackathon in the summer of 2022, Hackerland, that Dorsa found the inspiration to move forward.\n\nIn the hacker community, Dorsa says, “I found an outlet for my aspirations to push the boundary of how technology and innovation can change our lives, and a space where I could channel my energy into something positive and productive.” She threw herself into the world of digital creation, practicing everything from coding and app development to cybersecurity and artificial intelligence. And the more time she dedicated to her work, the more she began to see glimpses of hope in her sister’s battle with cancer. Dorsa believes that errors in Sophie’s diagnosis led to losing months of precious treatment time. As a result, she created LungML, an application to detect bronchial cancer using pulmonary X-rays and MRI scans. Her project was awarded 2nd place out of more than 1,000 submissions at the Vellore Institute of Technology’s Cognition event.\n\nAt that time, her sister’s condition was still deteriorating, and Dorsa felt inspired to create Medic.AI, an all-encompassing natural language AI assistant which helps to evaluate the severity of most common medical conditions and illnesses. Dorsa continually refined Medic.AI and won Hack the Change, MetroHacks 2022, and Reconnect-Ed with progressively better implementations of her vision. Dorsa says the biggest impact from her experience in the hacker community was a sense of purpose and direction. “As I explored the world of technology and innovation,” she says, “I began to see a path forward.”\n\nShe uses her experience to mentor others, and takes pride in sharing her knowledge with aspiring hackers. She is a passionate advocate for secure and ethical hacking practices, with a deep understanding of the human impact technology can have. As she says, “thanks to technology, my sister is still with us today.”\n\nDorsa is grateful to the many fearless and trailblazing women who have paved the way for her, stating: “their tireless efforts to shatter the gender barriers in technology have inspired me to follow in their footsteps.” She has dedicated herself to reducing gender inequity in technology by providing encouragement and opportunities for women in tech, and creating environments that are inclusive.\n\nToday, along with her love for playing the cello with symphony orchestras, Dorsa is driven by her passion for innovation. She has embarked on a lifelong journey and hopes to inspire future generations to follow mission-driven pursuits. Wherever that journey takes her, it is clear that her most significant impact is yet to come.",
    "url": "https://top.mlh.io/2023/profiles/dorsa-rohani"
  },
  {
    "name": "Henok Ademtew",
    "age": "22",
    "devpost": "/henokb2124",
    "github": "@HenokB",
    "linkedin": "/in/henok-b-ademtew-7729b2183",
    "website": "henokademtew.vercel.app/",
    "about": "Henok Ademtew is a rising star in the hacker community, known for his passion for coding, hackathons, and mentorship. He is a Computer Science student at Kotebe Metropolitan University in Ethiopia, and has already made a name for himself both as a mentor and as a back-to-back hackathon winner.\n\nHenok's love for solving puzzles and unlocking complex secrets began at an early age. He was always fascinated by the night sky and intrigued by the mysteries of the cosmos, but he was also an avid detective-novel reader. He remembers always “trying to solve the mysteries before the protagonist did.” These logic and problem-solving skills shared with the heroes of detective novels became a natural pathway that Henok followed into coding and programming.\n\nIn high school, Henok was inspired by a love of video games to teach himself C++ and Python. He also joined AddisCoder, an intensive four-week summer program that introduces high schoolers to programming. “If it wasn’t for the program,” he says, “I wouldn’t be where I am today.” Henok was able to support the AddisCoders community in turn by serving as a TA.\n\nHenok discovered his love for hackathons in the fall of 2020 when he participated in the NASA Space Apps Challenge. Although he was inexperienced with the hackathon format and felt a little hesitant, he and his team still won the competition’s people’s choice award, igniting his passion for hackathons. Since then, he has taken part in more than 40 hackathons, developing his programming skills while learning valuable problem-solving strategies. He says, “These events have given me the opportunity to work with like-minded individuals who share my passion for technology.”\n\nHenok has also benefited from the Major League Hacking (MLH) community’s supportive and collaborative environment. Through MLH hackathons and the MLH Fellowship Prep program, he has been introduced to a variety of partner organizations, such as Cohere AI, which awarded him the title of Cohere Champion and where he currently serves as a Discord moderator. Through this organization, he has teamed up with engineers, fellow hackers, AI researchers, and more, giving him unparalleled opportunities—including speaking at Devopsdays Chattanooga about open source and hacking.\n\nHenok has been inspired to give back to the technology community by volunteering as a mentor and judge for international hackathons. He has taken on the role of Regional Manager for CodeDay Ethiopia, organizing the country's first CodeDay hackathons. Henok is used to being one of the only Ethiopian hackers at an event, and he represents his home country with courage, independence, and ambition.\n\nHenok's success in the technology community is a testament to his dedication, passion, and hard work. He has a promising future ahead of him, and his contributions to the community motivate others to pursue their own bright futures.",
    "url": "https://top.mlh.io/2023/profiles/henok-ademtew"
  },
  {
    "name": "Simrit Mangat",
    "age": "17",
    "devpost": "/simritmangat",
    "github": "@simrit-m",
    "linkedin": "/in/simrit-m",
    "website": "",
    "about": "Simrit Mangat’s interest in technology was sparked at a young age when she watched the popular educational show The Magic School Bus. Her curiosity about how things work led to her involvement in robotics clubs, where she became fascinated with technology. Hoping to use her blossoming tech skills to affect social change, she joined her first hackathon, Creatica 2020. This all-female hackathon gave her an opportunity to collaborate with like-minded individuals and create her first hackathon project, a telemedicine platform designed to reduce the frequency of medical errors by collecting patient data.\n\nAt Hackdemonium, she found new avenues to build projects for social good. At the hackathon, she created an online educational tool for students to connect with each other to help them overcome the loneliness and isolation they still felt after the COVID-19 pandemic. Hackathons shifted her approach to coding. As she says, “My experiences with hackathons and the hacker community directly resulted in my pursuits at the intersection of technology and social impact.”\n\nAs a Kode With Klossy scholar, Simrit gained technical skills in web development and coding, including HTML, CSS, and JavaScript. She created a website with over 2600 lines of code to educate citizens about their country's laws and regulations, aiming to inspire civic engagement and promote a greater understanding of the legal system.\n\nSimrit's involvement in the hacker community has not been limited to creating impactful projects. In fact, she began organizing hackathons before even competing in one. She currently serves as the Co-Executive Director of XdHacks Mini Vancouver, one of the only high school-led hackathons in British Columbia. Simrit and her team have organized four hackathons serving over 560 hackers. XdHacks is responsible for introducing high schoolers to the hackathon scene and encouraging them to pursue careers in STEM.\n\nAs a member of the Junior Academy at the New York Academy of Sciences, she’s competed in two challenges, Healthcare On-Demand: The Future of Telemedicine and Bias in AI Systems and Applications. Her team placed first in the Healthcare On-Demand challenge and was a top-three finalist in the Bias in AI challenge. In the Bias in AI challenge, Simrit collaborated with her team to create a tool that uses Local Interpretable Model-Agnostic Explanations (LIME) and Counterfactual Fairness to identify and measure bias, as well as synthetic data generation and blockchain-enabled audits to eliminate bias. Their work was recognized by S&P Global, and they were invited to present their findings to over 90 members at an AI/ML Accelerator event in collaboration with their Women in Tech group.\n\nSimrit has already accomplished so much in her career, and she’s just getting started. Her dynamic contributions to the hacker community, social outreach efforts, and expertise in technology have allowed her to make a real difference in the world of STEM.",
    "url": "https://top.mlh.io/2023/profiles/simrit-mangat"
  },
  {
    "name": "Alayna Nguyen",
    "age": "20",
    "devpost": "/alaynamnguyen",
    "github": "@alaynamnguyen",
    "linkedin": "/in/alayna-nguyen",
    "website": "",
    "about": "As a young hacker facing first-time jitters and doubts, Alayna found it challenging to get involved in the hacker community. Inspired by these early challenges and experience at Huskie Hack 2017 and PixelHacks IV, Alayna decided to create her own local event for young hackers.\n\nOver the course of several months, Alayna and her friends built relationships with sponsors, created and fine-tuned rubrics for judging criteria, and organized workshops as they built towards Hack for the World. Seeing herself reflected in over 50 participating hackers, she helped them gain an understanding of common coding languages, helping them overcome doubts about their abilities. Of the experience, she said “being a part of the hackathon community has allowed me to leverage my experiences to empower others.”\n\nHack for the World’s impact on the local hacking community in Naperville has been crucial, inspiring students to explore careers in STEM fields and spawning a network of like-minded peers with a love of programming. Alayna recalls her heart warming as she watched teams of new hackers proudly presenting their projects to the judges, no doubt partially inspired by the kindness and encouragement she had given them.\n\nAlayna says she was first driven to extend her hospitality to others by her aunt-in-law’s grandmother, a magnanimous relative who first greeted her with a smile and a bowl of bún riêu, a traditional Vietnamese soup. Though initially nervous at first meeting her extended family, she felt immediately welcomed. Alayna credits her Vietnamese heritage and community for her kindness and ability to put others first. “This perspective of putting people first and creating spaces where people of all backgrounds and experiences feel welcome is very important to me,” she said, “and I practice these ideas to strengthen my hacker community!”\n\nShe embodies this spirit through her mentorship of students and other hackers. When working in teams, Alayna aims to empower her peers, fill knowledge gaps, and foster collaborative conversations. Alayna loves that hackathons give everyone a chance to learn.\n\nAlayna is currently the Hacker Experience Team Lead at DivHacks, a Major League Hacking (MLH) Member event at Columbia University. In this role, she helped organize 36 hours of continuous workshops, panels, and activities for over 200 hackers. In keeping with this year’s theme of sustainability, Alayna recruited the keynote speakers for DivHacks, including two Columbia University professors and Catherine D’Ignazio, author of Data Feminism. Lending her own personal flair, Alayna also helped organize fun activities like a spicy ramen challenge, a cross-campus scavenger hunt, and legendary boba-breaks meant to bring people of different backgrounds together. Her resume also includes a current term as Vice President for Columbia University’s Women and Gender Diverse in Computer Science (WiCS), not to mention attending more than 30 hackathons since 2017. In August of 2022, Alayna represented DivHacks at MLH Hackcon 2022. Her favorite hackathon to date has been HackPrinceton 2022, where she and her team were awarded Best Art Hack, Best Use of Estuary, and a grant from the 1517 Fund for their work on ArtHub.",
    "url": "https://top.mlh.io/2023/profiles/alayna-nguyen"
  },
  {
    "name": "Chinat Yu",
    "age": "23",
    "devpost": "/cyu60",
    "github": "@cyu60",
    "linkedin": "/in/chinat-yu",
    "website": "chinatyu.me",
    "about": "Originally from Hong Kong, Chinat Yu just graduated from Johns Hopkins University in Baltimore. When he moved to the United States, he knew of four career options: doctor, banker, lawyer, and failure. None of them interested him. He moved aimlessly from class to class, unsure of the right major, until the fateful day he discovered hackathons.\n\nHis first hackathon was intimidating at first. He had no computer science experience and only attended based on the promise of giveaways and free food. However, the buzzing environment of HopHacks 2019 awakened a sudden excitement within him. He says, “The hackathon I attended was a turning point in my life. I was amazed by the creativity, problem-solving, and collaborative environment that was so unique to the hacker community.” Hackathons ignited his passion for programming. “Now I know that there are more options than what I was initially told,” he said. “Software engineering is the path that I would like to pursue.”\n\nDuring the pandemic, Chinat leveraged his newfound spare time by pivoting to pursue a computer science degree. He says, \"Computer Science was the only major where classes were the same both offline and online, behind a screen. I had the space to figure out what I wanted to do in college and catch up with my peers.\" Throughout this career change, he worked with mentors who changed his life, opening his eyes to the importance of mentorship and community support. For example, Aaron Osher, his mentor at the YCP Hackathon, introduced Chinat to the T3 Stack and changed his outlook on what technology is truly capable of achieving.\n\nIt is this spirit of mentorship that Chinat appreciates the most about Major League Hacking, and more broadly, the hackathon community. Many coders have their specific strengths, but having an entire network of accomplished individuals who are ready and willing to help others is what sets the hacker community apart.\n\nChinat’s future had been predetermined and limited when he arrived at college, but computer science knocked down those walls. Coaching and mentoring were a natural progression and a way to return the favor. Chinat is the founding Vice President of the Johns Hopkins Software Engineering Club, where he organizes meetups and workshops for fellow hackers. He has served as a mentor to many, and was even invited to speak about hackathons to over 100 students at his university. He continues to share knowledge and experience through his podcast, Hopkins Hacks, and on his personal website. He built his website, which allows students to learn more about him by chatting with his AI digital twin, over the course of a hackathon. Chinat continues to attend monthly hackathons to hone his skills and stay involved with the community. He said, “I have attended and won 4 hackathons this year alone, and I would love to keep that streak up.”\n\nChinat knows that illuminating new and unfamiliar ideas for others can be life-changing, as it was for him. He says, “It brings me great joy to see others get excited about technology and coding, and I’m proud to be a part of the movement that’s driving innovation and change in the world.” The best news is that the community at large gets to take part in that joy and gain inspiration from the great things Chinat is accomplishing. Having discovered the power of mentorship, community, and technology through hackathons, Chinat will combine these passions through the Masters in Learning, Design and Technology program at Stanford in Fall 2023. He says, “I envision a future where learning is engaging, accessible, and personalized, leveraging the power of technology and community to transform education into a personal journey that enriches every student's life and amplifies their potential.”",
    "url": "https://top.mlh.io/2023/profiles/chinat-yu"
  },
  {
    "name": "Marina Lee",
    "age": "18",
    "devpost": "",
    "github": "@namarilee",
    "linkedin": "/in/marinahylee",
    "website": "namarilee.github.io/",
    "about": "Marina Lee has been coding since she was 11 years old. Her first coding experience came through a mentorship program with More Active Girls In Computing (MAGIC), where she was matched with a female mentor in the tech field. Learning Python from her mentor, getting to tour Google’s headquarters, and creating her first project inspired her to learn everything she could about programming. When she got to high school, she signed up for computer science and cybersecurity classes and spent her free time surfing YouTube for coding tutorials and taking online programming courses.\n\nMarina was nervous when she registered for her first hackathon, AdaHacks 2019, but says the event being inclusive for female and non-binary hackers made her feel welcome. Marina enjoyed the workshops at the hackathon even more than her classes at school, and felt encouraged to learn about technology in creative ways. She continued to develop her skills as a hacker through the Kode With Klossy program and Girls Who Code, where she completed courses in web design and development. In 2022, Marina earned the Gold Award, the most prestigious award offered by the Girl Scouts for her project PocketStory. PocketStory is an educational game app designed for children with disabilities.\n\nThe summer before her junior year of high school, Marina participated in the AI4ALL summer camp, where she discovered that less than half of American high schools offer computer science courses and less than 15% of current AI researchers are women. Inspired by her own experiences in the hacker community, Marina decided to found  Citro Tech, where she provides free tech education content and workshops to students around the world.\n\nWhen she decided to organize her own hackathon, Citro Hacks, Marina realized she had never actually led a team before. But after stumbling upon the Major League Hacking (MLH) community during the COVID-19 lockdowns, Marina found the tools she needed to organize a successful event. She says, “without the community and other resources MLH provided, I wouldn’t have been able to host a successful hackathon.” Citro Hacks was a huge success, attracting 831 attendees from across the globe and raising over $3,000 in sponsorships. Marina says the most fulfilling part of hosting Citro Hacks was that 53% of the attendees were beginners and 99% of the attendees reported being more interested in careers in tech afterward. When one student personally messaged her on Discord thanking her for putting on the event, she was reminded that even though the hackathon was virtual, her impact had touched real people and made a difference.\n\nMarina continues to dedicate herself to encouraging new students to pursue careers in technology. She was actively involved in her high school’s Society of Women Engineers club until graduation, helping to introduce middle school girls to engineering. Since starting classes at the University of California, Santa Cruz, Marina has served as a student intern and is now a board member of the Creative Tech Design club, where she has collaborated with others in designing and prototyping projects, creating case studies, and hosting workshops for other students. She remains passionate about equitable access to technology, and plans to pursue a career in software engineering or product design after graduation.",
    "url": "https://top.mlh.io/2023/profiles/marina-lee"
  },
  {
    "name": "Cindy Mata",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "/in/cindy-mata",
    "website": "",
    "about": "Cindy Mata expresses herself creatively through so many mediums: fashion design, ceramics, and even metalsmithing. She applies that creativity to the generative world of programming. Since high school, she has been coding constantly, pushing her own boundaries and providing opportunities to other members of her community. Rising from Major League Hacking (MLH) hackathon attendee to hackathon organizer, Cindy has brought her creative mindset and dedication to each of her roles.\n\nIn the summer before her junior year, Cindy joined Girls Who Code and instantly clicked with coding. A mentor there told her about hackathons and how they could expand her horizons. She jumped on the opportunity, joining Bytehacks NY, an all-women-identifying event in the fall of 2018. The whole experience inspired her. She and her team stayed up late and woke up early to finish their HTML/CSS website. She says, “We would show off our Twitter API (the coolest thing ever for some 16-year-olds to figure out) and ultimately won an MLH prize for the best domain name (Grief Relief). It was amazing to feel like we accomplished something and didn’t go home empty-handed.” The energy and potential to create and grow was addictive to Cindy, and she’s never looked back.\n\nElectrified by her first hackathon, she signed up for TechTogether Boston in her senior year, which she calls “a life-changing experience.” She and her team attended workshops, developed a fantastic project, and fully immersed themselves in the community.\n\nDuring her time as a student at New York University, Cindy’s participation in hackathons led her to organizing her own. She strived to recreate the amazing experiences she had at hackathons for others. Whether fundraising, advertising, or directing, she has given back to the hacker community in myriad ways. Some of her achievements include serving as marketing director for TechTogether New York Fall 2021, sponsorship director for HackNYU Spring 2022, co-executive director for HackNYU in the spring of 2023, and planner for MLH Pizza Fund events from 2022-2023. Much of Cindy’s appreciation for hacking comes from how much she enjoys community events. For example, at Hackcon 2022, she bonded with other organizers while eating s’mores, sitting around a campfire, sleeping in a cabin, and eating her first cronut.\n\nHackNYU 2022, one of the events she helped organize, brought in over 800 participants and created a buzz throughout the hacker community. Many participating hackers were featured in their local newspapers and media outlets for carrying the torch of tech’s future. Cindy saw how inspiring hackathons can be and how many people they can affect. Though Cindy’s focus has shifted away from computer science—she majored in Cinema Studies and now works in Marketing and HR—her dedication to the hackathon experience has stayed strong.\n\nCindy Mata is an excellent example of how hackathons can draw people into a new community. She loved attending hackathons so much that she went on to organize them and link others to resources even as her career interests changed. Her passion and drive have paid off, not just for herself, but also for those lucky enough to attend her events.",
    "url": "https://top.mlh.io/2023/profiles/cindy-mata"
  },
  {
    "name": "Matt Espinoza",
    "age": "21",
    "devpost": "/MattEspoz",
    "github": "@MattEspoz",
    "linkedin": "/in/mattespoz",
    "website": "matthewespinoza.com/",
    "about": "When Matthew Espinoza watched The Social Network in 8th grade, he was immediately inspired to try coding for himself. He registered for every programming group he could find, learning Javascript through Codecademy and constantly picking up new skills. He worked as a teaching assistant for the city of Greater Sudbury, Ontario, as well as a museum guide at Science North, helping to lead activities for young science enthusiasts. By the time Matt had declared a major in computer science at Laurentian University, online courses with Udemy had introduced him to the world of technology.\n\nAfter joining the hacker community, Matt connected with new friends through Discord. Those friendships led Matt into online hackathons. After competing in the financial inclusion-centered hackathon Kiva Fall 2021, Matt went on to win Best Use of Conversational AI and 2nd place Overall at Treasure Hacks 3.0 for his work on JourneyGenie, an AI travel assistant which leveraged OpenAI’s existing large language model through API calls. Matt recently participated in ETHToronto, and will be joining hackNY to continue honing his programming and hacking skills this summer.\n\nPerhaps Matt’s most impressive accomplishment to date has been founding his own startup, Agora Labs, a social token and NFT infrastructure platform. When Matt raised close to $20,000 for $MATT, his first social token using DeSo Protocol, he kept himself accountable to token-holders through regular check-ins. His dedication to continuous progress meant he was always growing, and his friends and family saw Matt’s social token as a way to invest in his promising career. With the social token space booming amongst creators, Agora was one of the first platforms to make it easy for creators to connect their DeSo tokens and choose specific rewards and perks for their supporters.\n\nMatt continued to kickstart his career through Envision Accelerator and the RippleX Fellowship, scaling his knowledge of cryptocurrency at events organized by Kernel and the Crypto Society, and growing his web3 development skills through Developer DAO and Safary. Matt was admitted to the ultra-competitive Z Fellows startup fellowship,which includes mentorship from world-renowned founders of companies like Netflix, Eventbrite, DoorDash, and Tinder. Within weeks of Matt’s fellowship, Agora had secured over $100,000 in blockchain grants from DeSo, Harmony, and others, and reached a market cap of over $500,000 in under 72 hours on DeSo. In October of 2022, his startup was acquired by Talent Protocol and he joined the Talent Protocol team along with his co-founder, Freeman Zhang.\n\nMatt says, “the people are EVERYTHING in the hacker community.” Since Agora’s acquisition, Matt has worked to help others find success in their careers in tech. He has dedicated himself to helping other hackers scale and sell their side projects, and was also a founding partner of Inner Circle, the largest invite-only tech group in Canada. Over the last year, Matt has hosted 3 events with more than 800 attendees as part of Inner Circle. In 2023, Matt completed the Major League Hacking (MLH) Fellowship, where he gained valuable experience as a hacker and developed his skill set through working with MapRoulette. Matt continues to assist others in their journeys through his newsletter, The Compound Advantage.",
    "url": "https://top.mlh.io/2023/profiles/matt-espinoza"
  },
  {
    "name": "Olsen Budanur",
    "age": "22",
    "devpost": "/olsenbudanur",
    "github": "@olsenbudanur",
    "linkedin": "/in/olsenbudanur",
    "website": "olsenbudanur.com/",
    "about": "Some individuals stand out as natural leaders, and Olsen Budanur is one of them. With an exceptional work ethic, he’s gone above and beyond to create new opportunities for the hacker community and bring others into the world of tech.\n\nOlsen was a digital child growing up in the DC Metro Area. He loved video games and computers as a kid, but his love for tech really took off in middle school. Using VisualBasic’s GUI-based desktop app, he was able to create simple apps that got him excited for more challenging projects. His coding adventures took off in high school, and he credits Major League Hacking (MLH) hackathons with truly igniting his passion for code.\n\nOlsen’s first hackathon was VTHacks 7 in 2019. It was after this hackathon that his future became crystal clear. He says, “I discovered that I have a passion for coding and building things, and I enjoyed the challenge of coming up with innovative solutions to problems. After the hackathon, I continued to attend various events and meetups within the hacker community.”\n\nSince that first hackathon, he has attended seven more MLH Member hackathons. The enjoyment of building and coding things from scratch has kept his fire burning brightly, and he still thrives in the competitive environment hackathons offer. Through hackathons, he also discovered a side of hacking that he did not realize existed before: community. He says, “Being surrounded by like-minded individuals who share my passion for technology has been incredibly inspiring, and I have made lifelong connections as a result.”\n\nOlsen soon saw his potential as an organizer and a leader. When he enrolled in Davidson College, he jumped at the chance to create the school’s first ever student-led hackathon. Hack@Davidson brought in over 90 participants and Olsen’s team was able to raise more than $6,000 in funding, leveraging the MLH Pizza Fund, to support the event. The best part for Olsen was seeing the excitement, creation, and collaboration going on during the hackathon—he felt that he had made a remarkable contribution to his campus community.\n\nOlsen’s work didn’t stop there. He also founded Competitive Coding at Davidson, which has proven to be a great success. C-CAD prepares members for software engineering jobs and internships, hosts workshops, and competes in hackathons. The team has won 11 prizes across 7 hackathons, including a first place award at CalTech.\n\nWhether Olsen is busy hacking, organizing, or forging new ventures, he is always on an upward track. He says, “I hope to continue to make a positive impact and inspire others to pursue their passion for technology and innovation.” At this rate, he’s well on his way to achieving those hopes.",
    "url": "https://top.mlh.io/2023/profiles/olsen-budanur"
  },
  {
    "name": "Samyok Nepal",
    "age": "19",
    "devpost": "/samyok",
    "github": "@samyok",
    "linkedin": "/in/samyok",
    "website": "yok.dev",
    "about": "Samyok Nepal grew up in small-town Brookings, South Dakota. Without the big-city amenities so many are used to, he spent his free time tinkering with gadgets and machines. Before being accepted to a bachelor’s program in computer science at the University of Minnesota, Samyok had no formal computer science education. When he started learning coding online during his junior year of high school, Samyok discovered he could use his curiosity and drive to create things that made a difference in the world. “I was hooked,” he said.\n\nWhile Samyok didn’t start developing software until his junior year, his talents still had an outsized impact on his high school community before graduation. One of the first projects Samyok created was Bobcat Notify, an app that sent reliable emergency alerts to students, staff, and parents, which was downloaded over 2,000 times, more than double the number of students in the school!\n\nSeeking to develop his skills further, Samyok and his sister registered for their first hackathon, Sonoma Hacks. Not only did their project win, but Samyok was motivated by the environment of  like-minded individuals who were all passionate about technology. During his gap year between high school and college, Samyok became an active member of the hacker community, and has since competed in more than 20 hackathons. He has submitted winning projects at several hackathons, including HackMIT, HackNYU, TAMUhack,and HackUIowa, as well as hackathons centered on social good like Hacking 4 Community and Santa Clara University’s Hack for Humanity. In addition to developing his technical skills, Samyok credits hackathons with enabling him to build a network of like-minded individuals who he can turn to for support and mentorship.\n\nSamyok says he is not sure he would ever have left his hometown if he hadn’t been exposed to the hacker community. He believes hackathons and his career in computer science have given him the ability to climb the socioeconomic ladder. In addition, Samyok says, “being part of the hacker community has given me a sense of belonging.”\n\n“Recognizing my privilege and the opportunities that have been afforded to me,” Samyok says, “I have made it my mission to help others in the hacking community.” At HackUIowa and HackNYU, Samyok helped his team of inexperienced hackers win first place, and says they have all since found their own footing in the tech industry. At the University of Minnesota, Samyok has worked hard to drive hackathon engagement among students—this year alone, his university is sending 16 students to LA Hacks. Samyok is also organizing the University of Minnesota’s first novice hackathon, which will take place this academic year.\n\nThrough his work with Social Coding at the University of Minnesota, Samyok led a team in building Gopher Grades, which allows students to view unbiased grade distributions and class ratings when building class schedules. It has been used by more than 30,000 students to conduct more than two million searches. In his role as lead, Samyok has brought eight freshmen onto the team this semester, guiding them through web development. He is also heavily involved with Code the Gap, where he volunteers as a mentor, teaching coding to between 15 and 20 underprivileged middle school and high school students. During his gap year, Samyok founded the Dakota Debate Institute, a non-profit dedicated to expanding accessibility in high school speech and debate. With each new organization he creates or partners with, Samyok strengthens his impact on individuals and the hacker community as a whole.",
    "url": "https://top.mlh.io/2023/profiles/samyok-nepal"
  },
  {
    "name": "Mareline Ramirez",
    "age": "24",
    "devpost": "/mrami204",
    "github": "@mareline",
    "linkedin": "/in/mareline",
    "website": "",
    "about": "Mareline Ramirez had always thought she would pursue a career in healthcare, electing for a major in Health and Human Concerns at Florida International University and even working as a medical assistant for several months. She was also heavily involved in her campus community as the Vice President for APPA at FIU, FIU’s pre-physician assistants organization. During the peak of COVID-19 lockdowns in 2020, Mareline learned coding basics and created the club’s website to better communicate and share resources with members virtually. Her efforts attracted 300+ additional club members. Mareline loved the experience of learning to code, and felt fulfilled creating something which had an immediate and tangible impact on others.\n\nWhen Mareline graduated from FIU she still had a passion for coding, but was unsure how to put it to use. Initially, she was nervous to pursue a career in technology. Women are still underrepresented in Miami’s tech industry and face gaps in access and resources. Not to mention that most of Mareline’s network was based in healthcare. Luckily, she had a few friends who studied computer science, and they encouraged her to build on her passion for coding. Just a few months later, Mareline began a second degree at FIU in computer science.\n\nSwitching to a career in tech after so much time in healthcare wasn’t always easy. Mareline enrolled in the Microsoft Tech Resilience mentorship program shortly after deciding to study computer science, but felt timid and out of place in her male-dominated classes. However, she found excellent mentors at Reboot Representation, and credits her friend Danay Fernandez (president of FIU Women in Cybersecurity) for providing her with the resources she needed to get started in computer science. Through Danay, Mareline was introduced to TechTogether, a series of hackathons focused on narrowing the gender gap in technology.\n\nWhile Mareline’s first hackathon experience at CodeDay 2021 certainly helped to grow her skillset, she believes the experience of participating in TechTogether Chicago 2022 was pivotal in her career. Mareline says she immediately felt welcomed and resonated with TechTogether’s mission of empowering marginalized genders in tech. Mareline has always been passionate about tackling gender inequality, so when she had the opportunity to follow Danay in leading TechTogether Miami as the Chapter Director, it seemed like the perfect fit.\n\nIn her role as Chapter Director, Mareline has been able to help bridge the gender gap in the Miami tech community and provide support to students coming from similar non-traditional backgrounds. She continues to provide support for other students, and has gotten involved in a number of other gender-focused events in the Miami-Dade area like Code/Art Fest 2022, FIU’s Women in Tech Conference (WiTCON), HackaBull 2023, and Technica 2022. In addition to her role as Chapter Director for TechTogether Miami, Mareline stays actively involved in the hacking community through her university’s chapters of Women in Computer Science, INIT, and Break Through Tech.",
    "url": "https://top.mlh.io/2023/profiles/mareline-ramirez"
  },
  {
    "name": "Sarah Graywood",
    "age": "31",
    "devpost": "/smgraywood",
    "github": "@smgraywood",
    "linkedin": "/in/smgraywood",
    "website": "",
    "about": "Sarah Graywood has always had a knack for mentoring others. A career educator who recently made the switch to a career in tech, Sarah has been able to leverage her impressive background in education to both share her knowledge with others and develop her skills as a programmer in her own right.\n\nFor someone who has always loved being a mentor, leaving a career in teaching was a difficult decision. Before Sarah decided to pursue a career in tech, she was working more than 60 hours a week, struggling to find time for her family and feeling the drag of perpetual burnout. During the height of the COVID-19 pandemic in 2021, teaching more than 100 students remotely, Sarah became interested in how the technologies she used to connect and educate students actually worked. She started using a mobile app to code on her 15-minute breaks between classes. Within three months, Sarah had been admitted to a Techtonica bootcamp, and she was able to translate that experience into an internship with Flickr beginning that fall.\n\nAfter a hiring freeze at Flickr prevented her from securing a full time position with the company, she learned about Major League Hacking (MLH). The CEO of her Techtonica bootcamp recommended she continue learning through the MLH Fellowship. Sarah initially felt intimidated about applying, knowing she would be up against career hackers. But Sarah thrives on the challenge of overcoming adversity, so she applied anyway. She was admitted for the Fall 2022 season, and participated in her first hackathon, the MLH Fellowship Orientation Hackathon, where she developed an even greater love of programming.\n\nSarah says the support from MLH Fellowship friends and fellow hackers has helped her learn and grow, while also allowing her to guide others. Sarah is grateful for the hackathon experience, which she says has helped her hone her programming skills while gaining exposure to completely new concepts. She has felt less stress, is able to better balance her work and life, and feels like she truly enjoys her new career in tech.\n\nThis isn’t to say Sarah is no longer practicing her skills as an educator. As a woman of color in a field where both women and people of color are underrepresented, Sarah understands the challenges many new hackers face in building a career in tech. Her experience as an educator, which totals more than a decade, makes her well-suited to mentor others and to understand their unique circumstances. She believes her ability to empathize with others makes her stand out within the hacker community. Sarah is passionate about diversity, equity, and inclusion, and focuses her efforts on increasing accessibility for hackers who have had non-traditional paths and lacked the resources to attend computer science programs. Recently, she was admitted to the Adobe Digital Academy, and has since secured an internship with Adobe starting this June. She plans to continue on to a career in full stack software engineering.",
    "url": "https://top.mlh.io/2023/profiles/sarah-graywood"
  },
  {
    "name": "Kari Groszewska",
    "age": "21",
    "devpost": "/karolina-groszewska",
    "github": "@KarolinaGroszewska",
    "linkedin": "/in/karolina-groszewska",
    "website": "karolinagroszewska.github.io/",
    "about": "Since creating her first Hannah Montana fan site in 2012, Kari Groszewska has had a passion for technology. Early on, Kari saw the potential of technology to impact issues that were deeply important to her, and says she does her best to “ensure whatever I work on has that same effect, whether on myself or others.”\n\nGraduating from high school during the height of the COVID-19 pandemic left Kari itching for interaction with her peers. She found the community she needed when one of her friends introduced her to her university’s hackathon, VandyHacks. At the event, her team was matched with a local center for victims of sexual assault. The experience of collaborating with other hackers to create a project with a real-world impact inspired her desire to organize events like VandyHacks for her community.\n\nBy her second semester at Vanderbilt University, she had joined the VandyHacks organizing team as a Director, and has since served as President and Senior Marketing Advisor. Kari says, “Getting to flourish into a leadership position as a freshman with the guidance of the experienced organizers around me taught me the power of mentorship and provided me with the community I really needed.” The feedback they received after bringing VandyHacks back to an in-person format showed her just how important the hacker community was to fellow Vanderbilt students. VandyHacks is certainly in good hands, as Kari has helped select “incredible organizers who share my passion for technology and drive to provide amazing opportunities for others.”\n\nInspired by her experience organizing VandyHacks, Kari decided to become a Major League Hacking (MLH) Coach. In the role, she has grown as both an organizer and a hacker in her own right. Kari has since participated in WiCHacks, UA Innovate, and several VandyHacks events. Currently, she hosts monthly mobile and  accessibility workshops at  Global Hack Week events. She has also stayed active in Vanderbilt’s broader tech community, striving to bridge gaps in access and share her love of technology with others through her work as the Vice President of Programming and the Grace Hopper Coordinator with Vanderbilt’s chapter of Women In Computing. Kari believes the hacker community is about much more than hacking, and says that “learning, growing, and developing technically or otherwise can come from so many other aspects of this community.”\n\nKari recently landed an internship with Apple, where she will work through the summer as an Watch Automation Engineering Intern, and she continues to serve as an MLH Coach. Through workshops, hackathons, and community events, Kari relentlessly shares her passion for technology.",
    "url": "https://top.mlh.io/2023/profiles/kari-groszewska"
  },
  {
    "name": "Harshita Sharma",
    "age": "21",
    "devpost": "",
    "github": "@harshita214",
    "linkedin": "/in/harshita214",
    "website": "",
    "about": "Harshita first discovered coding when she was in high school in India. After finishing her first project, a simple website about herself which she created using HTML, Harshita was inspired to learn as much as she could about technology. Harshita says her love of programming stems from her love of the continuous process of effort, of trying and failing and trying again. But the process of trying and failing until you get it right is much more challenging in front of others, and for Harshita—who saw herself as quiet and insecure in high school—getting involved in the hacker community was a big decision.\n\nBy her sophomore year at the Birla Institute of Technology Mesra, Harshita was beginning to overcome her doubts, and decided to register for Hacking Heist as a solo participant. She enjoyed the experience enough to register for TechTogether New York the following month, where she submitted a winning project with her team. Through her early hackathon experiences and workshops at her school, Harshita slowly realized that her doubts about others judging her for not knowing things were misplaced, and that the hacker community was encouraging and welcoming.\n\nWhile Harshita initially liked to hack solo, support from peers and mentors at hackathons helped her find the courage to begin working with teams. Not only has she developed exceptional cooperative skills from participating in hackathons, but she says it has been a lot of fun just participating and meeting completely new people who turn out to be great friends.\n\nAs a first-generation tech student herself, Harshita knows how challenging it can be to build a career in tech without guidance. When she first applied for classes at the Birla Institute of Technology, she did not make it into the ultra-competitive computer science program, and instead enrolled in electronics and communication. But through her efforts she was eventually accepted  into the computer science program. Her experiences sparked her passion for mentoring others and drove her to get involved with Go Girl Organisation, which focuses on empowering underserved communities through technology. Harshita says it is an amazing experience to teach young students and create presentations for them as part of Go Girl, and if any of them decide on a career in tech in the future, she will consider herself “successful and accomplished.”\n\nHarshita says she has “always believed in giving back to society and making technology accessible for all.” One of her favorite projects to date has been a browser extension for Google Chrome called Alexia, which aims to help people with dyslexia read text more easily. She has worked on a number of projects aimed at helping others, including a sign language interpretation platform she created using MATLAB at HackMerced VII.\n\nHarshita remains actively involved with Major League Hacking (MLH), Go Girl Organisation, Women Who Code, and Girls Who Code. She is also the open source lead for her university’s chapter of Google Developer Student Clubs and the sponsorship coordinator for her school’s technical committee. In 2022, she was awarded a Palantir Global Impact scholarship. She credits her family for her success, because they consistently encourage her to be the best she can be. She recently joined MLH as a Marketing Coordinator, and will continue to serve as a mentor for younger students blazing their own trails.",
    "url": "https://top.mlh.io/2023/profiles/harshita-sharma"
  },
  {
    "name": "Indira Sowy",
    "age": "19",
    "devpost": "/indira-sowy",
    "github": "@indywip",
    "linkedin": "/in/indirasowy",
    "website": "indywip.vercel.app/",
    "about": "Indira Sowy has been on quite a journey. She attends the University of British Columbia across the world from her hometown in the Philippines. With no formal computer science education growing up, she overcame the odds and is now an avid hacker.\n\nWhen she was a child, Indira loved tinkering with toys and machines. However, she faced obstacles that slowed her progress and made her feel the tech field was out of reach. As she says, “My high school never provided any classes to learn more about computer science topics, and I was discouraged by my peers from pursuing a career in such a male-dominated field, telling me I wasn’t suited for it.” Refusing to give up, Indira pursued online learning opportunities to teach herself programming. By the time college came along, she had the tools to succeed in computer science.\n\nHer first hackathon, Uberposition 2021, pulled her far out of her comfort zone. At the hackathon, she joined a group of strangers she met through the event’s Discord server. Although her team did not win the event, the hackathon helped her overcome her lingering self-doubt and develop new tech skills.\n\nThis experience opened Indira up to a new future in hacking, and she has since entered multiple hackathons, improving her skill set and broadening her horizons in tech each time. In her third hackathon, cmd-f 2022, she won the MLH Most Creative Use of GitHub prize and the UBC Project Incubation Prize, earning her the opportunity to build new technologies through her university’s Computer Science department. She also competed in Hack the 6ix 2022, placing as a Top 8 Finalist and getting to present her project in front of accomplished judges. Her project at Hack the 6ix won the MLH Most Creative Use of Twilio prize.\n\nHackathons helped her land her first internship as a Software Engineering Intern, as well as many more in the following summers, and landed her a spot in the Major League Hacking (MLH) Fellowship Prep program. Outside of hackathons, she is involved with Rewriting the Code, Girls Who Code, UBC Launchpad,  and ElevateTech, and helps organize ElevateHacks and Juvenile Hacks.\n\nIndira’s career at UBC has taken many turns. She struggled in many of her early hackathons to the point of nearly giving up, but the MLH community came through for her. She discovered a mentor who gave her the valuable advice to view hackathons as learning experiences, not just as events to win. Once Indira adopted that mindset, her hacking career took off and her potential was unleashed.\n\nThis change naturally pushed Indira into mentoring others. She understood the frustration of being the least experienced coder in the room. As she gained new skills, she turned towards coaching, especially for women-identified hackers going through what she did so recently. She says, “Now, I am glad to give back to my community and offer guidance to those doubting their abilities to succeed in the field.”\n\nIndira has demonstrated what a willing mind and strong determination can do. She is an example of what people are capable of achieving if they keep moving forward when others tell them to quit.",
    "url": "https://top.mlh.io/2023/profiles/indira-sowy"
  },
  {
    "name": "Jaival Patel",
    "age": "18",
    "devpost": "/ZuckTheLizard",
    "github": "@GEEGABYTE1",
    "linkedin": "/in/jaivalpatel",
    "website": "www.jaivalpatel.com/",
    "about": "With such an accomplished hacking career, you’d be forgiven for thinking Jaival was much further along than the 11th grade. Inspired by Baymax, the heroic healthcare droid created by protagonist Tadashi Hamada in Disney’s Big Hero 6, Jaival enrolled in a program with Exceed Robotics at age 8. Jaival says that his first experiences coding LEGO® MINDSTORMS® and building home automation systems with Arduino boards sparked an early passion for programming hardware. It wasn’t until his friend introduced him to the Linux terminal that he discovered an interest in software engineering.\n\nAs a kid, Jaival was certain he wanted to become an astronaut. At night, he would dream about traversing the galaxies and research the steps to being hired by NASA. But upon realizing that the process involved strenuous physical tests and that only ten applicants out of more than 12,000 end up making the cut, Jaival pivoted to using his love of math and programming to further his dreams of exploring space. Jaival took more than forty courses in computer science and artificial intelligence by the time he finished middle school, and was recognized with his school’s science award in the 8th grade for his work on a planet-detection neural network created using Python.\n\nIt was not immediately clear to Jaival how he would be able to use his love of math and programming to break into the space industry. With encouragement from his middle school community, however, Jaival was inspired to grow his skillset as a programmer even further by participating in hackathons. At his first hackathon, XdHacks Mini, Jaival says he was “completely lost,” and ended up missing the mark on the theme of medical hospitality, instead creating a project which optimized signals between Earth and orbiting telescopes. But the support from his peers at the hackathon and the interest his work attracted as the only space-related project encouraged Jaival to make the hackathon experience a staple of his burgeoning career.\n\nJaival’s high school never had a formal hacking club, even with the student body’s high interest in computer science during the pandemic, so Jaival and his friends took the initiative to create their own. Within a year, the club had attracted more than 400 students from across all grade levels. Jaival has also shared his knowledge with others every chance he’s gotten, providing other students with weekly mentoring in algorithms and competitive programming, along with hosting events to inspire students to ship more projects they are interested in. Jaival has competed in more than thirty hackathons himself, including submitting winning projects at Hack the North and JAMHacks, and has also acted as a mentor at renowned hackathons like Hack the North and UofTHacks.\n\nJaival also strives to share his knowledge with others in his role as a core Computer Science and Mathematics Researcher for Medium’s Towards Data Science, where he writes articles and creates relevant projects which touch an average of 300 readers a month. Jaival strongly believes “everyone should have the opportunity to live their lives to the fullest and have the resources to fulfill their purpose and dreams.” Putting his goals into action, Jaival and his team at BubbleDAO were able to raise over $10,000 and host 85+ web3 hackathons and in-person events all last summer for new artists and developers to showcase their work. Jaival continues to volunteer as a teaching assistant with CommunityAI, helping young students develop a passion for technology.  Jaival is the author of Beauty Of Mathematics, a book including mathematical proofs of fifteen pure-math theorems and an analysis of their applications to real-world industries. Recently, he worked with Ethereum developers on Radio, which took 2nd place at ETHNewYork and has attracted over 1,000 Web3 developers to date.",
    "url": "https://top.mlh.io/2023/profiles/jaival-patel"
  },
  {
    "name": "Cynthia Akanaga",
    "age": "19",
    "devpost": "/cakanaga",
    "github": "@Cakanaga",
    "linkedin": "/in/cynthia-akanaga",
    "website": "cynthia-akanaga.netlify.app/",
    "about": "Cynthia Akanaga is on her way to being certified as a student skydiver, but up until last year, she thought pursuing computer science would be too huge a leap. Originally from Imo State, Nigeria, Cynthia now attends Mount Holyoke College. In addition to pursuing her degree, she’s served as an organizer for TechTogether Boston and made a splash at hackathons like Rewriting the Code’s Black Wings Hacks, which was organized by previous Major League Hacking (MLH) Top 50 recipient Governess Simpson.\n\nCynthia's passion for technology and coding began by chance during her first semester of college when she took an introductory computer science course. Despite struggling in class, Cynthia enjoyed the challenge and was drawn to the possibilities that the field offered. She found support and encouragement from other women in technology through organizations like Rewriting the Code, which helped her navigate the tech industry and foster a sense of community. Since finding community, she has been pursuing a computer science degree and is particularly interested in artificial intelligence and machine learning. She hopes to use her skills to solve real-world problems.\n\nHer first hackathon experience was at Rookie Hacks II, when she realized her potential to learn and grow exponentially. Though Cynthia attended her first hackathon in 2022, she has already served as an organizer for TechTogether Boston. She says she felt inspired to “give back to the community and learn what it’s like to be on the other side.”\n\nShe has since strived to create a more inclusive environment for underrepresented groups, particularly women in tech. Cynthia has supported her peers by offering support, guidance, and mentorship to women who are starting out in tech. She creates one-on-one connections with others in her hackathon teams, listening, sharing her experiences, and providing advice on navigating the industry. As she says, “I find myself in the midst of a support system I had never known about.” She hopes to inspire and encourage more women to pursue careers in technology and help them feel confident and empowered.\n\nCynthia has also strengthened her community by organizing events and hackathons that promote diversity and inclusivity. She states, “by providing a platform for individuals from all backgrounds to come together and collaborate on innovative projects, we can help break down barriers and create a more welcoming community.” She is proud both of her Nigerian heritage and of her positive impact on the hacker community.",
    "url": "https://top.mlh.io/2023/profiles/cynthia-akanaga"
  },
  {
    "name": "Charlotte Lin",
    "age": "21",
    "devpost": "/cxl229",
    "github": "@cxl229",
    "linkedin": "/in/charlottexlin",
    "website": "www.charlottexlin.com/",
    "about": "Charlotte Lin sees the potential for creativity and self-expression in computing, and she wants to share it with the world. A recent graduate of New York University, Charlotte has forged a unique path and is on her way to more successes.\n\nCharlotte’s introduction to coding came in high school, when she took a summer course on C++. She already had a passion for creating, but seeing how coding can produce tangible products and drive positive change was all the motivation she needed to dive in headfirst. For her, that meant voluntarily staying up late at night hammering out code, enjoying the learning process and pushing her own boundaries to discover new skills. Creating apps, digital art, games, and websites are just some of the ways she uses tech imaginatively. As she says, “To me, coding is the perfect combination of creativity and logic, and it’s my true passion!”\n\nAfter discovering her love of code, Charlotte started off on her hacking journey. Inspired by her brother, she attended her first hackathon, HackBCA IV, in March of 2017. What stood out to her about hackathons was how much fun they were, and she realized that coding can be a joyful community experience. She recalls, “Hackathons are the perfect way for people to experience how fun coding can be, and to inspire young students to get into tech.” Since then, she has entered many hackathons, using them as arenas to demonstrate and develop her STEM, artistic, and analytical talents. She has been on a hacking spree, attending events like HackUC 2017, Ludum Dare 48 Game Jam, Acts 2 Campus Hack in Place 2.0, PearlHacks 2021, HackNYU 2022, HackNYU 2023, and Hack@CEWIT 2023.\n\nCharlotte has been floored by the connections she has made over the years in the hacker community. Friendships with people in her city, in other states, and even in other countries have blossomed through her exploration of tech. Beyond that, she has learned more about herself. She says, “When I discovered coding, it was like a lightbulb went off. This was the way for me to use all my skills and talents.” Her background in art, web design, game design, and math combine to create innovative projects with real-world impacts.\n\nToday, she strives to encourage others to follow their coding dreams. She mentors middle-school students and teenagers, with an emphasis on helping young women break barriers and explore the world of technology. Computer science can be portrayed as dry and boring, but Charlotte is out to change that image. She knows that the fun and excitement of coding, app development, and hackathons can be contagious.\n\nWhen she was little, Charlotte wanted to be a painter. Her middle school dream was Broadway, and high school saw her marching with the band. “I also had an aptitude for math and a keen interest in technology,” she recalls, “which was something I figured I’d have to give up in order to pursue my creative passions.” Through the hacker community, she realized how creative computer science can be—and rather than giving up on her interests, she’s gained new ones. Her creative approach to coding and dedication to mentoring others will no doubt have a unique impact on the world of computer science.",
    "url": "https://top.mlh.io/2023/profiles/charlotte-lin"
  },
  {
    "name": "Aaryan Arora",
    "age": "21",
    "devpost": "/aaryan2134",
    "github": "@aaryan2134",
    "linkedin": "/in/aaryan-arora-a956b8203",
    "website": "aaryan2134.github.io/",
    "about": "Aaryan Arora is a passionate hacker from New Delhi, India. He is currently pursuing his engineering degree from Delhi Technological University. While he is well on his way to personal success in tech, he is also raising others up along the way.\n\nAaryan's love for technology began at a very early age, when he started playing computer and console games, which inspired him to delve deeper into the world of electronics and robotics. Aaryan's first major encounter with coding was early—in the sixth grade—through the Arduino platform, where he wrote his first program. Robotics was his main focus early on, and he still loves creating and tinkering with robots. With a competitive streak in him, Aaryan entered numerous competitions in high school, broadening his skill set and developing winning strategies.\n\nAaryan's journey as a hacker took off during college in 2021, in the middle of the COVID-19 pandemic. His first hackathon was Vihaan 4.0, which was organized by the IEEE Society at his college. He says, “It was great fun communicating with my teammates, meeting mentors, discussing and presenting to the judges, and most importantly, building something fun, impactful, and exciting.” He knew that hacking was the path for him, but he had no idea how much more he’d go on to accomplish.\n\nThis experience ignited a passion in him, and he has since participated in over 50 hackathons, finetuning his people skills and tech abilities. Some examples of his development as a hacker include learning ML at Vihaan 4.0, VR at HackWithInfy, and Microsoft Graph at Hack Together, as well as experimenting with new APIs at various Major League Hacking (MLH) hackathons. He credits MLH for boosting his speaking, presentation, communication, and time management skills.\n\nApart from being an active hackathon participant, Aaryan has made significant contributions to the hacker community. He is an active member of various societies at his university, including the Mathematics Society, Finance Society, and Coding Society, where he has organized several hackathons and competitions. He has partnered with students from different locations like Pakistan, the DRC, and Nigeria, and is dedicated to skilling up others and organizing various competitions and hackathons at the community and global levels.\n\nAaryan is always giving back to fellow hackers. He is an active member of the Microsoft Learn Student Ambassador Community and has hosted over ten events. His whole focus is on helping others build skills and learn to compete as a team. He has also started a community, which has now grown to over 250 members, for students to share knowledge, coach each other, and participate in competitions and hackathons. Aaryan thrives in his role as a mentor to several hackers, helping them with technology, presentation, and other aspects of hackathons.\n\nAaryan Arora is a dynamic and valuable member of the hacker community, making a significant impact through his passion for technology, community building, and mentorship. His story is centered on a strong desire to learn and build. As he says, “learning and exploring [are] what I believe hacking is and what makes me a hacker in this community.”",
    "url": "https://top.mlh.io/2023/profiles/aaryan-arora"
  },
  {
    "name": "Utkarsh Tiwari",
    "age": "25",
    "devpost": "",
    "github": "@utk09",
    "linkedin": "/in/utkarsh09",
    "website": "utk09.github.io/",
    "about": "Utkarsh Tiwari, also known as UT, grew up in a family of teachers. He’s used his skill as an educator to support people across the hacker community. Utkarsh is an active member of the Major League Hacking (MLH) community as a Pod Leader in the MLH Fellowship program and as an MLH Coach. Outside of MLH, he is involved in Lions Clubs International, Leo Club of Walkeshwar Achievers, Leo District 3231 A1 and Leo Multiple 3231. Utkarsh hails from Mumbai, India, and attended Newcastle University in the UK.\n\nUtkarsh's journey into technology began with his study of electronics and telecommunication engineering at K J Somaiya Institute of Technology. Initially, he struggled with programming. Engineering was new to him and he was discouraged by feeling lost in a complex subject. Luckily, the process of building robots reengaged his passion for hacking and led him to discover a new interest in hardware. He went on to serve as CTO and later the chairperson of KJSIT-IETE, where he experimented with microcontrollers and various programming languages. Today, he shares this knowledge and experience with the entire hackathon community.\n\nUtkarsh's first introduction to hackathons was at BackyardHacks 2020. He went on to join several other MLH hackathons, and enjoyed the experience so much that he was inspired to organize his own hackathon, Hackticks. He says, “Participating in hackathons has had a profound impact on my personal growth. I’ve become more confident and sociable, shedding my former stage fright and learning to communicate effectively with people from diverse backgrounds.”\n\nParticipating in hackathons has been a transformative experience for Utkarsh. He enjoys giving back to the community in his role as an MLH Coach and Pod Leader. He approaches teaching with a patient and supportive attitude, ensuring that coders have what they need to successfully build a project.\n\nHe says, “I believe that by fostering a culture of collaboration and mutual support, we can build a stronger and more resilient hacker community. I’m always eager to motivate and inspire others to work together, share their knowledge and skills, and grow both as individuals and as a team.” He brings a powerful combination of empathy, teaching ability, and knowledge to boost future hackers to their full potential.",
    "url": "https://top.mlh.io/2023/profiles/utkarsh-tiwari"
  },
  {
    "name": "Raj Gaurav",
    "age": "23",
    "devpost": "",
    "github": "@RajGM",
    "linkedin": "/in/rajgm29",
    "website": "hashnode.com/@RajGM",
    "about": "Raj Gaurav lives on his own terms. He is a driven open-source contributor, hacker, mentor, and Major League Hacking (MLH) Fellow from Pratapgarh, Uttar Pradesh, India, currently based in Bangalore. He attended the University of London and has served as an XRPL Campus Ambassador, as well as a mentor at The Collab Lab and HackYourFuture. Raj is a self-taught software and electronics engineer who has always had an interest in linguistics, mathematics, science, and video games.\n\nHis passion for technology started when he got his first computer. He went on to teach himself how to code and build games, learning full-stack web and mobile development, system design and architecture, and even delving into electronics programming, leading him to his current work with machine automation.\n\nIn the 7th grade, he discovered the hacking community, where he found other hackers, coders, developers, and engineers who shared his passions. Raj joined communities like Overthewire, and his  journey in tech took a turn for the better. Though Raj has always been a self-directed learner, he credits the things he learned from various tech communities with kickstarting his success.\n\nRaj's story stands out in the hacker community. As a self-taught software and electronics engineer, he chooses to pursue his education on his own terms. He has developed intense discipline in order to lead a healthy and productive life. He is quick to acknowledge that conventional paths aren’t for him, and has dropped out of established engineering programs to learn directly from industry veterans. He works remotely, studies remotely, and travels to different cities every few months to learn about culture and diversity with the stipends he earns from internships and freelancing projects.\n\nRaj’s independence doesn’t mean he works alone. Through the MLH Fellowship he has built a wide network of collaborators. Raj looks forward to doing more community building through his job as a SWE at DPS Munich and at START Hack Switzerland. Raj frequently volunteers at coding bootcamps, hackathons, and open-source programs. He is mentoring at HackYourFuture and leads the South Asia chapter for The Collab Lab. He has mentored at more than 40 hackathons including HackHarvard, GreatUniHack, SheCodeAfrica, and Codepath.\n\nWhatever new project he takes on or new community he joins, Raj is always finding his own way forward. Currently, Raj is building InfiOpp.com, a community-based opportunities board to support developers seeking opportunities in tech. A stellar example of self-motivation and independence, Raj is an inspiration to other hackers pursuing nontraditional paths, and a reminder that there is no wrong way to pursue a career in technology.",
    "url": "https://top.mlh.io/2023/profiles/raj-gaurav"
  },
  {
    "name": "Samyuktha Gopalsamy",
    "age": "24",
    "devpost": "/samyukthagopalsamy",
    "github": "@samyukthagopalsamy",
    "linkedin": "/in/samyukthagopalsamy",
    "website": "",
    "about": "Samyuktha is the first to admit that technology wasn’t always her passion. She initially pursued a biology major, but she slowly realized that her passion for biomedicine was more about the process of creating something with a real-world impact than about the field itself. Seeing how computer science would enable her to channel her spark for creating and problem-solving, Samyuktha began to teach herself coding and web development in her spare time. Before long, she secured a merit seat to pursue a Computer Science degree at PSG College of Technology in Coimbatore, India.\n\nA pivotal moment for Samyuktha was developing an Android app designed to serve patients seeking treatment for bipolar disorder. This project highlighted the profound impact of her technical skills. The app aimed to facilitate treatment by establishing a connection between doctors and patients. It enabled doctors to monitor pill intake, sleep patterns, and mood while scheduling necessary appointments. Notably, the app was part of a study, conducted by the Psychiatry department at PSG Hospitals in Coimbatore, assessing the effectiveness of smartphone applications in enhancing bipolar disorder treatment. Its significance was further magnified by its potential to aid patients during the COVID-19 pandemic, when quarantine and social distancing measures were in effect. Samyuktha successfully constructed the app after teaching herself to use technologies like Flutter and Firebase.\n\nAfter participating in aComputer Science & Engineering Association (CSEA) hackathon in 2018, Samyuktha became a hackathon regular.  She deepened her involvement in the hacker community when she was accepted as a Microsoft Student Ambassador, seeking to grow her skills and network outside of class. From the start, Samyuktha wanted to create a community of like-minded tech enthusiasts at PSG. She hosted several events, speaking about Azure and Blockchain as well as introducing Microsoft Learn to more than 150 of her peers. Through the AWS Educate Cloud Ambassador Program Samyuktha was able to assist student-led startups and coordinate AWS Community Day India in 2020, which has since garnered over 28,000 views.\n\nSamyuktha says, “in all my roles, I have been intentional about advancing diversity and equity in tech.” After completing her bachelor’s at PSG in 2021, Samyuktha was accepted to a master’s program in computer science at Rutgers University, where she has served as the president of the Computer Science Graduate Student Society and as a Graduate Mentor with the Douglass Women in Science and Engineering (WiSE) Program, helping guide undergraduate women through their Rutgers careers. In her role as a member of the Diversity, Equity, and Inclusion (DEI) Graduate Student Advisory Committee, she has worked to further DEI initiatives at the university.\n\nOutside of Rutgers, she has worked as a mentor for Our Future Is Science, helping three high school students make a difference through social justice and science. Her work has included co-creating capstone projects for the students including lab work, research, and presentations. Samyuktha has also volunteered as an academic support and life skills mentor with Make A Difference, teaching 10th grade math to five students in need of mentorship. In 2021 Samyuktha completed an Outreachy Fellowship with the Mozilla Firefox Data Team, and in 2022 she  interned as  a Production Engineer with Meta. She has since gone on to refine her skills through the Major League Hacking (MLH) Fellowship, collaborating with her pod to create a React weather app. A strong believer in community, she also helps organize events through the MLH Pizza Fund. In her spare time, Samyuktha has been practicing Bharatanatyam, a classical Indian dance from the state of Tamil Nadu, for the last 16 years.",
    "url": "https://top.mlh.io/2023/profiles/samyuktha-gopalsamy"
  },
  {
    "name": "Celina Cywinska",
    "age": "21",
    "devpost": "/software/cody-3sftkd",
    "github": "@cellinacywinska",
    "linkedin": "/in/celina-c-1178591b4",
    "website": "",
    "about": "Celina never planned on pursuing a career in tech. Her senior year of high school, she was dead set on moving to the US to study psychology. However, recognizing the high cost of studying abroad, she made the spontaneous decision to stay in Poland and enroll in a Bachelor of Engineering program in computer science at the Polish-Japanese Academy of Information Technology (PJAIT).\n\nCelina was always independent, believing she could solve any problem by herself. But she also dealt with nagging doubts about her abilities as a programmer. “I would feel embarrassed to reach out to others for help,” she said, and found herself constantly asking: “What if people think I’m not good enough?”\n\nWhen Celina found the Major League Hacking (MLH) community through the MLH Fellowship in the summer of 2022, she had already been studying computer science for 2 years. But it was through the hacker community, and not her classes, that she began to overcome her self-doubt and blossom into the successful hacker she is today. The community she joined during the MLH Fellowship showed her that asking questions was not a sign of weakness, but a marker of strength and a means to grow. Celina’s first hacking experiences were overwhelmingly positive. She participated in the MLH Fellowship Orientation Hackathon and the Fall 2022 orientation hackathon, where she was recognized for her work on Cody, an AI chatbot for computer science students.\n\nThrough hacking, Celina says, “I have learned how to ask meaningful questions, how to communicate my problems, and how to feel confident in difficult situations.” In addition to improving her technical skills, Celina believes the hacker community has been the biggest catalyst for her personal growth. Despite being more than two years into her hacking career by the time she found the MLH Fellowship, she considers it the most significant milestone of her career thus far. Inspired by mentors, pod leaders, and the new friends she met, she began to realize the importance of contributing to a team.\n\nWhat keeps Celina going are the possibilities computer science presents for solving real-world problems, which can make a visible and tangible impact on the community. She is using her knowledge as a hacker to create actionable change in her community. Currently, she is partnering with local hospitals in Warsaw to create a web-based system for confidential doctor-patient communication and secure medical data storage. While studying at PJAIT, she has also worked as an open source and software engineering intern with G-Research and is in the process of interviewing for her university’s chapter of Google Developer Student Clubs. Every chance she gets, Celina is also working on raising climate change awareness and developing solutions using her technical knowledge. Her dream is to one day establish her own environmentally conscious company, writing code that truly benefits everyone.",
    "url": "https://top.mlh.io/2023/profiles/celina-cywinska"
  },
  {
    "name": "Mrunank Pawar",
    "age": "22",
    "devpost": "/mrunankpawar",
    "github": "@mrunankpawar",
    "linkedin": "/in/mrunankpawar",
    "website": "mrunankpawar.me/",
    "about": "Through his involvement in the hacker community, Mrunank Pawar has transformed from an “extreme introvert” to a confident leader and mentor. Mrunank's first hackathon experience was Winter Hacklympics 2020 organized by Major League Hacking (MLH). Prior to attending the event, Mrunank had very little knowledge of hackathons, but the experience made a huge impact on him. He was able to collaborate with other hackers and learn new skills like time management and teamwork.\n\nHe says, “After the event, I was hooked on the hackathon community and continued to participate in similar events whenever I could. It was a great way to challenge myself, learn new skills, and make meaningful connections.” Mrunank has since contributed to numerous hackathons both as a participant and as a mentor. His passion for technology and innovation has been instrumental in his success, and he has developed a keen interest in sharing his knowledge with others.\n\nMrunank is a part of many clubs and organizations, allowing him to broaden his tech knowledge while he grows his network. He is the founder of Club TechBrewers, a community of 1,300+ across 85 different colleges and 75+ cities. Club TechBrewers hosts skill-building events to help students develop their coding abilities. In addition, he has spearheaded local hackathons including Hack This Fall and Hack The Mountains. He also serves as a Spark AR Campus Ambassador. In that role, he organized his own AR-focused hackathon for 700+ participants.\n\nEarly in his hackathon experience, Mrunank struggled with imposter syndrome. Before joining the hacker community, he identified as an introvert and experienced constant self-doubt. He was unsure if he could keep up in a competitive environment. Still, he persevered and found that the community rallied to support him. He has not only become a more confident person, but also a more skilled programmer. As he says, “Over time, I realized that stepping out of my comfort zone and pushing myself to try new things could lead to some amazing opportunities.”\n\nMrunank's personal growth and passion for technology have helped establish him in the hacker community. He has made vital contributions by sharing his knowledge and expertise to create opportunities for others. Mrunank plans to stay involved in hackathons and events while giving back to the community and inspiring more people to consider coding.",
    "url": "https://top.mlh.io/2023/profiles/mrunank-pawar"
  },
  {
    "name": "Rishab Nayak",
    "age": "23",
    "devpost": "/rishabnayak",
    "github": "@rishabnayak",
    "linkedin": "/in/rishabnayak",
    "website": "rishabnayak.me",
    "about": "Rishab started coding with a desire to help people. At his first tech event in middle school, he and his team created an ASL textualization tool. Programming opened new doors and new opportunities for social good, but he says, “Even though I loved computer science, I always thought of it as my passion and not something I wanted to study.” At 17, when Rishab convinced his parents to let him travel across the world from his home in Bangalore, India to study at Boston University, he chose to enroll as a biology major.\n\nThat changed in Rishab’s freshman year when he attended BostonHacks 2017 and was inspired by the upperclassmen around him, who hacked prototypes faster than he could come up with ideas. Motivated to learn everything he could about computers and become an expert hacker himself, Rishab competed in and submitted winning projects at HackNYU, HackHarvard, and WHACK 2018 over the following year. By the time Rishab was a sophomore, he had declared as a double major in Chemistry and CS and was a member of the team organizing BostonHacks.\n\nRishab is a skilled hackathon participant, but he doesn’t stop there. He takes prototypes developed at hackathons and turns them into something more impactful. While attending PerkinsHacks, a hackathon organized by the Perkins School For The Blind geared towards solving real-world problems, Rishab saw the potential to help people with impaired vision navigate their surroundings. He was motivated to help people like his grandparents, who struggled with sight and mobility.\n\nIn collaboration with friends, he refined his idea at HackHarvard. They won Best Use of Google Cloud for their project Stepify, a piece of wearable hardware that could give audio feedback about a user’s surroundings. Their project was noticed by Google for Education, and their team was put in contact with a group in Brazil to develop their idea as an app.\n\nOver the course of a year, Rishab and his friends collaborated to develop Eyespace, an accessibility tool for the visually impaired created through machine learning with Google Cloud and Google’s Flutter toolkit. Eyespace users can communicate with a chatbot through voice or text input and receive spoken information describing their environment, including any obstacles in their path.\n\nBeyond just building Eyespace, Rishab also worked to make the software it used better. He obtained early access to the Flutter framework and made significant contributions to its source code.\n\nRishab has stayed deeply involved in the hacker community, mentoring at a number of hackathons. While mentoring at TechTogether, a series of hackathons by Major League Hacking aimed at combating gender inequality in tech, Rishab worked with a team creating smart locks for micromobility vehicles like electric bicycles and scooters. As the project progressed, Rishab transitioned from a mentorship role to a co-working role. That original project eventually grew into the company Rishab co-founded: Mount. To date, Mount has employed a team of 12, raised over $4M in seed funding, and been recognized by PhocusWire and the Colorado Cleantech Industries Association. Rishab continues to stay passionate about creating value for others, and hopes to inspire other first-generation students and international students to follow their dreams and find success.",
    "url": "https://top.mlh.io/2023/profiles/rishab-nayak"
  },
  {
    "name": "Mughees Pervaiz",
    "age": "23",
    "devpost": "/Mr-Mb",
    "github": "@MugheesMb",
    "linkedin": "/in/mughees-mb",
    "website": "mugy.codes/",
    "about": "Mughees Pervaiz, who goes by Mugy, broke into the world of tech through hackathons. As an introverted kid who often felt overlooked, he initially found the hacking community in the 7th grade, looking for a way to stand out and connect with his classmates by impressing them with his hacking skills. Not only has he made great friends at hackathons, but he has also made crucial professional connections. Since his first hackathon, Facebook Hackathon 2020, Mugy has gone on to submit winning projects at DeepDiveHacks and the inclusion-focused Hack Concode.\n\nIt may come as a surprise that Mugy did not always see himself as a hacker. Growing up he dreamed of becoming an astronaut, of unraveling the mysteries of the universe and setting his sights for the stars. But with limited resources for aspiring astronauts in Pakistan, Mugy found other ways to stand out and unlock the limitless possibilities he saw in the stars when he was little. He has always been passionate about leveraging technology to solve real-world problems, and in programming he found the perfect outlet.\n\nFor example, Mugy recently worked with a team to create dyslexic, an all-in-one app for students with dyslexia which included a built-in diagnostic quiz, a chat function for confidential communications with psychologists, full parental controls, and educational activities. In 2022, dyslexic was even chosen as one of the top 50 projects in the Google Developer Student Clubs (GDSC) Solution Challenge. Their team’s success was noticed by Google Pakistan, and Mugy was invited by Google to share his journey with new GDSC student leads.\n\nMugy has a track record of providing critical mentorship to others. He has volunteered as a mentor with She Builds and collaborated on a podcast dedicated to helping students succeed in the Google Developer Student Clubs Solution Challenge. In his free time, he helps high school students access technical resources, allowing them to bring their innovative ideas to life and tackle real-world issues like water scarcity and food insecurity.\n\nMugy’s accomplishments led him to be selected as the first lead for the University of South Asia’s chapter of Google Developer Student Clubs. Through GDSC, Mugy has hosted several events, including Google I/O Extended 2022 – Lahore and DevFest Lahore 2021. Mugy thrives on the collaborative environment of events like DevFest, and calls the event one of the most fun experiences of his life so far. He says, “It was an honor for me to organize this event. I met a lot of amazing people and developers.”\n\nHis hackathon experiences inspired him to further his career in tech by participating in the MLH Fellowship. After being denied more than 10 times, Mugy was finally admitted to the Software Engineering track. He called it “a dream come true” to be selected. Mugy says the experience of working with GitLab as part of their Foundation Team was “a really valuable experience and one of the best things that has happened to my career so far.” Mugy will be graduating with a bachelor’s degree in computer science in Spring 2024. Always a thrill seeker, Mugy’s other passions include riding roller coasters and skydiving.",
    "url": "https://top.mlh.io/2023/profiles/mughees-pervaiz"
  },
  {
    "name": "Victoria Ono",
    "age": "22",
    "devpost": "/victoriaono",
    "github": "@victoriaono",
    "linkedin": "/in/victoriaono",
    "website": "victoriaono.com/",
    "about": "When Victoria finished her high school’s Introduction to Computer Science course in high school, she wasn’t inspired to pursue a career in tech. She had heard computer science was the way of the future, but felt lost after being introduced to programming, functions, and binary systems. It wasn’t until the following summer, when Victoria attended a Kode With Klossy camp, that her outlook shifted. Surrounded by peers with similar backgrounds, Victoria felt encouraged and welcomed. Victoria credits her AP Computer Science teacher and her instructors at Kode With Klossy for inspiring her to continue learning.\n\nThat fall, Victoria and friends from Kode With Klossy decided to sign up for their first hackathon, ByteHacks 2018, New York City’s largest all-women hackathon. Victoria recalls having no idea how they would come up with a project idea and bring it to life in less than 24 hours, but feeling excited for the adventure. She pulled an all-nighter coding with her friends, somehow staying awake in the boggy New York humidity. It was all worth it when their project, VitSquad, won Best Health Hack, which Victoria calls one of “the rare moments I felt true pride.” In the high-pressure hackathon environment, Victoria improved her collaboration, innovation, and time management skills.\n\nVictoria became a regular at hackathons after ByteHacks, participating at Codestellation 2020 and multiple TechTogether events, a series of hackathons from Major League Hacking dedicated to bridging the gender gap in tech. In addition to winning another award for Best Global Health Hack at Technica 2020, she worked as the chapter director for TechTogether Boston in 2021. She is also deeply involved in her campus community at Harvard, participating in the Harvard chapter of Women In Computer Science (WiCS). Through WiCS, Victoria has worked on the board of the Harvard Women Engineers Code Conference (WECode) as both a logistics director and a conference co-chair. Victoria is currently studying physics and astrophysics at Harvard, with a secondary concentration in computer science. Always balancing her passions, she also counts herself among the top 0.01% of Taylor Swift’s Spotify fans.\n\nDuring the COVID-19 pandemic, as it became clear virtual work would be the new norm, Victoria adapted. During this time, she says, “I grew so much as a person when everything was virtual, and we all relied on technology to communicate. Because there were still limitations to how people could connect, I learned about the disparities among different people and communities in terms of access to technology.” In the spring of 2021, Victoria returned to Kode With Klossy to work as a Facilitator for a pilot program in Nebraska aimed at reaching underrepresented school districts. She says it was meaningful for her to share her knowledge with students who had the same passions as she did but did not have access to the same resources.\n\nIn her role as a Harvard WECode Co-Chair, Victoria worked to make the event more accessible to all attendees. Not only did she expand the scholarship initiative, but she also helped form a partnership with Rewriting the Code to sponsor several students to attend for free or at reduced prices. The most recent version of the conference, the first in-person event hosted by Harvard WECode since the pandemic, was a smashing success, attracting over 600 attendees from across the globe and another 300 virtually. Victoria says, “it was such an honor to be able to host the largest student-run conference for women in tech in the world, and to know that I helped create a space where students could feel inspired to pursue a technical field.”",
    "url": "https://top.mlh.io/2023/profiles/victoria-ono"
  },
  {
    "name": "Samantha O'Connell",
    "age": "23",
    "devpost": "/sno2321",
    "github": "@IMSNOS",
    "linkedin": "/in/samantha-oconnell",
    "website": "snosportfolio.wixsite.com/view",
    "about": "Samantha O'Connell blends a background in the arts with tech expertise to push the boundaries of coding. With extensive experience in art, animation, computer science, and engineering, she is an accomplished hacker who has made a unique impact on the tech community.\n\nSamantha's passion for technology and coding began when she was a child, in part because of her interest in video games and desire to create her own games. In high school, she participated in an after-school program at the School of Interactive Arts/Urban Arts Partnership, where she learned a variety of programming languages, including C++ and C# within Unity.\n\nShe later enrolled at Borough of Manhattan Community College, where she persevered despite having to change her major from Engineering to Liberal Arts. Thanks to the guidance of a professor, she discovered hackathons and attended the Virtual Make-A-Thon for Social Good in 2020. Since that event, her technology expertise has blossomed, and she’s been invited back to BMCC to speak on a panel for current students.\n\nSamantha was initially hesitant, but her experience at that first hackathon proved to be transformative. She discovered a welcoming community of like-minded individuals who shared her passion for technology and coding. She says, “I really enjoy hackathons because we're all people from different walks of life, casually teaching each other how to better ourselves [and] gain insight we may never have known otherwise.”\n\nSince her first Major League Hacking (MLH) experience, Samantha has attended four hackathons and won two awards, including winning the 2021 BMCC Virtual Make-a-Thon for Social Good and Best Use of MATLAB at HackNYU 2023. Her accomplishments have earned her recognition in the NYU tech community and have helped establish her as a dynamic leader.\n\nSamantha is not just a talented coder, but also a dedicated and continually involved member of her community. She belongs to 50 different clubs, is a club leader, and holds three chair positions on the student council at NYU SPS. She is also a member of the Alumni Council for the Governor's Committee on Scholastic Achievement, where she helps high school students achieve academic success. Samantha's desire to help others extends beyond her extracurricular activities. She personally created a 181-slide presentation to help students engage with NYU, providing them with valuable information about programs, scholarships, and educational resources.\n\nSamantha's achievements are a testament to her hard work and dedication to her craft. She is constantly pushing herself to learn more and take on new challenges. Her passion for technology and coding, along with her desire to help others, has made her an inspiration to many in the tech community. She sums it up, “I am a positive member of the community, always encouraging people to try their best, try something new, or just try in general. I've personally connected one-on-one with many hackers, organizers, and mentors.” As she continues to pursue her MLH and hacking passions, it is clear that Samantha will be an integral part of her community and will inspire others to do the same.",
    "url": "https://top.mlh.io/2023/profiles/samantha-oconnell"
  },
  {
    "name": "Karan Taneja",
    "age": "22",
    "devpost": "",
    "github": "@karantaneja01",
    "linkedin": "/in/karantaneja01",
    "website": "",
    "about": "Karan Taneja is an enthusiastic hacker from New Delhi, India who uses his tech skills to inspire others and share his excitement about technology. He is a three-time president of the Backslash Computing Society at Thapar University, where he has helped over 3,000 students achieve their computer science goals!\n\nKaran discovered his love for technology in college. Ever since his grandfather first showed him the punch cards used in old computers, he had been fascinated by the evolution of technology and how it has changed the world. It was through access to his university’s programs, labs, and resources that he was finally able to explore technology and develop his coding skills.\n\nKaran's journey in technology and coding has been challenging, with moments of self-doubt and obstacles that tested his resolve, but his passion for technology always drove him forward. He has learned that technology is a powerful tool that can connect and empower people, and he is committed to using it to spread positivity.\n\nKaran's first hackathon, API Hacks 2.0, ignited his desire to share the excitement of the hacker community with others. At Indira Gandhi Delhi Technical University For Women (IGDTUW), Karan has served as the club advisor for Celestial Biscuit as well as an advisor to the Technical Resources Community. Combining code and pop culture, he introduced a series of  code-based treasure hunts that he says “brought together over 4,000 people from all walks of life and helped them rediscover their love for coding and engineering.”\n\nKaran has participated in various hackathons and won many awards, including National Winner of Dr. Reddy's Digital Health Hackathon 2023, National 2nd Runner Up of Optum Stratethon Season 4, National Runner Up of Microsoft Imagine Cup India Regionals (Health Category), 5th place at API Hacks 2.0, and Runner Up of Design 'n' Solve at Devcation 2022. He was awarded the Gandhi Young Innovative Idea Award by Anveshan at IGDTUW, which recognizes his commitment to innovation and making a positive impact on society.\n\nKaran's tech journey has challenged him, inspired him, and ultimately transformed him. He is excited about what the future holds and looks forward to using his passion for technology to make a difference in the world.",
    "url": "https://top.mlh.io/2023/profiles/karan-taneja"
  },
  {
    "name": "Nisarg Thakkar",
    "age": "20",
    "devpost": "/Nishu0",
    "github": "@Nishu0",
    "linkedin": "/in/nisarg-thakkar-08811a21a",
    "website": "nishu0.github.io/",
    "about": "Nisarg Thakkar first felt the pull of tech in the form of game design. His journey as a coder has taken him from game development to designing applications for social good. When he isn’t coding, Nisarg makes connections at hackathons, organizes community events, and serves as a community mentor.\n\nWhen he was 14 years old, Nisarg loved video games. This passion got him wondering about how they were developed, and through his curiosity, he eventually discovered Python and Pygame. Building retro versions of Pong and Snake awakened a deeper interest. He says, “As I continued to develop games and learn more about coding, I began to realize just how much I loved working with technology. There was something incredibly satisfying about taking an idea and turning it into a working program. I loved the problem-solving aspect of coding and the sense of accomplishment I felt when I finally got everything to work.”\n\nJust two years later, Nisarg entered his first coding event: the 2018 Google Code-In Contest. He saw firsthand the power of collaboration to advance technology as everyone worked together to achieve spectacular results and create projects that affected positive change. The idea of community became an overarching theme for Nisarg, and he proceeded to join Major League Hacking (MLH), Code Newbie, and Hacktoberfest—all ways to grow and bond over coding and tech. Opportunities these communities presented for him included content writing for Hashnode, contributing to open source efforts, and voice chatting with the MLH network about new technologies like Snyk Cybersecurity.\n\nNisarg first dove into hackathons at Hack in the North 2022. At the event, he discovered new platforms, languages,  and problem-solving approaches as well as his potential to  mentor others. He remembers, “I would clear any doubt in the MLH Discord or provide assistance to those who had hackathon-related queries.” Nisarg’s willingness to give back was not limited to hackathons. He conducted a seminar on web development at his college, DEPSTAR. He also contributed to DecodeCafe, interviewing MLH hackers about their hackathon experiences. All of this involvement has shaped Nisarg into the mentor he is today.\n\nHe is proud to say, “Ultimately, I believe that my contributions have helped to make the hacker community a more welcoming and supportive place for everyone involved.” His many roles within the community have allowed him to broaden his impact and reach many people in a relatively short time. Whether he is creating fresh Discord content on the latest technologies, mentoring new hackathon attendees, or simply answering forum help requests, Nisarg is always finding new ways to contribute to the hacker community.",
    "url": "https://top.mlh.io/2023/profiles/nisarg-thakkar"
  },
  {
    "name": "Janet Zulu",
    "age": "20",
    "devpost": "/janetzulu599",
    "github": "@janetzuluu",
    "linkedin": "/in/janet-zulu-9717801a6",
    "website": "",
    "about": "Janet Zulu fell into coding mostly by chance. She was browsing YouTube when she discovered a video encouraging viewers to try and learn to code. Since that fateful day, she has thrown herself full force into programming, and has become an accomplished developer along the way.\n\nWhen she started at Texas A&M University – San Antonio, she knew computer science was her calling. She joined the hackathon community after attending her first hackathon, Veterans Codeathon 2021. It was there that she fell in love with hackathons and learned the importance of teamwork. As she says, “Coding can be incredibly challenging, so keeping others motivated is essential. Learning more about the hackers around me and encouraging each other definitely helped me.”\n\nHer first hackathon experience was not all smooth sailing. As she says, “When I was invited to join, I felt overwhelmed with imposter syndrome. I reached out to my peers for advice on how to excel and contribute to the upcoming hackathon, but I was still nervous. As the hackathon began, I struggled to believe that I deserved the title of hacker.” Once the event got underway, however, Janet gained confidence in her skills. Although her team did not win the event, they were extremely proud of their achievements.\n\nAfter her first hackathon, Janet participated in more events, some fraught with challenges, like HackUTD 2022, where she had to restart her project halfway through the competition. Others went down as more memorable than others. At TAMUhack 2023, Janet’s team put their heads together and won the General Motors AI challenge. With the support of her peers, Janet has overcome the self-doubt she faced early in her hackathon career.\n\nAs a DREAMer (beneficiary of the Development, Relief, and Education for Alien Minors Act), Janet has faced numerous challenges and obstacles. Through education and a positive attitude, triumphing over the odds has become a habit. She has risen to become President of the Association for Computing Machinery (ACM) and ACM’s Women in Computing at Texas A&M. Her efforts to remove limitations for other DREAMer students have led to fundraising and transportation solutions for many coders. She says, “I am proud to say that we have been able to take 36 students to hackathons completely free of charge, and all hackathons requiring travel for the fall 2023 semester are fully funded.” Her compassionate approach inspires and motivates others in her community.",
    "url": "https://top.mlh.io/2023/profiles/janet-zulu"
  },
  {
    "name": "Banibe Ebegbodi",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "/in/bani-ebegbodi",
    "website": "",
    "about": "Banibe Ebegbodi was afraid of pursuing a career in technology. Though she loved to create, and had always wanted to build battle dolls like in the manga Angelic Layer, she couldn’t see a future for herself in tech. “Even though the story encouraged young girls to achieve the impossible,” she remembers, “I still shied away from the industry based on the fact that I did not see many people who looked like me within it. As a black woman, entering in predominantly male spaces was intimidating and it discouraged me a lot from pursuing my interests.”\n\nOnce she reached college, she realized she wasn’t the only one impacted by a lack of representation in tech. Support from her campus community at the University of Georgia encouraged her to pursue computer science on her own terms. Her first leadership role on campus was Web Design Chair for Franklin Residential College, where she created an initiative showcasing her fellow community members’ successes. Banibe also joined Girls.Code(), the sister organization to the Association for Computing Machinery (ACM), and was appointed as the Public Relations and Graphics Executive Board Member of ACM. She promoted the club's events and meetings by designing physical flyers and Instagram posts while working with the Membership Chair to increase engagement at meetings. The next year, Banibe was promoted to Vice President of ACM. This move was a game-changer. As she says, “my self-assurance continued to skyrocket.” Self-doubt no longer held her back.\n\nBanibe was also appointed as Marketing Director for UGAHacks 8, where she played a crucial role in organizing the first Makeathon event. The event was a collaboration between the School of Computing and the School of Engineering to create a space where 250 makers could create and explore physical technology, such as 3D printing. Banibe 3D printed UGAHacks signs and used a laser cutter to create Makeathon awards. She also helped participants receive school credit for their projects. As a result of all her hard work, she is now in line to be the Lead Director of the upcoming UGAHacks9.\n\nBanibe’s goal is to create a thriving community in which hackers support their peers and push each other to grow and learn. She says, “Whether it is through organizing events, mentoring hackers, or providing resources for learning and growth, I believe that every little bit helps in creating a more inclusive and vibrant hacker community.”\n\nIn addition to her work with UGAHacks, Banibe volunteered and mentored at HexLabs’s 2022 hackathon and TechTogether Atlanta 2023. Banibe's commitment to promoting involvement and knowledge-sharing has made her invaluable to the tech community. Banibe's continued involvement in community events and her work as a Major League Hacking hackathon organizer will undoubtedly inspire others to follow their own paths into technology.",
    "url": "https://top.mlh.io/2023/profiles/banibe-ebegbodi"
  },
  {
    "name": "Bhawna Chauhan",
    "age": "18",
    "devpost": "/Bhawna1203",
    "github": "@ConnectBhawna",
    "linkedin": "/in/connectbhawna",
    "website": "bhawna-resume.vercel.app/",
    "about": "Bhawna has a gift for hacking. She spends her free time scrolling through GitHub rather than Instagram, and has played the part of participant, judge, mentor, organizer, and founder at several renowned hackathons. Since her first hackathon in 2020, Bhawna has participated in many more, creating winning projects at more than 20 events. She’s learned so much, from Android app development to Web3 and Blockchain. She is passionate about growing the hackathon community and guiding other students along their own paths in technology.\n\nBhawna got her first computer in 2017, and at the time wasn’t even sure how to open it. She jumped right in anyway, teaching herself C# while working on a game with her friends. What began as a short learning experience to make a few small edits to the game became a love for programming which Bhawna says first inspired her to pursue a career in computer science. She fell in love with the aspect of problem-solving so many in the hacking community crave, and was eager to share her love of programming with others. After beginning her studies at the Hansraj University of Delhi, she realized the program focused more on theory than providing guidance and mentorship. She made it a priority to find opportunities to learn outside of school.\n\nShe signed up for several coding workshops and technical clubs, and was inspired to take the leap and register for Hack This Fall 2020 with a friend. At the event, they created their first app, DigiManager, which placed in the top 15 among more than 200 projects and won Best Use of GitHub. She was hooked! Through her involvement with the hacking community at events like HackHarvard, Hack The League, and hackCBS 5.0, Bhawna slowly found the passionate coding community she had missed at her university.\n\nBhawna first stumbled upon the Major League Hacking community after reading about someone being selected for the MLH Fellowship on her Twitter feed. Despite having no prior experience with Discord, Bhawna joined the server and found a mentor who helped her navigate the community and get involved. Bhawna says “overall, my experience with the MLH Community has been transformative. It has not only provided me with a platform to develop my coding skills, but it has also enabled me to find a community of individuals who share my passion for programming. Through this community, I have been able to connect with individuals from all over the world, learn from their experiences, and contribute to the broader open-source community.”\n\nEventually, Bhawna herself was accepted to the MLH Fellowship! It wasn’t easy breaking into the tech scene, particularly as a student in a three-year degree program up against students with four-year technology degrees, but her experience in the hacking community outside of her classes gave her the experience she needed to hone her technical and interpersonal skills.\n\nShe has since organized her own hackathon, SheBuilds, which focuses on increasing the inclusion of women in tech. In January 2023, their first event attracted over 2,500 female college students and received more than 200 submissions. Bhawna says the most fulfilling part was hearing from students who had been inspired to declare a major in computer science. Recently, she was invited to speak at an event organized by Ordinateur which was attended by more than 800 people. She hopes to continue inspiring other students to pursue careers in tech, and shares her knowledge with others through her YouTube channel. This year, Bhawna returned to Hack This Fall as a mentor. Her hacking career has truly come full circle.",
    "url": "https://top.mlh.io/2023/profiles/bhawna-chauhan"
  },
  {
    "name": "Brayton Lordianto",
    "age": "19",
    "devpost": "/bl3321",
    "github": "@Brayton-Lordianto",
    "linkedin": "/in/brayton-lordianto",
    "website": "brayton-lordianto.github.io/Brayton-Lordianto/#/",
    "about": "Brayton Lordianto attends New York University and is pursuing a degree in computer science. His focus was limited to coding in class until he participated in his first hackathon, HackNYU 2022. Inexperienced but determined to make the most of the hackathon, Brayton joined every available workshop. His hard work was rewarded when he won the Most Engaged Hacker award without writing a single line of code.\n\nGrowing up, Brayton was inspired by his dad’s love of technology, but that initial interest began to fade over time. After participating in hackathons, his passion for technology roared back to life.  Motivated by his experience at HackNYU, Brayton spent the summer of 2022 participating in every single Major League Hacking (MLH) hackathon he could find. His devotion was rewarded by wins at highly competitive hackathons, including Columbia University’s DivHacks and HackHarvard, as well as becoming a finalist at HackPrinceton. He enjoyed them all, and his passion for using technology to solve problems grew stronger with each hackathon he participated in.\n\nHis hackathon journey has now come full circle. He recently served as the Technical Director for HackNYU 2023. He served as a mentor, an organizer, and a judge all in one. He is proud to say, “I was both in the forefront and behind the scenes in helping make HackNYU 2023 the best experience for the hackers.”\n\nBrayton is involved in New York City’s largest Indonesian student association. He helps host professional events for other Indonesian students to help them advance their careers and acts as a personal resource for Indonesian students interested in technology. Brayton also participates in research, including a project where he is working with a Ph.D. student to add haptics in helmets to keep construction workers safe from vehicles.\n\nBrayton is a talented hacker who is dedicated to using technology to solve real-world problems. His involvement in the hacker community, particularly as a mentor for underrepresented individuals, has changed his life. He is excited to advance his career in technology and help others do the same.\n\n“Perhaps the most significant impact of the hacker community on me,” he says, “is the sense of empowerment and agency it has given me. I used to believe that technology was reserved for the most talented individuals and that I could barely contribute, but I learned through hackathons that anyone can create something amazing with just a little bit of passion, creativity, and determination.”",
    "url": "https://top.mlh.io/2023/profiles/brayton-lordianto"
  },
  {
    "name": "Harita Suresh",
    "age": "15",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Since they were little, Harita and her little sister Sharada have had a knack for programming. When they first started learning on Code.org in elementary school, they were amazed by how their code could control video game characters. Soon after, Harita and Sharada registered for online programming courses by IBM and Georgia Tech, moving from Scratch to Python. When they reached junior high and found that their school didn’t have any computer science classes or clubs, they realized most of their peers didn’t have access to the same resources they had. Seeing major gaps in accessibility to technology, they dedicated themselves to doing something about it.\n\nIn 2020, Harita and Sharada founded Little Apple Academy, a nonprofit focused on teaching coding to students between the ages of 8 and 11. While they utilize Code.org lessons to get everyone on the same page, they were also inspired by their hackathon experience to create their own project-based curriculum for students.\n\nDuring the height of the COVID-19 pandemic, Harita and Sharada found it was difficult to collaborate with their friends, and decided to register for MakeSPP 2020. The collaborative hackathon environment inspired them to attend their next hackathon, SheBuilds, a few months later. Their project, COVID Aware, was a vaccine-access app which helped people in Hudson County, New Jersey find vaccine providers during times of severe supply shortages. Not only was COVID Aware awarded 1st place by the judges, but it also inspired them to develop projects addressing other issues close to home. To date, Harita and Sharada have created 13 apps to address real-world issues like climate change, gender equality, and domestic violence. On their hackathon experiences, Sharada says, “we feel empowered when working on real-world issues and solving problems with technology. Hackathons have inspired us to put the power of coding into the hands of so many more people.”\n\nHarita and Sharada have since submitted winning projects at 10 other hackathons, including RoboHacks 2, Hack-Cade 2, Lily Hacks, and Give Back Hacks. The projects they’ve created at hackathons have helped them build the foundation for the Little Apple Academy’s curriculum. Their project-based program includes everything from block coding to Python to web development. Harita and Sharada have even organized their own hackathon, Little Apple Hacks, to help reduce the gender gap in technology. Several of their students have already gone on to win hackathons themselves!\n\nSharada says she and her sister believe that “with equitable access to computer science, we can create a more equitable future for all.” They have already taught several rounds of classes with Little Apple Academy, reaching students of all backgrounds from 10+ countries. In collaboration with IEEE Kochi, IEEE Patna, and the Indian Institute of Technology, Harita and Sharada have shared resources with students in rural and underserved regions of India. Their Little Apple Academy students have written over 120,000 lines of code and created more than 450 Scratch projects. They have been recognized for their work with Little Apple Academy by PBS 13, NJ.com, and Code.org, and were also featured in The74’s 16 Under 16. They plan to continue their careers in computer science and to continue bridging gaps in equity wherever they can.",
    "url": "https://top.mlh.io/2023/profiles/harita-suresh"
  },
  {
    "name": "Vibhor Garg",
    "age": "23",
    "devpost": "",
    "github": "@vibhorgrg3",
    "linkedin": "/in/vibhor-garg-a0a0b5193",
    "website": "",
    "about": "Vibhor did not discover coding until the 11th grade, but after learning Python in class, he was hooked. While working on his 12th grade capstone project, Vibhor recalls feeling like an experienced developer for high-end software, brainstorming project ideas on a large whiteboard with his team. From that point on, Vibhor knew he wanted to work as a developer, and enrolled in a four-year B.Tech program for Computer Science at the Jaypee Institute of Information Technology to take his passion for coding to the next level.\n\nWhen he first arrived at college, Vibhor knew nothing about the hacker community—he thought it was like something in a movie—but he was inspired to learn more. He joined the only tech community available, the local chapter of Google Developer Student Clubs. Vibhor knew the club’s rules did not allow first-year students to join, but he took the initiative to approach one of the seniors in the program and ask her directly. After he explained his passion for coding, she noticed his enthusiasm and decided to allow Vibhor to interview along with the upperclassmen. Vibhor stayed awake until 1 a.m. waiting on the results to come in via Facebook, and was overjoyed when his name appeared among the accepted candidates. Within a year, Vibhor was working with the club in a tech coordinator role, helping with events and organizing the club’s annual hackathon. The following year, Vibhor had moved up to Head of Management and PR for the club, organized a national hackathon in India, and hosted a 6-day festival for app development in Flutter.\n\nVibhor himself attended his first hackathon just over 2 years ago, competing in Healthathon 2020. While he was new to hackathons, Vibhor was not new to hacking. In his free time, Vibhor had used his coding skills to create simple hacks aimed at convenience. For example, during his freshman year, he created a Python script which reduced the need to manually input user IDs and passwords for accessing campus internet. One project Vibhor is especially proud of was an automatic detection tool for facial paralysis, which helped to detect facial nerve palsy in a non-invasive way using image analysis.\n\nVibhor was the first in his family to pursue a career in tech. He credits the challenge of not having a set path to follow for his independence. Without specific guidance, Vibhor sought mentorship on his own and found it within the hacker community. Though he didn’t get his start in tech until the 11th grade, Vibhor has quickly become a trusted tech advisor for his friends and family. Growing up, Vibhor remembers the struggle of convincing his family, and especially his father, to trust new technology. Now, Vibhor has made tech enthusiasts out of his entire family: his little brother following in his academic footsteps, his mother shopping online, and his father paying bills online rather than making a monthly trip the old-fashioned way.\n\nVibhor never turns down an opportunity to learn, even when it falls outside his area of expertise. He sees his career as the product of dedication, perseverance, and those all-hours “hustling nights” when he learned so much. Vibhor has also enrolled in an online program to complete a BS in Data Science and Programming at the Indian Institute of Technology Madras, which he will complete at the same time he graduates from his B.Tech program at the Jaypee Institute of Technology. He already has two job offers lined up after graduation! Vibhor’s dedication to improving, learning, and mentoring will no doubt get him far in his future tech career.",
    "url": "https://top.mlh.io/2023/profiles/vibhor-garg"
  },
  {
    "name": "Jeffrey Zang",
    "age": "16",
    "devpost": "/jeffrey-zang",
    "github": "@jeffrey-zang",
    "linkedin": "/in/jeffreyzang2007",
    "website": "jeffrey-zang.github.io/",
    "about": "He’s still in high school, but Jeffrey Zang already has more than five years of programming experience under his belt. Jeffrey has been programming since the 5th grade, when he first learned about Scratch during a math class. Jeffrey says he was “immediately captivated by the magic of programming” and enthralled by his newfound ability to recreate everything from Pong to Paper Minecraft. By the time he was in 6th grade, Jeffrey’s father had introduced him to Python, and he had already completed basic programs like a pizza maker and a choose your own adventure game.\n\nBut by his freshman year of high school, Jeffrey had almost lost that spark for programming which burned so bright just a few years earlier. That spark was reignited when Jeffrey’s friend invited him to attend JAMHacks 6, one of Canada’s largest hackathons for high schoolers. Initially, Jeffrey balked at the request, unsure if he was ready for an intense commitment that would mean spending his first solo night away from home. Not to mention that Jeffrey had been considering changing his career path and pursuing opportunities in business rather than programming. However, just two days before the event, Jeffrey had a change of heart and decided to get a team together with his friend and come up with a project.\n\nTo this day, Jeffrey says JAMHacks was one of the most fun experiences he has ever had,  fondly remembering his time learning in workshops, the power outage in the middle of the hackathon, and especially the free food. Jeffrey credits JAMHacks with reigniting his passion for programming. As a result of his hackathon experience, Jeffrey went on to learn React and got his first internship doing full-stack development for uxSino. While he had always appreciated the problem-solving aspect of programming, he says he really loves programming “because of how it brings people together.”\n\nSince his first hackathon, Jeffrey has gone on to compete in Hack the North and submit winning projects at Harvest Hacks and Give Back Hacks. While Jeffrey has been highly successful in his career for someone so young, not all opportunities have been easy to reach. After being rejected from numerous internships due to his age despite being otherwise qualified, Jeffrey and his friend decided to bridge this gap by organizing ClockHacks, their own hackathon geared towards other high schoolers.\n\nOrganizing ClockHacks came with its own set of challenges, as Jeffrey and his teammates were often written off by corporate sponsors due to their age. But Jeffrey persevered, and the event was a complete success. ClockHacks 2022 attracted more than 200 participants, and Jeffrey worked hard to ensure the fourteen workshops and activities scheduled provided as much knowledge as possible to participating hackers. Jeffrey wanted to make sure that hackers left the event with a reinvigorated or newfound passion for programming and technology.\n\nJeffrey continues to inspire others to pursue careers in tech. He spends his time outside of school tutoring his hackathon teammates and other students. This summer, Jeffrey will be organizing RythmHacks, with the mission of “educating aspiring youth about tech startups and entrepreneurship,” as well as Hack the 6ix, one of the largest recurring hackathons in Canada.",
    "url": "https://top.mlh.io/2023/profiles/jeffrey-zang"
  }
]