[
  {
    "name": "Shruti Das",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "During Shruti’s first semester of college, she attended her first hackathon, Technica 2017. She recalls it being the first time she found herself at ease in a room full of tech majors. Before Technica, she had suffered from imposter syndrome as many of us do. Joining the community completely reshaped the way in which she views the future of technology, but it also helped her to see her own role within it.\n\nLeaving the event, Shruti felt a surge of inspiration to get more involved in the community and the following semester, she became a part of the Bitcamp organizing team. She wanted to foster a similar environment that she had experienced herself: one that welcomes and supports all beginners and first-time hackers.\n\nAs an organizer for Technica, Shruti works to empower diversity of thought. She strives to foster an inclusive atmosphere in which everyone feels they can voice their opinions and reach their full potential. Her first year organizing, she helped introduce the concept of pronoun pins to the event in order to help hackers express themselves and feel respected by the community. In the three years that she has been a part of the organizing team, she has seen the diverse channels of marketing create an unprecedented shift within their hacker population ranging in major and age. Not only are students attending but family units, teachers, and more come to be a part of the community. As an organizer, she is reshaping the way students view hackathon culture and the ways in which we experience technology, which means giving everyone an equal opportunity to pursue it.\n\nThrough hackathons, Shruti has met incredible friends, mentors and role models who all help to teach her the importance of community, and constantly motivate her with their creativity and work ethic. At this stage in her life and career, Shruti believes that the people she works with matters far more than the work itself. While she aspires to work on something meaningful, she looks forward to cultivating a healthy team dynamic so that everyone can come together to build technology that has a real impact on the world.\n\nHer favorite hackathon project is one she made with a friend from high school at TechTogether Boston 2019. They were both involved with UNICEF in high school and found an immense amount of public information in the UN’s data archives. Combining their passions for female empowerment and sustainable development, they centered their hack around the UN Global Goals. They built a touch-sensitive map (after experimenting with Bare Conductive paint) to display visual progress updates toward the UN Global Goal for gender equality. They saw the physical map as a fun and interactive way to engage citizens in helping them to understand the UN’s Global Goals. By pressing a finger on a continent, the user could visually see aggregated data for all the countries in any continent within the context of gender equality.",
    "url": "https://top.mlh.io/2020/profiles/shruti-das"
  },
  {
    "name": "Christopher Lambert",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Christopher decided to apply to BigRedHacks 2017 on a whim one afternoon and was surprised to find out he had gotten in. He distinctly remembers sitting alone in the auditorium far from home and feeling terrified that he wouldn’t be able to find a team. He couldn’t imagine someone wanting a freshman who hadn’t taken a single CS class yet.\n\nAfter attending the opening ceremony, he went to the team building session and was blown away by the excitement and kindness of the people in the room. Chris quickly found a team of three students and spent the weekend programming, cup stacking, meeting people, and learning new things. He has since attended 25 hackathons.\n\nHackathons were very eye-opening for Chris. Having started college at a school relatively close to where he grew up, he thought he would follow in his brother’s footsteps and major in finance.  During his year at the school, he helped to organize CUhackit and realized that his true passion was computer science.\n\nAfter his freshman year of college at Clemson University, Chris decided he wanted to transfer schools. He wrote about his hackathon experience in his application essay to transfer to Columbia and he is confident that he would not have been accepted without it.\n\nHe has gotten many professional opportunities due to the technical skills he developed at hackathons. Chris has interned at companies such as Tesla, Capital One, and Stripe. This summer, he will be interning at Lyft before starting his sophomore year at Columbia University. There, he will major in computer science and study algorithms, computational complexity, and various areas of theoretical computer science. Chris is interested in working at the intersection between CS and finance.\n\nChris’s favorite project was at HackTech 2019. The project was called Ride Caring, and it was a service you could use to call an Uber without mobile internet. The intention was to reduce drunk driving incidents in rural areas, where there is oftentimes cellular phone service with no mobile data.",
    "url": "https://top.mlh.io/2020/profiles/christopher-lambert"
  },
  {
    "name": "Luis Ocampo",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Luis entered college struggling to accept the transition from the youthfulness of high school to the reality of adulthood and college. Having just turned 18, being bombarded with career fair preparation, conducting organization recruiting, completing complex homework assignments, and learning thousands of new faces was overwhelming, to say the least. He had gotten involved in a few clubs, none of which were really interesting to him, and he quickly fell into a clockwork rhythm: go to class, do homework, eat some food, maybe a meeting or two about an org he didn’t care about, sleep, and repeat. He figured that his next four years would be a cycle of getting involved in clubs and achieving good grades for the sake of it.\n\nThen something incredible happened. Luis spent a lot of time with a group of people that had all randomly met waiting for laundry in their dorm’s basement. They were an eclectic assortment of kids that bonded over their STEM backgrounds and complaints about classwork.\n\nOne particular night, they had gotten into one of those late-night existential conversations about career aspirations and the purpose of life. Some of his friends were having trouble understanding how an introduction to computer science course led them to build an app or a video game. He was suddenly reminded of the hackathon he had attended in high school — Luis had gone purely for extra credit, but he remembered how much he enjoyed the experiential learning.\n\nLuis hopped on his laptop, searched up collegiate hackathons, and came across TigerHacks, which was happening just a few hours away over from his school at the University of Missouri. The next week, he gathered up a few friends and spent the weekend building and learning, and even though the project they built that weekend wasn’t the best, he was hooked.\n\nHe learned about Major League Hacking through the representative at the event, and the next thing Luis knew, he was going to an event every month or so. Soon enough, he began to recognize familiar faces and sponsors, and that was the first time he truly felt like he was part of the hacker community.\n\nHis favorite hackathon project was from that weekend at MHacks 11. On the first day, they were struggling hard to come up with an idea. They decided to take a brain break and headed to a nearby grocery for some snacks. One of his friends is a huge health nut, so she bolted straight to the produce section, and his Cheeto-eating self followed. They noticed an interesting shelf where nearly expired and damaged produce was on sale for cheaper, and then the lightbulb moment happened.\n\nThey did some research back at the venue and learned that 15 percent of perishable products go to waste in grocery retailing due to damage and spoilage. If they were able to develop an easy way to implement expiration date-based pricing, they would save an incredible amount of food and money. None of his friends had much computer science experience, so instead of building the project for them, he began to rapidly teach them stuff like how to build a Windows Form. The end project was pretty simple — a form ties an item to an expiration date and prints a QR code, which shows the current price for the item and is adjusted for how close it is to expiration.\n\nHis favorite part about that project was seeing his friends burst into joy when code compiled or when they got something to work. Printing “hello world” on an HTML site is barebones to some, but for others, it’s such a cool feeling to see code turn into something real. Being able to witness that is what motivated Luis to continue organizing his hackathon, PickHacks.\n\nHaving attended college on a whim, Luis was astounded that he had found something he was truly passionate about. Suddenly, he began to uncover other interests that manifested themselves in that passion. It was like flicking a light switch — Luis became interested in music, photography, travel, and more. It’s amazing how the simple decision to attend a collegiate hackathon enhanced his quality of life so much. He’s incredibly thankful to have parents that supported him in his wild endeavors. He recognizes that this is not a common story, however, and many people are unable to access opportunities for reasons outside of their control.\n\nBecause hackathons have had such a profound impact on his life, Luis set out to help others on a larger scale. When founding PickHacks, Luis and his co-founder Chris had the goal of bringing the hacker community to Missouri University of Science and Technology and Missouri as a whole. In their first iteration, nearly half of attendees were first-time hackers, and over 80% had been to fewer than three hackathons. Being able to provide this opportunity to students that never would have experienced it otherwise is his favorite impact on hackers in their community; as a result of PickHacks, Luis and Chris have had a much larger hackathon representation at other events.\n\nFor a community that is growing at an exponential rate, Luis believes it is important to always think about how to incorporate people from all backgrounds. He found that small schools often shy away from hosting hackathons and that larger schools often overlook trade schools and community colleges in their marketing. Luis said, “The tech community should be one of encouragement, not intimidation, and as hackers and organizers, we have the power to embody that.”",
    "url": "https://top.mlh.io/2020/profiles/luis-ocampo"
  },
  {
    "name": "Akash Singh",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Shortly before attending Mangohacks, Akash remembers changing his major from biology to computer science. Having felt a bit overwhelmed by the suggested change, he leaned a club on campus called the Society of Competitive Programmers  (SCP) at the University of South Florida. This club was where he had heard of hackathons and was inspired to attend one.\n\nHaving started as a cell and molecular biology major who changed their major to computer science purely on instinct and curiosity, Akash credits hackathons with his growth in the CS field. With no prior experience in it, he felt he was not ready for hackathons and might have quit his major early. Hackathons gave him an environment to feel like it was okay not to be the best, not to be ready, not to know something, but it’s never okay not to do something about it.\n\nHackathons gave Akash an environment not only to learn and have fun but also to make connections with potential recruiters and companies. These connections, sooner or later, pay off when the time comes to find a job or apply for grad schools. Akash says, “Attending hackathons is an experience which, in my opinion, sets you up for the world waiting for you once you graduate.”\n\nHaving come a long way since switching his major, Akash now finds himself as the president of SCP. He uses this position to provide comfort and support to those who, like him, felt overwhelmed and are new to the tech field.\n\nHe is currently a research assistant working in USF Graphics and Visualization Lab. Akash wants to pursue a PhD in CS after he graduates with a concentration in Data Science and Data Visualization. Hackathons have given him the opportunity to visit various universities and hopefully, he will be pursuing his PhD at one of those schools.\n\nAkash’s favorite hackathon project was the one he worked on during Hack-a-Bull 2019 at USF. The project name was the Bullinator. It was an anti-bullying device primarily focused on detecting cases of bullying through speech recognition and identifying the bully and victim. It was not a perfect design or concept but had a working model and results which the team was proud of. They used Google Speech and voice recognition along with hardware like Qualcomm Snapdragon board kit and a mic. Akash liked the idea, the cause, and the concept they chose to work on. It gave him the inspiration to continue working on technology and come up with devices and solutions to tackle some of the social issues in his community.",
    "url": "https://top.mlh.io/2020/profiles/akash-singh"
  },
  {
    "name": "Jamshidbek Mirzakhalov",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Jamshidbek discovered the hackathon community after friends from the Society of Competitive Programmers decided to apply. He teamed up with a friend to build his first-ever application and after demoing, was overwhelmed by the amount of support and encouragement they received from their fellow hackers and judges.\n\nHis biggest takeaway from hackathons is the idea of computing for social good. Coding for good changed him as a programmer because it made him realize the true problems he should be working on. Event after event, his ideas got more impactful and meaningful. Jamshidbek believes this will manifest in what he chooses to do with his professional career in the future.\n\nIn 2018, Jamshidbek co-founded a student organization at his school called the Society of Competitive Programmers (SCP) where their goal is to increase awareness about hackathons, mentor students in their journey to learn new skills and provide financial support for students to travel to hackathons. So far, they have helped more than 150 students experience their first hackathons at more than 25 hackathons nationwide. SCP has helped to improve USF attendance and merit rankings in MLH rankings over the years as they jumped from 114th to 44th in overall rankings and from 1568th to 41st in attendance. SCP has been a huge part of Jamshidbek’s college experience as he had the opportunity to serve as its treasurer first and later, as the President. He believes that his story as a hacker would be incomplete without SCP.\n\nCurrently, Jamshidbek is a senior at the University of South Florida where he is majoring in computer science. There, he works as a research assistant in the social computing labs and in the neural machine interaction lab. He plans on pursuing a Ph.D. in computer science with a focus on natural language processing (NLP) and machine learning.\n\nHis favorite hackathon project was Classroom.ai at KnightHacks 2019. It was special because it addressed a problem that students alike can relate to. Classroom.ai provided a real-time and anonymous feedback system for students without taking their attention away from the lectures. His team and he tried to make sure that it was a usable and complete product that can be easily adopted, which came true as we launched it in a few classes at USF later on. This is his favorite because it impacted the lives of students as they wanted it to.",
    "url": "https://top.mlh.io/2020/profiles/jamshidbek-mirzakhalov"
  },
  {
    "name": "Lauren Tonello",
    "age": "24",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Lauren received a random message from the head organizer of nwHacks a couple of weeks before their event saying he had heard she did marketing and that they desperately needed some help. At the time, Lauren had no experience in tech and had no idea what a hackathon was but she agreed to help.\n\nShe walked into the event completely blindsided, had the experience of a lifetime and instantly fell in love with the hacker community. Four years later and she is still doing marketing for nwPlus and is loving every second of it.\n\nHackathons have allowed Lauren to share the stories of people who are truly passionate about the work they do. They have provided her with work that has meaning, genuinely interests her, and that she is proud to share with others. Her role in hackathons over the years has been approaching hundreds of hackers and sponsors at events and asking them “what are you working on” or “what do you do.” Each person has a different answer, usually about a field, global issue or new hardware she knows nothing about, and they’re always willing to tell her all about it. She has come out of these events with some of the most interesting and informative conversations she’s ever had and has learned about different topics she would have never come across. Hackathons have changed her life as they’ve opened her up to countless new topics.\n\nLauren works to make the nwPlus hacker community more diverse and inclusive by breaking the stereotype of what typical hacker community members are. As someone who entered the community not knowing what a hackathon was, a first-year, and an art student, she has become a big advocate for encouraging anyone who is interested to give it a try, no matter the experience level or academic background.\n\nShe has had the opportunity to make this the focal point of nwPlus’ marketing strategy for the past two years and as a result, they have seen their events reach almost equal diversity ratios among their hackers and organizers (gender, fields of study, academic years, etc.). She is particularly proud of their team for increasing their beginner hacker rate to 40% this year and for consistently breaking down stigmas of who can attend hackathons. Her team always says “if Lauren can do it given her experience level, anyone can do it.”\n\nSince she is not a hacker, her favorite project as the marketing director has been incorporating Medium articles into their marketing strategy. This allowed their organizers to share more in-depth content about different aspects of their events with the hacker community. Her role in this implementation was working with hackers and sponsors to share their stories and projects that they’ve been working on, through hacker experience stories, sponsor interviews, and project spotlights. This was her favorite project as it allowed her to meet new members in their community, further learn about the work happening in it, and connect other members with each other.\n\nLauren is currently finishing her degree at the University of British Columbia where she majors in mathematics and minors in commerce and a software development stream. She aspires to work in digital marketing and social media analytics, focusing on brand authenticity.",
    "url": "https://top.mlh.io/2020/profiles/lauren-tonello"
  },
  {
    "name": "Sarina Abrishamcar",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Sarina wanted to learn how to code to model neural networks of the brain to parallel data analysis of the next general election. A non-CS major, Sarina realized there were few resources to learn about the world of computer science, a field that has become a large aspect of our daily lives. She felt that the resources available to her were male-dominated and riddled with underlying sexism. As Sarina’s intended field of Pharmacology was increasingly dependent on coding, she wanted a safe environment for her to learn. Sarina set out to help create a safe space for women and gender non-conforming people to learn to code.\n\nWith little code experience, Sarina never thought she would be accepted to a hackathon and felt deterred by the male-dominated environment. This was the main motivator behind the creation of Womxn/Hacks for Sarina and co-founder, Lia Yeh. This hackathon was different from a traditional hackathon with its focus on inclusion of all genders and those without tech backgrounds.  Many participants emailed her months later to talk about the internships they got from sponsors and how the event opened their eyes to different career paths. Organizing the event taught Sarina that change is possible; the Womxn/Hacks team has made CS resources more accessible and gender-neutral.\n\nThrough her very own hackathon, Sarina landed an internship with one of their sponsors,  Evidation Health, a health-tech company. Sarina was brought on as a project management intern where she worked with the data science team to understand how wearable tech ( Apple watch) can help patient outcomes. Sarina plans to apply to medical schools and is excited to mix health and tech in both future hackathons and her career.",
    "url": "https://top.mlh.io/2020/profiles/sarina-abrishamcar"
  },
  {
    "name": "Kat O'Leary",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Kat first found themselves drawn to STEM and programming in high school. Coming from a  rural area that lacked a tech scene, Kat and their classmates went out on their own to create a robotics club at their school. When their club made it to the national championships during their sophomore year, they started to notice an aptitude for programming and the potential it had for their future, especially within a teaching capacity.\n\nIt wasn’t until college that Kat attended their first hackathon. Dragged to the event kicking and screaming, they imagined the hackathon world to be a dark room with a bunch of men in hoodies, typing into a terminal or hacking into something. The realization of being able to take education into their own hands got them hooked on hackathons. Since then, Kat has attended 35+ hackathons. Kat jokes, “I sold my soul to Major League Hacking for a sticker in 2016 and it was the best decision I ever made.”\n\nKat attributes hackathons for keeping them out of a depression when they were at their lowest points, making sure they had food when they were struggling financially, and introducing them to friends who became family. They don’t know if they would have stayed in college if not for hackathons and it confirmed that they were smart enough to be in tech.\n\nViewing hackathons as an educational playground, these events helped them identify their strengths and learn new skills. As well, it provided them with a platform to support queer hackers and non-tech majors. Through hackathons, Kat has learned how they work and think about things. In addition to learning many new skills, they realized they were a generalist with a knack for design, software development, and entrepreneurship.\n\nSince being introduced to hackathons, Kat has worn many hats within the community. After attending their first hackathon at HackPSU Fall 2016, they started helping to organize the hackathons on their campus while simultaneously attending as many hackathons as humanly possible.\n\nIt was during the sophomore year that Kat made their favorite project at the Pitt Challenge: a blockchain platform that allowed universities to securely verify students vaccination records. It was their first time working with blockchain and front end programming, which ended up being some of their favorite tech topics.\n\nIt is also where they met Ryan Swift, the Coaches Program Manager, and decided they wanted to work for MLH. Kat says, “Ryan was the first person in tech that actually believed in me and didn't assume I wasn't contributing as much as my male teammates. That whole project was a huge breakthrough for me.” Wanting to have that same impact on hackers, Kat applied for the Coaches Program. The MLH Coaches provided Kat with an immense amount of kindness and support. Kat says, “The Coaches are basically a family. We all encourage and support each other even though we can only talk online.”\n\nKat is currently a senior at Penn State University majoring in Design and Development.\n\nThey continue to pave a road for queer hackers everywhere, working to make the community more non-coder and LGBTQIA+ inclusive through their work as an artist, mentor, coach, and in their new role as Localhost Product Manager which they will take on full-time after graduating in May.",
    "url": "https://top.mlh.io/2020/profiles/kat-o-leary"
  },
  {
    "name": "Liam Sorta",
    "age": "24",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Liam jokes that he joined the hacker community by accident. Having attended a Local Hack Day in 2015, he ate a slice of pizza with someone from a different university and ended up going to their 24-hour hackathon the following week. During that first event, Liam met someone from yet another university that shared his same interest in running an event. Eight months later they had organised their very own hackathon (without university backing) in order to bring their local tech community closer together. This will always be something Liam looks back on as magical.\n\nLiam’s hackathon, HackTheMidlands, is an independent hackathon run in the West Midlands, hosting 300+ attendees. Intending to inspire the same feeling of learning and excitement that he and his co-founder, Thomas Goodman, once felt, HackTheMidlands focuses on being a beginner-friendly event. They know how important the first hackathon is so they want to make the experience one worth remembering.\n\nHaving only previously been involved with game-development communities, the wider hacker community gave Liam a much broader sense of engineering and the tools he could use to create. Perspective aside, the people Liam has met throughout his years of attending and organising hackathons has opened up doors he never thought existed, and has made some of his closest friends.\n\nIt's a journey that has led him across multiple continents, working on a plethora of varied projects, and is one of the reasons his own startup has been successful and exists at all. His love for development communities led him to start GameDevNetwork, a community for game developers with over 9000 users, focusing on supporting new and experienced developers alike, in a relaxed, inclusive community. They regularly run online hackathons, jams, and charity events.\n\nHackathons have also been a place where Liam has learned about various technologies, specifically his discovery of Alexa. He began experimenting and pushing the limits of what voice technology can offer, especially when combined with realtime rendering engines. His work led him to be recognised as an Alexa Champion, and after reaching over 1,000,000 users across all of his apps, being interviewed by Amazon about his startup, MagicVoice.io, and Voice.tv.\n\nAfter graduating from Birmingham City University in 2018, Liam went on to spend a year at Unity Technologies, giving talks on cross-platform Augmented Reality around the world.\n\nLiam’s favorite hackathon project is from a medical hackathon he had traveled to that aimed to pair up developers with med students. His team created DocChart, an Augmented Reality app for doctors and nurses to use that would overlay patient information by recognising a QR code, instantly highlighting important information without diving through files. This was the most diverse team Liam had ever worked on, with each of its five members coming from completely different countries.",
    "url": "https://top.mlh.io/2020/profiles/liam-sorta"
  },
  {
    "name": "Alexander Prosolkin",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Alexander first found himself at a hackathon after his friend (and later on, co-founder) Maksim Diakov brought him to a Local Hack Day event in 2017. Maksim and Alexander had met at the university and quickly became friends. Having attended many hackathons, Maksim encouraged Alexander to browse the internet for them to visit and Maksim told him about Local Hack Day and brought him along.\n\nAfter the event, the two spent time researching Local Hack Day and decided to organize their own because there weren’t any in Russia. After that, they became addicted to the desire to change their local hack events to European and US quality level hackathons.\n\nExtremely interested in developing products, Alexander jumped on board with the project and worked with Maksim and later, Aleksandr Malyshev, to create the community that has turned into Russian Hackers. Alexander cares deeply about creating something of value for society whether that be a community, software, or events.\n\nHackathons have made a big difference for Alexander. They have strongly improved his soft skills and interaction with others. According to Alexander, hackathons are like expedited tech careers. You create your product and go through the stages with your business in a weekend. Through this, you learn much faster and can create more effective products.\n\nAlexander loves giving back to the Russian Hackers community and helping to empower hackers across Russia and the world. While he doesn’t code much anymore, he works towards developing the world of fintech and hackathons.\n\nHis favorite hackathon project is from Junction 2018 where he and some friends were trying to solve a marketing challenge. They created a robotic arm that would be used at the usual supermarket wall where you can weigh sweets and buy them. The arm would pick sweets up out of their respective lots and deliver them to a pickup point. Sometimes, they used someone’s mouth as the pickup point.",
    "url": "https://top.mlh.io/2020/profiles/alexander-prosolkin"
  },
  {
    "name": "Amy Le",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "“I honestly don't think I would be where I am today if I hadn't decided to go to that hackathon three years ago.”\n\nAmy joined the hacker community when a friend invited her to an out-of-state hackathon. At the time, Amy didn’t fully understand what they were nor did she have any programming experience. She decided to hop on the flight anyway and never looked back.\n\nIn January of 2017, she and her friend co-founded Hacklahoma, University of Oklahoma’s official student hackathon. She spent the year as the creative director where she worked with graphic designers on logo, branding, theme, and documentation as well as managed social media and marketing strategy. She managed to accumulate over 800 followers across the organization’s social media platform. Amy now serves as the executive director of the organization.\n\nAmy is currently a senior studying computer science and minoring in Japanese at the University of Oklahoma. She is interested in front-end web development and UX design. Her experience has led her to work in software development, interning at various companies such as Tinker Air Force Base, The Ronnie K. Irani Center for the Creation of Economic Wealth, and Hobby Lobby.\n\nAmy’s favorite project was a web app that helped build a community between volunteers and organizations & relief centers to provide services and resources to natural disaster victims. It was the most fun project she has worked on because she got to focus more on the design aspect of it which she had never done before a hackathon.",
    "url": "https://top.mlh.io/2020/profiles/amy-le"
  },
  {
    "name": "Beowulf Horn",
    "age": "23",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Beowulf attended CUCCHack during his first year of university. During the event, CUCCHack organizers announced another hackathon the following weekend. Already hooked, Beowulf signed up and started attending hackathons as often as possible, amounting to over ten midway through his second term. Not only did CUCCHack make Beowulf excited about hackathons but it was where he met the people he would later start CovHack with.\n\nComing from Bourne, England, a very rural area lacking a tech community, Beowulf felt as if the university was the community he was waiting for with plenty of events across the country and the world where he could build wacky projects with new friends.\n\nBy organizing CovHack in 2019, Beowulf and his friends were able to make a real impact on their local community by bringing a hackathon back to their campus. Without CUCCHack, his school’s computer club hackathon, he probably would not have gotten involved as much as he did.\n\nBeyond the local community, Beowulf has been working with the Hackathon Hackers EU organizers on trying to get more cooperation between the communities, which hopefully will result in more hackathons, better mentorship, and overall more enjoyable events! All the teams have a lot of resources that could easily be shared between the events that would make them cheaper to run.\n\nIn addition to CovHack, Beowulf created a wiki for hackathons all over the UK, making sure all first-time and returning hackers are aware of the opportunities nearby and how to prepare themselves for events. He was inspired to make this after a conversation at the Hackathon Hackers EU conference digital watch party to help organize the sharing of resources and to share the platforms that organizers talk on. As a result, he has seen an increase in volunteers at hackathons and communication.\n\nHis favorite project was Applause Review which he made at R. U. Hacking? 2019. He made a version of DinoRun built into Chrome which was controlled by applause. It averaged out when to jump based on the sound it picked up by the devices connected to the site. Beowulf said this was his favorite demo because he had everyone clap for the project.",
    "url": "https://top.mlh.io/2020/profiles/beowulf-horn"
  },
  {
    "name": "Athul Blesson",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Athul used to consider himself a very introverted person. Spending most of his time in front of his computer in his room, Athul thrived in the world of video games and YouTube.\n\nHis interest in coding was first sparked after seeing Iron Man 3. Impressed by Tony Stark’s AI assistant, he wanted one of his own. When the internet did not have an AI assistant that met his standards, he decided to build his own. Like Iron Man, through his creation of technology Athul built his own identity.\n\nAthul did what many other aspiring CS students did and found classes online. Once he started coding, he was amazed by all the things he could build using code.\n\nTo create even bigger projects, Athul needed to assemble a team. Athul found Hack Club online and started a chapter at his high school in 2017 (which was featured in the New Indian Express). Over time, this club grew from 12 members to over 600+ members.  Athul used a curriculum that was beginner-friendly and lowered the barrier to entry to all who wanted to learn.\n\nAs a Hack Club leader, he had access to the international community which welcomed him and was incredibly supportive. He met most of his best friends in the United States through Hack Club. Athul is still amazed that he, a high schooler in India, was working on projects with someone his age on the other side of the world.\n\nIt was after this that Athul attended SRiSHTi in 2014. However, he was too nervous to demo and decided to leave the venue. Although he had a blast, he regretted that he did not demo. Since then, he has attended many hackathons and demoed at every one.  Hackathons have helped Athul build an identity as a bold, confident leader.\n\nOver the last five years, Athul has organized over 16 hackathons and now works as Hack Club’s regional director in Asia-Pacific. In this role, he has helped to start 112 high school coding clubs in the Asia Pacific and Africa regions. These coding clubs offer support, resources, and leadership training to over 4,100 students who meet each week to learn how to code by working on self-directed projects.\n\nHis favorite project was from Startup Weekend where he and his team built a project that alerts the local government about power outages and sends them information like the location and time of the power failure to make more timely solutions. His project also sensed overloads and broken power lines to prevent accidents and electrocutions which can create more effective use of local government resources.",
    "url": "https://top.mlh.io/2020/profiles/athul-blesson"
  },
  {
    "name": "Drew Emery",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "During Drew’s freshman year in engineering, he absolutely despised coding in MATLAB. He didn’t do well in the class, he didn’t understand the point of what they were doing, and he swore off coding midway through the semester under the guise of “This information is simply not useful.”\n\nHe didn't understand what could be usefully accomplished through coding. It was at this point that he posed the following question to his roommate, Alex (a computer science major): “how do I order a pizza with code?” Neither of them knew the answer. The question stuck with him and he would look over Alex’s shoulder and ask him about his homework the duration of their freshman year. Coding kept him questioning everything that was happening behind the scenes from ordering coffee online to Alexa telling him a joke.\n\nFor his birthday, Alex got Drew a freshman textbook in Python. He immediately started working through the textbook. After becoming relatively comfortable with the syntax of Python, he still didn't understand how to do anything useful with code.\n\nIn the fall of his sophomore year, he got an email about an event that was taking place for the first time on campus: CUhackit. He talked Alex into going with him since he was a computer science major and he figured, worst-case scenario, he could just piggyback off of Alex’s abilities if he became hopelessly lost. They made a side-scroller video game using pygame. While their project was simple, he saw all of the other amazing projects that came out of the weekend and fell in love.\n\nAfter seeing all of the incredible projects that were made under the same time constraint,  Drew was inspired to continue learning more after the event. Alex and Drew had so much fun at the event that the organizers asked them to join the organizing team and he has loved working with the hacker community ever since.\n\nAs an organizer, Drew’s main goal is to help others discover the same excitement for learning that he found through hackathons. He loves walking around the events and checking in on groups, offering support in any way he can. Whether that means providing suggestions or pointing them towards resources, he will do everything he can to make sure that attendees are having fun and getting something out of the event.\n\nAt VandyHacks in the Fall of 2018, Drew made his favorite project, Hip Empathy Friend. His friends from the organizing team and him made a Twitter bot that would try to empathize with other Twitter users. The program would ingest tweets and perform sentiment analysis on the text. They would then find a sentence that had a similar sentiment and respond to their tweet with it. It was a really fun project because they ended up making a couple of their own API in order to get the project to fetch information. VandyHacks has a special place in his heart because it was the first time he felt powerful enough in Python that he could contribute and was able to work with his team in order to make their scripts work together seamlessly.",
    "url": "https://top.mlh.io/2020/profiles/drew-emery"
  },
  {
    "name": "Harrison Luo",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Harrison attended his first hackathon during his freshman year at University of Kansas when his mentor Ashley, the hackathon director, suggested he attend. There, he and a couple of friends created a game using the programming language, Lua. His team was completely surprised when they found out they finished second at the HackKU.\n\nHis sophomore year, Harrison ended up attending more and more hackathons and happily worked on the organizing team for HackKU. When the event wrapped, he was disappointed to find that there had been a drop off in attendance. The previous year, there were 170 hackers and now, there were only 50. Motivated to give back to the hacker community, Harrison was elected as director of HackKU 2018.\n\nWhen he started organizing, he quickly learned that the reason there had been a drop off in attendance was because many of the experienced organizers had graduated, leaving the current organizers without adequate mentorship. In an effort to learn more about the planning process, he traveled to Hack K-State to learn from Mary Siebert, an organizer, about best practices and how she went organized her event.\n\nAs a result, he and his team were able to raise attendance from 50 to 240 hackers! An incredible improvement from the previous year. The University of Kansas went from an unranked school to 25th in the League. Harrison was able to give a talk at Hackcon VII on how to market a hackathon in the Midwest.\n\nTo this day, Harrison feels that organizing a hackathon was the most rewarding experience in his life. It was incredible for him to put in hours of work and see it culminate in an event and the direct impact it had on the attendees. Following the hackathon, several hackers emailed Harrison sharing the happy news that they had received internships from sponsors at his event.\n\nWith all of his experience from hackathons, Harrison has been able to land internships and co-ops at companies such as Dell working with RSA security, Garmin International, and Spreetail. In addition to these, he is in the Self Engineering Leadership Fellowship (SELF), a program where engineering students and business students develop their leadership skills through visiting speakers and courses.\n\nHis favorite project is from Hack K-State 2019 where he and his friends created their startup, Applican.ai, a platform that matches technical students with internship opportunities based on cultural and technical fits. After working on it at a hackathon, his team decided to make it more than just a “project.” They are currently in the development stage and working towards a full launch in the spring of 2020.",
    "url": "https://top.mlh.io/2020/profiles/harrison-luo"
  },
  {
    "name": "Justin Glibert",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Justin had just moved from Belgium to the United Kingdom to start university when he came in contact with the hacker community. An exciting new world was ahead of him and he really wanted to build something. Great tales of success from biographies like \"Masters of Doom\" were still bumping in his head after his last high school summer. When a new college friend told him about a \"Hackathon\" in Glasgow, just next to Edinburgh, he found himself intrigued. He went there and won first prize for his product and since then, he has been addicted to the hackathon experience.\n\nHackathons brought so much amazing color to his life from new friends to new skills to internships. In the summer of 2018, Justin went to San Francisco to be a research intern at an AI startup. He had stepped outside of his comfort zone and was the only European on the team. As far as he knew, he also was the only person without a paper published in his name or a degree from MIT. What he did have that made him stand out was his experiences at hackathons and a determination to work hard and learn.\n\nAfter a lot of hustling, he received an invite to interview with one of the founders. He was the director of BattleCode at MIT and he had great respect for the hacker ethos and culture. They had a great conversation and a few technical interviews later, Justin was offered the job.\n\nTwo months into the internship, the other intern, who had worked at OpenAI before and lots of research experience under his belt, asked why they had hired Justin during a dinner. The founder’s response was, “I could feel that Justin was a hacker. I could feel it in my bones.”\n\nAt his internship, Justin was able to attend conventions such as the Anime Expo and show off the experiment that he and his co-intern had been working on. The company built an AI that generated characters for video games and board games.\n\nAs a senior at the University of Edinburgh, Justin is working on many projects. He is currently developing a new project related to differentiable programming and robotics, growing his SaaS platform for notaries in Belgium, and working on the AI platform, Clearcall, with his friends.\n\nHis favorite hackathon project was from the second year of his hacking career, after gathering a lot of experience. He decided he wanted to finally build something people would use after the hack. He went to a hackathon in Manchester during the winter and he built a werewolf/mafia game online that was sleek and fun. He won first prize and the entire hacking team (15+ people) from Edinburgh played for the entirety of their three-hour train ride home.",
    "url": "https://top.mlh.io/2020/profiles/justin-glibert"
  },
  {
    "name": "Juraj Mičko",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "In the spring of 2017, Juraj came across the opportunity to attend a hackathon called HackPrague. His friends and he stayed up late working to make sure their applications were impeccable and they were thrilled when they found out they had been accepted. He had learned a lot of exciting things about hackathons from the exciting projects, cool swag from sponsors, and to learn new things.\n\nThe project their team invented and worked on is called SummApp. It's an Android app that records spoken words during calls, transcribes them into text, processes the content, and suggests a list of contextual actions after the call. For example, if two people agree to meet at a specific time, it automatically adds the event to the calendar. This app was awarded 2nd place overall and won the \"most innovative UX for mobile event discovery\" prize by LondonTheatreDirect company for suggesting events related to the content of phone calls. Their team was so motivated that they continued working on it over the summer and released the app to Play Store for beta testers. They also started a collaboration with LondonTheatreDirect and presented them with future plans. Even though the project has finished, their team learned lots about teamwork, problem-solving, and time management.\n\nJuraj was energized by his experience at HackPrague and spent time searching for other hackathons to attend. After the summer of 2017, Juraj attended numerous hackathons in different EU countries, many of them being MLH Member Events. Inspired by other hackers, he decided to start Hack Kosice, the first MLH Member Event in Slovakia. While a small organizing team at first, they eventually grew into a caring family of ~25 organizers whose mission is to build out a hacker community in Central Europe. In its first year, they were able to grow the club and empower 160 hackers!\n\nEven though Juraj is not sure what he will do once he completes his master’s degree and graduates, he still wants to be connected to technology, working with people, and being a part of a passionate team. Attending hackathons and leading Hack Kosice has shown him what he wants to do with his life.",
    "url": "https://top.mlh.io/2020/profiles/juraj-micko"
  },
  {
    "name": "Peter Murphy",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "After attending HackTJ, Peter and a group of his friends agreed that they had to organize a similar event for their own high school.  By the end of his senior year, they had successfully hosted their high school's first hackathon, HackBI. The following year, having returned as a volunteer for the same event as an alumnus, he was more directly exposed to the MLH Coaches program while managing the MLH Hardware Lab presented by Digi-key.  He applied in the early hours of the morning that weekend because he believed it was the best opportunity to continue providing a positive impact in the larger hacker community. He has had the pleasure of both serving as an MLH Coach and learning from communities all across North America since.\n\nSince the first hackathon he attended, the hacker community has become the most prevalent demographic that Peter is a part of. Organizing and attending hackathons has been one of his biggest passions since he was 15, and through the community, he has met some of his closest friends, learned valuable skills, gotten his first \"serious\" job, and has learned much more along the way.  Through organizing, he gained some much-needed experience with both failure and resilience. Through participating as a hacker, he has continuously surprised himself with what he is able to accomplish, and all throughout, he has met similarly impassioned students along the way.\n\nAfter creatingHackBI, Peter has definitely witnessed a massive increase in funding, resource allocation, and curriculum development in the computer science program at his high school.  This all can be attributed to the increased interest in programming that resulted from their event. Come February, Peter will have played an organizational role in five hackathons, run several workshops, and mentored dozens of students with their projects.\n\nFive years ago, if you had asked him if he thought he’d ever be a good teacher, he would have laughed at the thought.  His participation in the community as an organizer has revealed the enjoyment he gets from sharing his passion with others in an educational setting which he hopes to continue pursuing throughout his professional career.\n\nPeter’s experience within the hacker community has directly translated into his work as a part-time software engineer. He is currently a junior at Virginia Tech studying computer science. Peter is also incredibly proud of his ability to solve a Rubik’s Cube at record times and offers anyone who can beat his solve time an exclusive sticker.\n\nHis favorite hackathon project is from Hackital Fall 2017 where he and his fledgling hackathon team worked on making a simple stock tracker that compared net earnings and losses over a certain period from a given portfolio to the same increases and decreases of BitCoin during that time window. They also tried to incorporate various news APIs to have a live feed of relevant articles according to the composition of the stock portfolio the user-built. According to Peter, the project was quite messy but is still representative of the sheer amount of learning that can be achieved at a hackathon.  Prior to that weekend, none of the members of his team had any experience using APIs, web hosting, or collaborative workflows. Additionally, Peter and the team still kick themselves for not actually using their project to evaluate market and coin trends as BTC went up by around $600 that weekend alone but instead thought, \"Oh cool our graphs are working.\"",
    "url": "https://top.mlh.io/2020/profiles/peter-murphy"
  },
  {
    "name": "Anita Tse",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Anita was placed in computer science when she declared it as her random third choice in her 2nd year of university. She was completely clueless about what CS entailed and she cried when she found out that she didn't get into her top two choices.\n\nShe was afraid for her future because she only knew CS for its stereotype, that it was a difficult field filled with men who have been \"hacking\" and coding things before university, and starting now meant that she’d be behind everyone else. In a desperate attempt to \"catch up,\" she tried going to as many tech-related events on campus as she could. Her first-year friend took her to her first hackathon, UBC Local Hack Day 2016.\n\nAlthough she didn't end up building anything (she didn't even know how to code at that point), Anita learned a lot about what the hacker community was like and it was especially comforting to see females like herself leading the event. From this experience, she excitedly applied to her second hackathon (nwHacks) and was blown away by how well organized it was and how 700 students would volunteer their weekend to learn and build things with code for free. These first two hackathons were key turning points that helped Anita realize that CS was nothing to be afraid of. In fact, she joined nwPlus as a way to give back and inspire others who were in the same shoes as her in 2016.\n\nThrough her work at nwPlus, Anita has learned a lot about leadership and various skills such as writing, logistics, marketing, and more. She was even able to attend and speak at two Hackcons, MLH’s annual conference for developer community leaders. In her role as a leader, she works to make sure events are as fun as possible. She realizes that spending 24 hours in a room can be quite daunting.\n\nAnita says, “I firmly believe that it was thanks to the hacker community that I went from a small scared girl oblivious to tech to a leader of the biggest tech events on campus reaching over a thousand students each year.”\n\nAs a part of the nwHacks team, she is very proud that their team has gone from one competitive hackathon to three annually so they can empower hackers of all skill levels and diverse groups.\n\nAnita’s favorite hackathon project is from nwHacks 2017. Her team built a fun choose-your-own-adventure game for Alexa called “The Golden Quest,” where the player goes on a quest to find the bathroom. Because Alexa was new at the time and MLH had an Amazon Echo in the Hardware Lab, the team wanted to take that opportunity to make an Alexa skill. The idea was simple enough for them to learn how to build Alexa skills. At this event, she helped construct the storyline and beta-tested the project while staying up late to support and feed her team. Although Anita didn’t feel like she contributed much to their project and the project didn’t place, it was still her most memorable project because it was the first one she ever finished at a hackathon. She was proud that she went out of her comfort zone to join a team of people she hadn’t met before, who she is still friends with today. Anita has learned that you really don't need to code to get the full \"hacker experience.\"\n\nAnita is currently in her final year at the University of British Columbia where she is finishing her degree in computer science. She is the co-president of nwPlus and works to lead a team of 40+ members in the planning and execution of three hackathons which bring together 1,200 participants, 100 industry mentors, and 30 sponsors.",
    "url": "https://top.mlh.io/2020/profiles/anita-tse"
  },
  {
    "name": "Kenneth Morales",
    "age": "28",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Driven by a desire to do more than attend classes, Kenneth started searching for something where he could put his learning to good use. He found the MLH website and after some research, realized it was exactly what he was looking for. Not only an opportunity to test his skills but a chance to learn additional skills from others. Even though it was the end of the season, he found Hack@CEWIT online. He packed his bags and dragged three of his friends into the car where they proceeded to drive the 5 hours down to New York for a weekend.\n\nSince his very first hackathon, his life changed so much that afterward, he and his team travel across the US to compete in other hackathons most weekends. They have made great connections with companies who have even traveled to their school to give additional lessons or offer internships to their classmates. Along the way, they have made some amazing friends from all over the world, traded knowledge and skills that without hackathons, he would have never obtained. Most importantly through MLH, they have brought recognition to their school’s engineering programs.\n\nKenneth believes hackathons have an immense impact on his career as well. He recently landed his dream job as a senior associate cyber analyst and he hasn’t even graduated yet. While most of his skills were learned in class or on his own, all his interviewers could only seem to talk about hackathons and his projects from them. They were blown away by his dedication to the events and are interested in him creating a team within the company who would be sent to represent them. This blew him away as he has eight years of prior military experience before starting college and it was barely discussed.\n\nNot only did Kenneth attend hackathons but he started the school club Hack JWU and he currently acts as the president. Since CEWIT, he noticed how other schools would travel long distances and in great numbers to attend. He wanted to help his peers attend events outside their area so they too could grow outside the classroom. Starting with four members, they have now grown into a club 50 strong. Out of his own pocket, Kenneth has funded the club with everything from travel to building a cyber range in one of their school labs so that his peers may practice around the clock.\n\nHis favorite project to this date has to be Sekhmet Overwatch. Kenneth and his team decided that their focus should be to help others whose jobs are to help the general public. The most notable group of people that they wanted to assist were first responders, more specifically firefighters. In doing some research, they discovered that firefighters have one of the highest mortality rates amongst first responders. The main thing they were able to deduce was that despite the advancement of technology, firefighters have a lot of out of date gear. The idea was to build a new Personal Alert Safety System (PASS) alarm for firefighters to use instead of the blaring alarm that they currently have.\n\nThe first thing that they wanted to change all together was the blaring alarm. The PASS alarm is the system used to notify a team if a firefighter is down or needs assistance, it begins to ring incessantly. It was 2018 and he felt these men and women deserved better than just a sound if they were in need of assistance. They figured that they could use a node network of devices to replace the PASS alarms to keep track of each firefighter’s location and oxygen level and if they require assistance or not. Their location and status would be redirected back to the commanding officer on the scene in real-time. This could save numerous lives on the scene of a fire, or other disasters.\n\nWhen they presented their project at YHACK 2018, judges were blown away by it and were impressed by how much research went into it; even the local fire marshal and chief were called to come to see it. Every question or scenario that was thrown their way had already been planned for and answered because they had talked to so many firefighters prior. FireRescue1 even reached out after and wrote a story on what they had done.",
    "url": "https://top.mlh.io/2020/profiles/kenneth-morales"
  },
  {
    "name": "Andy Du Ly",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Andy’s interest in a career in computer science was sparked in his sophomore year of high school. Having had a passion for computers since he was little, he was excited to have time free up in high school for CS courses. After this, he started researching ways to advance his tech skills and encountered the term 'hackathon' countless times. His interest sparked, Andy and his friend Stephen decided to put themselves out there and try attending one.\n\nAfter getting cold feet a few times when looking at hackathons they would need to travel to, they heard about Local Hack Day nearby and no longer had an excuse not to go. Despite their first hackathon being 12 hours instead of 24+, they loved every minute of the experience and ended up coming in third place with their app idea.\n\nIn many ways, Andy believes you can look at hackathons like previews into an industry career. You're working in a fast-paced environment under heavy time constraints with a team. You're ultimately put in a situation where what you put in is what you get out without high stakes. He comments on the vast amount of hackers he has met who were not computer science or engineering discipline majors, and he believes there is value in attending events such as hackathons simply because there is no sufficient reason not to.\n\nAndy is currently a sophomore at Western University where he is pursuing a degree in computer science. He has interned at companies working as a software intern and project manager. Andy currently serves as a full stack developer at benchMarked Studios.\n\nHis favorite project is from BostonHacks 2018 where his team and he developed (then called) ParknGo, a full-stack web application platform that they pitched as the 'Airbnb of Parking Spots.' Their passion for the project never died once it sparked in the initial hours of the weekend, and they ended up winning several awards, most significantly, the Boston University Spark! Fellowship. ParknGo became Parkaze, and under the Spark Fellowship, the platform was further researched, developed, and eventually shipped to market, where it continues to be improved and expanded to this day. Aside from the tremendous growth and potential in the project, Parkaze was his favorite project thus far as it helped him to see how real the potential to turn ideas into realities become at events such as hackathons. Had he never boarded the sponsored bus from Canada all the way to Boston, Massachusetts for 10+ hours, and met his team, the platform and app’s ability to crowdsource their parking solutions might not exist today.",
    "url": "https://top.mlh.io/2020/profiles/andy-du-ly"
  },
  {
    "name": "Lia Yeh",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Lia attended her first hackathon at Tino Local Hack Day in 2014 while in high school. It was there that she noticed that she was the only girl from her high school in attendance which terrified her. She continued to see a lack of women in her 250+ hours of class and ~500 hours of lab research at her university. This feeling that had once been fear turned into determination to bring more women into the field.\n\nDuring her time at UC Santa Barbara, Lia made active strides to make computer science a more gender-inclusive place. She worked to educate her local community by teaching workshops to middle school and high school girls. This is where she met Sarina Abrishamcar, another volunteer, who shared her feelings of intimidation when it came to attending hackathons. Together, they decided to start a hackathon for women called WomxnHacks. It was then that she felt she truly joined the hacker community.\n\nWomxnHacks aims to create a welcoming place for female-identifying and non-gender conforming college students. Lia emphasizes that when they started WomxnHacks, “it was the first time I got to hear a female software engineer share her story, organize two technical workshops run by queer students, and see around 200 female-identifying and non-gender-conforming college students coding in the same room.” They work to make the content beginner-friendly as they are aware that the male majority intimidates many into entering the field.\n\nHaving spent much of her time in a male-dominated environment, Lia was on the receiving end of many odd looks when she said she wanted to be a quantum computer scientist. While familiar with such scrutiny, she channeled her frustrations into a comic which she shared out on her UC Santa Barbara Undergraduate Research blog. It is through WomxnHacks that she feels most empowered and gets to raise up those around her. At WomxnHacks 2020, she will be running a Qiskit workshop which will also prepare her for the 2-unit full-stack quantum computation seminar she will be leading in the Spring.\n\nHer favorite project comes from when she attended AthenaHacks 2019 and worked on a Ruby on Rails app. The app helps friends keep track of their and others’ blood alcohol content. This project is meaningful to Lia because it is a relevant topic for all college students to consider as college partying continues to be a problem seen on many campuses. While this project challenged her in various ways, it ended up winning the best Ruby on Rails hack. This was humbling to receive as she appreciated how hard her team worked to put together a project in such a short turnaround time, despite still having tons of bugs with the actual hack.",
    "url": "https://top.mlh.io/2020/profiles/lia-yeh"
  },
  {
    "name": "Muntaser Syed",
    "age": "28",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Muntaser first found out about hackathons by showing up for free food at a Local Hack Day, something many of us are guilty of. There, he found the concept fascinating and he attended the next hackathon, KnightHacks, which got him hooked. The following semester, he helped organize a couple of small local hackathons and hosted impromptu workshops as a mentor.\n\nMuntaser feels like hackathons and the hacker community have helped him grow tremendously as a person, as a student and most importantly, as a team player.\n\nMuntaser has accomplished quite a lot since starting his hacker journey. Receiving his Bachelor of Science in Information Technology at the University of Miami, Muntaser went on to get a Master of Science in Computer Science from Abu Dhabi University, his Postgraduate Diploma in Software Engineering at University of Bradford, and his Masters of Science in Computer Engineering at the Florida Institute of Technology.\n\nHe is currently pursuing his Ph.D. in Computer Engineering at the Florida Institute of Technology and works as an Autonomous Systems Architect at Aeronyde Corporation.\n\nWhen asked what his favorite hackathon project was, he compared it to asking a parent which child is their favorite. In his last semester, one of his favorite projects was built at Pitt Challenge 2019. He showed up alone with no expectations. Within 24 hours, five complete strangers (four of whom were first-time hackers) got together around a great idea that addressed the issue of dental hygiene among the general population. They built a smart brush, floss holder, and data aggregator that analyzed and recommended better brushing and flossing habits. The solution worked after a lot of hard work and sleep deprivation. Part of what made their team work so well is they all had different backgrounds. Their team was comprised of a dental student, a business major, a CS major, a CE major and Muntaser. Together, they were able to use their combined knowledge to build a unique product which resulted in them winning first place.",
    "url": "https://top.mlh.io/2020/profiles/muntaser-syed"
  },
  {
    "name": "Zoe Fox",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Zoe entered the world of hackathons as a volunteer for nwHacks during her first year at university. As anyone who has attended nwHacks can all attest to, the energy is quite infectious. After just one, she was hooked and applied to be on the organizing team for the next year.\n\nShe hit the ground running and organized three more nwHacks, working in various roles including director. She went on to become president of nwPlus, the organization and club that facilitates events for tech enthusiasts. During her presidency, she rebranded the club which was previously known as StartupStorm and helped to make it the go-to organization for all things hacker related.\n\nIt was then that she worked to expand the amount of coding opportunities nwPlus offered to students. She worked with the UBC Local Hack Day organizers to learn how she could better support their efforts, promoted hackathons where students could get travel reimbursements on social platforms, and worked on helping to expose more people to hackathons.\n\nThis is what led to the creation of cmd-f, Vancouver’s first all-female* (*and non-gender-conforming) hackathon. It was founded with three core values in mind: Women* helping women*, building confidence and positive STEM identities, and learning. Putting it together in a little over a month, the event had over 150+ hackers and was a success.\n\nZoe has never completed a hackathon project but hopes that cmd-f counts. Zoe explains, “I founded cmd-f in the hopes that this event could help women* find a community, find their confidence and passion in the tech industry, and really, just find a place that helps them learn.” Through hackathons, Zoe has found a passion for education and building communities.",
    "url": "https://top.mlh.io/2020/profiles/zoe-fox"
  },
  {
    "name": "Selynna Sun",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "In 10th grade, Selynna never had any intention of trying or being associated with computer science. This changed when she attended her first hackathon, High School Hacks. Fueled by the goal of getting free food and seeing the inside of a large tech company, she signed up. However, during and after the hackathon, she was struck by the culture and purpose of hackathons and how there were hundreds and thousands of students willing to give up their weekends to build something cool just for the fun of it. Once her team finished their project, a simple Android app, she ended up loving the logic and problem solving behind computer science and wanted to be a part of a community comprised of people passionate about building.\n\nAs cliche as it might sound, the hacker community and hackathons have helped Selynna develop both personally and professionally. She’s gotten to volunteer and organize hackathons with some of her closest friends, has met hundreds of passionate students across the globe, has become a stronger and more confident programmer, improve her public speaking through keynotes, and much more. Selynna says, “To be honest, I'm not really sure where I'd be without hackathons. It's hard to imagine life without the lessons I've picked up throughout the last 5 years.”\n\nBoth of the hackathons Selynna founded, Los Altos Hacks and SLO Hacks, were at schools without nationally-known hackathons. At Los Altos High, there wasn't a hacker community. It was upsetting that none of her classmates went to local hackathons, much less traveled to other states to attend collegiate hackathons. Los Altos Hacks had the goal to establish a hacker community at LAHS and give other communities opportunities they wouldn't normally get. Now, as the team is about to host its 5th annual event, they've truly made a name as one of the Bay Area's best high school hackathons for itself.\n\nSelynna had a similar problem at her college, Cal Poly SLO, where she didn't feel that many other students were going to hackathons (especially those abroad or not local). SLO Hacks came out of her desire for Cal Poly to have a technical hacker community and to have people passionate about building things. They have hosted three events a year for two years so far, and more Cal Poly students have gotten actively involved in building things outside of school. As well, non-Cal Poly students recognize Cal Poly as a powerhouse for hackathons.\n\nSelynna has gone on to become an MLH Coach and travels to represent the company at various hackathons around the world each month. In the next 5 years, Selynna would like to go into engineering management and potentially beyond. Currently a senior at California Polytechnic State University (San Luis Obispo), she focuses mainly on full-stack web development.\n\nHer favorite hackathon project is from VHacks 2018 in Vatican City. Her team built Zelixa, a Hololens app that helps dyslexic people train themselves to read better by implementing different forms of dyslexia therapy through augmented reality. This was the first time Selynna had gotten so much mentorship from company partners such as Microsoft. Because of their help, she was able to learn Unity and C# from scratch. Her team ended up placing 2nd in their category and eventually brought the project to Microsoft's Imagine Cup World Finals which was a life-changing experience for her.",
    "url": "https://top.mlh.io/2020/profiles/selynna-sun"
  },
  {
    "name": "Nigel Brown",
    "age": "30",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Nigel saw that access was a problem for many of his classmates. It was taxing for a student to keep up with coursework, apply, and travel to far off competitions. This realization inspired Nigel to put together one of his own local events.\n\nWith the help of a few of his friends, they started a club at their school and got to work planning their own event, Local Hack Day. Nigel brought in speakers from their network and brought together tech enthusiasts from his community.  He was given the opportunity to speak about those experiences at Hackcon and even offered a role as GitHub Campus Expert.\n\nNigel has since hosted a Local Hack Day, spoke at Hackcon, and has become a GitHub Campus Expert. He won an award from IBM that led to an internship and eventually, turned into a co-op. Nigel was asked to intern at one of their upcoming hackathons on his campus. He stayed afterward to mentor other hackers. This excitement about teaching others inspired him to leave the University of California, San Diego, to work as a Developer Advocate at IBM which he had been referred to by one of the mentors that day.\n\nHis favorite project that he has worked on was Safety Net. This idea was meant to help people, like Nigel, that had struggled with mental health, to better monitor their mood using IBM Watson’s Speech to Text and Sentiment Analysis APIs. If audio detected that a person’s mood was continually low it would send a notification to the streamer that it appeared they were in crisis and give them access to resources.",
    "url": "https://top.mlh.io/2020/profiles/nigel-brown"
  },
  {
    "name": "Lisa Vu",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Lisa joined the hacker community during her first semester in college. As a person with some competitive programming experience but without having built any projects yet, she was looking to go outside of her comfort zone. So, she packed her bag, booked a train to Maryland, and joined her first hackathon ever at UMBC. Lisa made her favorite hackathon project there. She arrived at the event having no teammates and only one project idea: a historical stock visualizer. Although it probably was an idea that had been tackled multiple times, freshman year Lisa was very confident pitching it to a bunch of strangers in order to form a team to build it.  They formed and ended up using Java and JavaFX to bring her idea to life.\n\nAfter UMBC, she realized that hackathons allowed her to learn a lot over a short period of time. She found herself going to HackWITus and SheHacks in the 2018 season and falling in love with the experience all over again.\n\nIn the spring of 2018, Lisa applied to become an organizer. She worked as an organizer for BostonHacks and TechTogether Boston and had the opportunity to cater to the hackathon experience to two different groups of hackers.\n\nLisa credits the hacker community with helping to give her a common ground between herself and other students. As an international student, hackathons provided an immediate connection with her peers.\n\nHaving graduated from college in December 2019 after 2.5 years in school, a lot of her growth in college came from being an organizer. She learned a lot of soft skills that she wouldn't otherwise have learned in a traditional CS classroom, especially around how to be more confident in communicating with others. She also gained an incredible network of friends and supporters across the US that she can always rely on.",
    "url": "https://top.mlh.io/2020/profiles/lisa-vu"
  },
  {
    "name": "Sumaiya Tabassum",
    "age": "26",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Sumaiya completed her first degree at City College, CUNY in Psychology with a double major in English. While pursuing her third degree in Computer Science at Queens College, CUNY, she found the easiest way to get more exposure to others in her major was through joining a club and learning about available opportunities from students. She joined the Association for Computing Machinery and along with three other board members, soon helped re-open the Women-in-Tech club at her school. There, she served as the secretary of the club where she learned about MLH and volunteered with the club to organize their first Local Hack Day.  That same year, a friend kept encouraging her to go to this thing called a \"hackathon\" and she eventually caved and attended.\n\nFor Sumaiya, being in the hacker community allowed her to see the potential career paths related to her degree. Most importantly, the hacker community and hackathons have inspired her to apply what she is learning to her own community in Queens.\n\nWorking as both director and executive director for multiple hackathons such as HackAttack and TechTogether NY, Sumaiya grew a lot as a leader. She learned how to increase her patience, plan better budgets, and negotiate with sponsors to meet their hackathon’s financial goals. She also improved her communication and marketing skills while reaching out to potential hackers, volunteers, and others interested in getting involved. These skills transferred over to her career goals as well. She now uses these skills to encourage others within her community to take on organizing events of their own. Outside of hackathons, Sumaiya has led many workshops (Localhost and some of her own) as well as mentored hackers. Having graduated with her third degree, Sumaiya is currently working as an adjunct lecturer at Brooklyn College, CUNY.\n\nHer favorite project was from TechTogether Spring 2018 where she worked with her friends on Look-Listen-Learn. The project focused on connecting individuals to resources ranging from free online therapy to food banks to shelters in order to better the user’s mental health. She enjoyed the project because her time had a short time frame to collect the resources to promote mental health while working with a variety of technologies like Javascript, HTML/CSS with Bootstrap, and APIs to make their application work.",
    "url": "https://top.mlh.io/2020/profiles/sumaiya-tabassum"
  },
  {
    "name": "Maksim Diakov",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Maksim first got in touch with the Russian community at Junction in Helsinki, Finland, a place quite popular among Russian-speaking hackers. At the event, he met MLH representatives who talked about all of the other hackathons around the world. This was a turning point in his life because as he continued to travel to different countries for hackathons, a small sub-community of Russian hackers started to grow. As it started to develop, Maksim felt something special around his friends and him.\n\nMaksim began developing a club called HSE Hackers at his university with his friend and future co-founder, Alexander Prosolkin. The club traveled to hackathons, including HackUPC in Barcelona where Maksim met Aleksandr Malyshev, his third co-founder.\n\nIn 2018, Maksim founded Russian Hackers LLC with Alexander Prosolkin and Aleksandr Malyshev. The organization helps to share hackathons in Russia and all over the world to empower Russian hackers to participate in events and the future of the tech industry. Working with more than 4,000 hackers, Maksim and his team are working to reshape technology as well as host their own, Hack.Moscow.\n\nIn addition to this, Maksim works to empower hackers through various initiatives such as raising the value of hackathons within the academic sphere, advising young hackers, encouraging participants to organize their own hackathons (resulting in 7 Local Hack Days in 2019), helping more international hackers to participate in Russian hackathons, and speaking out about the power of hackathons to corporate companies and universities.\n\nMaksim credits hackathons with a lot of personal growth. His favorite project was created at HackUPC in 2018. He made Whale Protection, an application that helped to detect a person in a poor psychological condition (with the intentions of self-harm, deep depression, etc) based on their social media activity. The app goes so far as to connect individuals with professionals who will help them to overcome their condition or call a special service to the location transmitted by the app. At the time that his team and he created it, there was a string of suicides among young people in Eastern Europe, so the theme had already caught the public eye. The project was very meaningful to his team and was Maksim’s first hackathon victory that not only helped him to learn new things like frontend basics but empowered him to develop as a programmer.",
    "url": "https://top.mlh.io/2020/profiles/maksim-diakov"
  },
  {
    "name": "Conner Pinson",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Conner is from Huntingdon, Tennessee, a rural community with a total population of around 3000 people. With no programming classes or CS educational opportunities in general, Conner found himself stuck in his small town without resources readily available to him. However, he knew it was something he wanted to explore and sought out coding camps in Nashville and other \"nearby\" (4+ hour drives) metropolitan areas. He fell in love with it and decided to major in computer science when he started college at Vanderbilt. Conner attended his first hackathon in Fall 2016 and joined the organizer team for VandyHacks the very next year.\n\nAs an organizer, Conner was responsible for designing and delivering workshops and hackpacks for year-round events. He is also in charge of the flagship event, VandyHacks, in the fall. At the main event, he was able to deliver a beginner-focused Unity 3D workshop and mentor several groups, giving them advice on design methodologies and implementation steps.\n\nConner considers himself very privileged for the opportunity to learn computer science and programming considering his upbringing. This is what drew him to the hacker community. It's full of people who are just as passionate as him about spreading CS education to both beginners and veterans. He got involved with VandyHacks to teach workshops and mentor beginner hackers. He was in their shoes not too long ago and wanted to make sure that their first hackathon experience would be as welcoming as possible.\n\nThrough hackathons, Conner has learned how to be more collaborative. According to him, Vanderbilt’s CS education is very focused on individual projects and there aren’t many opportunities to work with others until your senior project course. He welcomed this change of pace found at hackathons and learned the collaborative Git workflow, how to brainstorm and storyboard application ideas, and, most importantly, how to divide and conquer the implementation of their application. Conner feels that in this regard, hackathons have prepared him for the workplace.\n\nWhen Conner makes projects at hackathons, he tries to solve real-world problems, since that is what inspired him to go into the field in the first place. His favorite hackathon project is from CrimsonHacks 2019 where he and three other organizers from VandyHacks created TerraForm, a better viewer for Google Form responses. TerraForm was inspired by a need for a free, intuitive way to manage and evaluate candidates for college theater auditions. Conner had directed a musical for a student organization in Fall 2018 and the current solution of simply using Google Forms and Google Sheets to collect audition forms and comment on each member within the sheet led to large, cluttered, and simply unmanageable masses of data for their casting team. TerraForm organizes all of the audition forms in easy to see cards and allows multiple people to make comments that can be reviewed later and in real-time.\n\nWorking on this project was his first exposure to web development which he has since fallen in love with. His team was very patient with him adjusting to the React learning curve on the fly. TerraForm was actually used by his theater organization to manage auditions the next semester, which was very exciting for him.\n\nA big milestone for Conner was speaking at MLH Hackcon VII where he discussed attracting non-STEM majors to hackathons, a topic he is fascinated by. Conner works to lower the barrier to entry for hackers so that anyone can attend VandyHacks and enjoy themselves, no matter their experience level.\n\nConner is currently a senior computer science student at Vanderbilt. He will be joining Capital One as a software developer in August after graduating.",
    "url": "https://top.mlh.io/2020/profiles/conner-pinson"
  },
  {
    "name": "Aleksandr Malyshev",
    "age": "23",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Aleksandr joined the hacker community in 2016 when he participated with his friends at Junction in Helsinki, Finland. He was looking for other hackathons in Russia but there was a lack of a local hacker community. However, he was extremely motivated by his first hackathon. It was an incredibly well-organized hackathon with a lot of swag and the brilliantly talented people. He attended more MLH hackathons in 2017 and realized that he wanted to grow his own hacker community back in Russia.\n\nIn 2016, Aleksandr was a second year at his university majoring in computer science. He worked as a programmer to pay his bills. Using the extra money he had saved, he took courses to learn English. In the summer of 2017, he saved up enough money to pay for a UK Visa and attend an English summer school.\n\nFirst, he wanted to go to Ireland or Southern England but in the end, he decided to go to London because of the number of hackathons and tech events occurring on the weekends. He felt like he had hit a goldmine.\n\nWhen Aleksandr was preparing to move to London, he decided to write a blog about hackathons, so he created his first Telegram channel, where he wrote about his life. He bought a non-direct ticket to London, with a stop-over in Berlin to attend one more hackathon. He went to ConCarHack alone and made a new team. He had two outstanding entrepreneurs in his team including a 40-year-old CTO. The team helped him to learn lots in a very short period of time. At the time, he was 19 years old but felt confident that he could keep up with his experienced teammates. While his team didn’t win the hackathon, their project received its first investment just one day after the event was over. Aleksandr found out about the investment immediately upon arriving in London and was shocked at how much one hackathon could change his life.\n\nAfter his English courses in London, Aleksandr went back to Moscow to finish his studies and to work. That fall, he was sitting in an office checking his emails, coding and dreaming about new hackathons. One day, he received a message from Mike Swift with an invitation to Hackcon EU 2017 in Birmingham. He was so happy to be invited but didn’t have the funds to attend. He was humbled and motivated by the invite as he had 70 people following his blog.\n\nThe second problem was that it was only a week away. So, he asked MLH to help him with travel reimbursements and was fortunate enough to receive a grant to cover the costs of travel. At Hackcon EU 2017, he met many different organizers and made the decision to organize his first hackathon, but he didn’t know how to start. Local Hack Day had been announced and Aleksandr knew he needed to host his own.\n\nSince 2017, Aleksandr has increased his readers and followers from 70 to 5000. With his friends Alexander Prosolkin and Maksim Diakov, they have created the biggest international hackathon in Russia and The Commonwealth of Independent States (Hack.Moscow). Through the community, they have inspired over 10,000 people to make their own projects and even created a national hacker team, the “Russian Hack Team.” This select group of 30 are the best hackers from Russia who are trained on how to win hackathons and to create the best tools possible. It is their job to inspire hackers to continue learning.\n\nAleksandr didn’t stop there. He coordinates Local Hack Days in 9+ other cities across Russia, runs Hack.Moscow for developers and students, and runs startup hackathons (EmergeHack) and Startup Villages (TestUp&Demo day) where his team invites hackers to pitch their startups in demo format without presentations. Aleksandr currently works on his own projects full-time.\n\nHis favorite hackathon project was an indoor navigation app for big business centers where users can create a custom route for their segway and it will take you to your exact office.",
    "url": "https://top.mlh.io/2020/profiles/aleksandr-malyshev"
  },
  {
    "name": "Emily Huang",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Emily first joined the hacker community when she switched her major from mechanical engineering to computer science. She didn't know anyone in her major, but she was yearning to connect with others and learn about the possibilities of her new major.\n\nEmily felt inspired by the overwhelming amount of support and inspiration she found within the hacker community, especially when building her project at the TwitchCon Hackathon. She knew she wanted to have the same impact on others and was motivated to take up an opportunity to help her immediate community of women and fellow hackers by organizing Rose Hack, the first women-centric hackathon in the Inland Empire area of California. Her team was comprised of smart and creative women she had met.\n\nThe experience of organizing Rose Hack opened up Emily’s eyes to what a community could really do for those who need that sense of belonging to find their identity as a hacker. From the hackathon alone, she was able to hear firsthand how meaningful it was to attendees to feel seen and acknowledged, especially when they won prizes. It was like seeing a group of students turn into real hackers overnight, not because of their wins but because of their newfound confidence.\n\nOrganizing a 24-hour hackathon in less than a year helped her land a job as a Program Manager at Microsoft. Organizing Rosehacks built her leadership skills, and taught her how to manage projects with different moving parts.\n\nHer favorite project she ever made was a sentiment analyzer using the Twitch chat. The hackathon took place at TwitchCon where all the projects created were related to Twitch. This project was an intersection of two things Emily is passionate about: gaming and streaming culture.",
    "url": "https://top.mlh.io/2020/profiles/emily-huang"
  },
  {
    "name": "Michael Cao",
    "age": "19",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "In his senior year of high school, Michael was told about a hackathon at a nearby school, HackNA. Having piqued his interests, Michael decided to see what a hackathon was like. While his team of four did not end up winning with their Flappy Bird clone, Michael knew that he had found something special.\n\nWhen Michael started school at Penn State University, he sought out HackPSU. At his first HackPSU, he won a sponsor prize. He later joined the organizing team. Ever since, he has been an active and passionate hacker in the community. He has attended hackathons around the country like Bitcamp, PennApps as well as helped to run his own school’s HackPSU.\n\nBefore hackathons, Michael felt a lack of motivation to code since the only extracurricular programming experience he had was programming and designing robot control systems. Engaging with the hacking community helped Michael see there were many different ways to utilize hardware and software to impact the world.\n\nSince joining the hacker community, his experience as an event organizer helped him in his role as Co-Executive Director of HAX, a nonprofit aiming to help underrepresented minorities receive programming and computer science education.\n\nHis favorite project he’s made is Image2Haiku. Based on the idea that an image is worth a thousand words, they came up with the concept of a website where an uploaded image is converted into a haiku. Utilizing Google, AccuWeather, Clarifai, and other APIs, he and his team scraped location, weather, and mood data from the uploaded image and fed that data into a word engine to generate the His team won the AccuWeather sponsor prize and demoed the project on the AccuWeather podcast.",
    "url": "https://top.mlh.io/2020/profiles/michael-cao"
  },
  {
    "name": "Isabel Abonitalla",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Isabel (Isa) joined the hacker community unwittingly. Having only recently discovered her passion for technology through a data science internship at Columbia University Medical Center the summer after graduating high school, Isa struggled to find avenues for her to learn and grow as a developer. She stumbled upon hackathons through her school's career development program and quickly fell in love with the community and all it had to offer. Since then, Isa has spent many a weekend working on hackathon projects.\n\nIsa spends her time working to empower women and disadvantaged minorities in the tech field. She served as a #BUILTBYGIRLS ambassador, an active member of Rewriting the Code and Women in Technology New York, and is the Director of Internal Affairs & Operations at HAX, a nonprofit aiming to globalize computer science education through hackathons. She is also the VP of the Open Source Club, which focuses not only on the promotion of open-source software but also to prepare students for careers in CS and promote coding accessibility. She is passionate about OSC because of its potential to foster a community of like-minded programmers and provide them with a safe place to learn and grow.\n\nHer favorite project was from her second hackathon, Hack: Maternal Mortality & Morbidity Code-a-thon in January of 2019. Her team created MamaCare, a cross-platform mobile app that educates pregnant & post-partum women on risk factors, tracks symptoms through smart devices, and calls physician if symptoms surpass healthy thresholds. This project allowed her to combine her skills in technology and her experience in biomedicine. All of Isa's projects have focused on having a positive impact on the community because she believes that projects should be for the social good and have a deeper meaning.\n\nIsa studies computer science with a concentration in bioinformatics and hopes to work in the intersection of biomedicine and data science to improve patient outcomes with extensive and well-communicated information.",
    "url": "https://top.mlh.io/2020/profiles/isabel-abonitalla"
  },
  {
    "name": "Brandon Barker",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Brandon started coding in middle school, learning with the help of people on Internet Relay Chat (Slack before Slack existed). While entertaining, this method of learning was isolating. Then in his freshman year of high school, a friend insisted he go with him to a hackathon. They went to HackBCA. There, Brandon experienced such a strong community that he was inspired to create his own hackathon, STEMHacks, which was Pennsylvania's first-ever high school-only hackathon.\n\nThese hackathons motivated him to help continue building a hacker community so others could experience the same feelings of connection. While most events are driven by the need to network, the sheer level of passion and creativity at hackathons makes it incomparable. Many of his friends today are the very same people he met at events like HackWCU, PennApps, HackBCA, and many others.\n\nBrandon attributes much of his growth in his extroversion and confidence to his experiences at hackathons. He says, “With an open environment where learning is ok and failure is taken with a smile, hackathons have allowed me to become a better engineer than any internship or schooling could have provided.”\n\nHis favorite project he ever built was Elderlyf, a self-guiding walker he built for his grandfather who had recently gone blind from a spinal injury. The walker allowed his grandfather to regain some of his independence and navigate spaces without external intervention. The walker is capable of guidance, path correction, and feedback. Hackathons have not only helped Brandon secure several internships since high school but also define the direction he wants to go for his life. His love of health tech that he discovered at hackathons have inspired Brandon to create projects that impact the wellness of people’s daily lives, such as developing prosthetic arms and accessible eye exams.",
    "url": "https://top.mlh.io/2020/profiles/brandon-barker"
  },
  {
    "name": "Justina Chua",
    "age": "17",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "As a high school senior, Justina struggled to find classmates at her school who shared her passion for programming. When she started her internship at State Farm, Justina wanted to find other communities passionate about software development. That’s how she stumbled upon her first hackathon, Windy City Hacks.\n\nDespite Windy being the first hackathon for most of her all-female team, they were determined to complete a minimum viable product of their app Habit@, which allowed users to track sustainable habits and see their environmental impact. Many sleepless hours later, they pitched their project to the founder of Hack Club and won best overall at Windy Hacks.\n\nJustina works to advocate for equitable computer science education to bridge the gender gap in the tech industry. She is actively involved in all-female and non-binary communities as a Stanford she++ fellow, GirlCon organizer, NCWIT awardee, #BUILTBYGIRLS advisee, and TechTogether Boston ambassador. She is also the Congressional App challenge winner. In addition to this, she is also the founder and executive director of HAX, a non-profit helping students organize hackathons through mentorship.\n\nJustina intends to major in computer science in the fall when she begins college. She loves the creative medium through which she can build anything and solve problems.\n\nHer favorite hackathon project is from Technica where her team and she worked on Secure the Bread, a web and iOS app that aimed to combat food insecurity and food waste by connecting local restaurants with leftovers to communities in need. They pushed themselves beyond their comfort zones by implementing APIs for the first time and coded in Swift. This was a topic the team was very passionate about as they have witnessed first-hand food insecurity in their respective cities and amongst their friends. Justina cannot wait until she is in college to continue learning how to code and help communities with the solutions she creates.",
    "url": "https://top.mlh.io/2020/profiles/justina-chua"
  },
  {
    "name": "Olivia Li",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Olivia has always considered herself a builder. From building mini rockets and a ukulele from scratch to making her own tattoo gun and using it on herself, she has pretty much been a  hacker since day one. It wasn’t until her friends convinced her to apply for her first hackathon that she got hooked and she joined the world of hackers.\n\nPrior to joining the hacker community, Olivia wanted to be a researcher. This all changed after Hack the North 2017 where she realized that software was more interesting to her and she switched to computer science from biology. The community has brought her many friends who have helped her to grow as a coder and some of whom she will be working with on BioPeels this summer in California. Biopeels is a tech startup developing biocompatible and biodegradable packaging to increase the shelf-life of fresh produce. This product received funding and is collaborating with Sobeys, Canada’s second-largest food retailer, to develop green packaging. This is in line with Olivia’s goal of becoming a tech entrepreneur, incorporating the skills she has learned through the hacker community.\n\nHackathons not only taught Olivia a plethora of tools and frameworks, but they also taught her how to dream big. She says, “After seeing insane hackathon projects that were completed in a mere 36 hours... I’ve come to the conclusion that as long as it doesn’t break the laws of physics, it’s doable.”\n\nHer favorite project was GluClose which was an intersection between her interests in software and biology. At PennApps XVIII, her team created an emergency diabetic glucometer which, instead of using blood to detect blood glucose levels, used a non-invasive method to measure blood glucose levels through saliva. The system used electricity-generating mud bacteria that created a voltage proportional to the amount of sugar it ate. The more sugar it ate, the more electricity was produced and measured. The project as a whole included the biology aspect, the hardware component, and a mobile app for viewing results which reflected the various talents of the team.",
    "url": "https://top.mlh.io/2020/profiles/olivia-li"
  },
  {
    "name": "Nathan Dimmer",
    "age": "16",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Nathan was first exposed to hackathons at GrizzHacks 3. An eye-opening experience, Nathan saw the practical applications of code and skills that he had learned in the classroom. He loved the environment because instead of learning in a classroom, he could make whatever he wanted. Programming had become applicable to real-world issues, rather than unrealistic practice assignments. The day GrizzHacks ended, Nathan found himself already looking for the next event he could attend and he’s been hacking ever since.\n\nHackathons have helped Nathan in many ways. They have helped him identify and break down complex problems under time pressure, which has, in turn, made him a better developer. He has gotten better at identifying irregularities and weird quirks in code. Hackathons have truly brightened Nathan’s high school experience and inspired him to help others find the amazing community he stumbled upon.\n\nNathan organized and ran a Local Hack Day at his local library. He wanted to share the positive experiences that he’s had at hackathons with other local students. At his Local Hack Day, 25 middle and high school students got to experience the exhilaration that comes from a hackathon and making a successful product in only a few hours. When they were demoing at the end of the day, he was amazed to see all of the new things that people tried. From developing their first app, making an Alexa skill, or trying a new framework, the hackers were given an opportunity to learn at their own pace in a safe and supportive environment. When he asked at the end who wanted to go to more hackathons, almost everyone raised their hand.\n\nHis favorite hackathon project is called AirWaze, and it’s designed to help you find your way in any airport. Modern airports are practically cities. Their team thought, “why can’t you navigate them like one?” They wanted their solution to be easy to use, and it needed to work on all devices, so they created a responsive web app to give the user directions throughout airports. The end result was a truly responsive app that could display directions within an airport, pulling the user’s location from scanning QR codes posted around the airport.\n\nIn addition to hackathons, Nathan is the co-founder of Cyber Starters, the co-founder of his high school math club, the founder of Kids Care as well as a chapter president for the National Technical Honor Society.",
    "url": "https://top.mlh.io/2020/profiles/nathan-dimmer"
  },
  {
    "name": "Stanley Lee",
    "age": "19",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Stanley started applying to dozens of hackathons after a summer spark of self-taught web development before going into his freshman year of college. With little idea of what he had gotten himself into, he attended SDHacks thinking it was simply a competition for experienced programmers. After going, his perspective completely changed and he realized how inviting the community of mentors and hackers was. The caffeine and adrenaline fueled the most riveting 36 hours of his life. The sheer collaboration in figuring out how Git worked was filled with a mix of productivity and laughs. And by a miracle, all of them with bloodshot eyes made something. It was the strongest feeling of euphoria Stanley has ever had.\n\nIn a little over a year and twelve hackathons later, he has learned about a wide breadth of technologies and leadership skills that have propelled him into the life of a hacker. Whether it be mentors staying up with him at 3 AM to debug his Flexbox issues or his team ordering boba with 12 hours left in the hackathon, there have been so many incredible memories that he will never forget.\n\nStanley says, “The sheer amount of technologies and soft skills I’ve gained at hackathons is incomparable to any textbook I’ve ever read.” From creating simple static HTML pages to creating React applications, RESTful APIs, and web scrapers, this combination of skills and projects have given Stanley plenty to talk with recruiters and potential employers. The leadership skills he’s learned at hackathons have also translated into real-life project management as he helps teams with Kanban boards, bi-weekly standups, and daily code reviews. Stanley also has enjoyed mentoring hackers at various hackathons and giving back to this community. He is proud of his Hackathon Handbook that he published on Medium to help first-timers have the best experience possible at their first event.\n\nHis favorite project he’s ever worked on at a hackathon is Delivrr. Delivrr is the Uber for package delivery; just like how you can request a driver in seconds, you can request a courier to deliver your package to the other side of town in a fraction of time compared to a standard delivery service. In less than 7 months, a package delivery project at HackSC transformed from a mix of spaghetti code and documentation into a startup that has been accepted to two startup incubators at UC San Diego. Currently, they are rebranding to Wistly, and starting recruitment back up in 2020. They also hired an intern during their summer incubator and ultimately transformed the crazy idea they came up with on a bus into something they are still working on to this day.",
    "url": "https://top.mlh.io/2020/profiles/stanley-lee"
  },
  {
    "name": "Ellissa Peterson",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Elissa first started coding her sophomore year of high school in an intro to Java class. She decided to try it out after enjoying a basic HTML page in her Video, Web, and More class the previous year. She immediately fell in love with the excitement she got from solving a problem that she could’ve been stuck on for a long time.\n\nEllissa was introduced to hackathons by a friend in her major at Iowa State University. In a last-minute decision, she decided to go with her friend and his group to Kansas for HackKU. She learned so much that weekend she started going to as many hackathons as possible. She currently has attended 11 hackathons.\n\nHaving attended plenty within a short period of time, Ellissa noticed a group of students that were at all of the same events as her from Iowa State and they became friends. Impacted by the hacker community, they wanted to help others find their way into the community. They started Hackathon Club, an organization whose sole purpose was to help introduce people to hackathons and help them to attend. In their first semester, the five members traveled the Midwest together attending events in Kansas, Missouri, and Florida. As of today, their club is currently 72 members strong and growing. More than half of their new members had never been to a hackathon before joining. Ellissa was recently elected as president and is excited about the six hackathons they have scheduled for this spring. Their main goal right now is to create a strong foundation for the club by fundraising and reaching out to the community to ensure its longevity.\n\nThrough hackathons, Ellissa has developed her hard skills such as learning React and Javascript and has grown immensely in her soft skills. She learned that she liked being a leader. It gave her the confidence she needed to find a great summer internship with SAP Concur. During her time there, she wrote tests using a testing framework called Cucumber. She worked alongside a team, creating tests for a new webpage.\n\nHer favorite project from a hackathon was Cloud Hockey. She and her team created a web app that allowed them to pull data from an accelerometer in a smartphone taped to a hockey stick. They then represented this data on a real-time graph and were able to allow the judges to take turns hitting a stress ball into a make-shift net to view the acceleration of their shots. The project was innovative and ended up winning second place at PickHacks.",
    "url": "https://top.mlh.io/2020/profiles/ellissa-peterson"
  },
  {
    "name": "Christopher Gu",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Contrary to most, Christopher didn’t find himself thinking about joining a hacker community until after attending his first hackathon, GlobalHack 2016. He attended with Luis, his classmate from high school who he had only recently befriended upon going to the same university. It was at GlobalHack that Chris decided he didn’t want to be a doctor anymore. Having always loved the idea of turning ideas into reality, Chris changed his major from Pharmacy to Computer Science.\n\nA few months later, Chris and Luis found out a hackathon would be happening at their campus and were thrilled. After attending, they found out that the previous organizer could not continue and the two of them had been asked to take on the task of organizing. The two decided to rebrand and thus, PickHacks became the first MLH member hackathon to happen at Missouri University of Science and Technology.\n\nEven after attending several events outside of their school, the duo still wasn’t sure how to go about planning a hackathon. They were aware of MLH and dove into the community for support. Chris attributes much of his organizer knowledge to the many peer groups he attended, conversations with other organizers, and experiences at other MLH member events. In one summer, Chris and Luis attended over 20 peer groups. With all of the help and their hard work, their event had over 300 students.\n\nChris has learned that he would like to move into a career in product management as opposed to software engineering. The skills he has gained through programming and organizing have led him to get a product management internship at Microsoft.\n\nLooking back at where he was a couple of years ago, Chris is beyond grateful for all of those who mentored him and helped him to organize PickHacks. So now, as someone who has a bit more experience, Chris takes every opportunity to help other organizers in the community whether it be via messenger, video calls, or in-person meetups. He even goes so far as to share sponsorship contacts too even if it is a bit taboo because he knows what a big difference it can make.\n\nIn addition to his work as the co-founder and finance lead for PickHacks, Chris is the co-founder and vice president of his school’s Association for Computer Machinery chapter as well as the founder of Miner Key A Cappella.",
    "url": "https://top.mlh.io/2020/profiles/christopher-gu"
  },
  {
    "name": "Lily Perry",
    "age": "19",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Lily’s computer science journey began in high school. She participated in the Girls Who Code program for several years and various STEM clubs. Lily’s interest in programming grew and led  to her first personal iOS project, Peacemon.\n\nThrough her work with the Girl Scouts of Hawaii, Lily attended the 61st Commission on the Status of Women as a United Nations Delegate in 2017. Discussions focused on Sustainable Development Goal (SDG) number five, Gender Equality. As she discussed the SDGs with global leaders, she realized the importance of involving youth, which led her to work on the app.\n\nPeacemon is a fun game for youth to learn about the SDGs and inspires them to enact change in their communities. With a Hawaiian theme and SDG focus, Peacemon is a series of mini-games, each representing a different SDG. In one game, a taro-inspired character named Kalotar jumps over water in streams, filtering pollutants out of the water as it moves. The inspiration for Kalotar comes from taro, a plant ancient Hawaiians used to filter pollutants as water flowed through their ahupua’a (a unit in the Hawaiian system of land division). This app was the first iOS project Lily worked on. It taught her the basics of iOS app development. The skills she learned from working on Peacemon have proved invaluable to her throughout her hackathon journey thus far.\n\nLily attended her first hackathon during her freshman year. She looked forward to going because she wanted to create coding projects outside of the classroom with a collaborative team. Having previously worked on an iOS app by herself, she still enjoyed dabbling with Xcode in her free time. She found that hackathons provided an exciting and engaging way for her to continue her interest in app development while meeting interesting new people, networking with tech companies, and learning to use APIs from these companies. She loved her experiences from all six hackathons she attended in her freshman year and eagerly awaited the hackathons for the next year.\n\nLily’s favorite project from a hackathon is WeMove, an iOS app she co-developed to pair female users to walk over short distances when they would likely not call a Lyft or Uber but felt unsafe walking alone. The app is meant for female college students who feel unsafe walking from a library study session or a party back home at night or even for working women who need to walk a few blocks to a subway or bus stop after a late night at the office.  Her team and she were proud to win the Best Mobile App category sponsored by Zynga at AthenaHacks in Spring 2019 for their hard work on the project. She enjoyed working on WeMove because it allowed her to explore her passion for iOS app development and learn more about app design while creating a product that she could see herself using.\n\nLily is currently a sophomore at the University of Southern California studying computer science.",
    "url": "https://top.mlh.io/2020/profiles/lily-perry"
  },
  {
    "name": "Allison Chiang",
    "age": "21",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Allison felt daunted getting started as a computer science student at the University of British Columbia. She reached out to an old classmate from high school who was very involved in the local tech community. Seeking advice on how she could combat imposter syndrome, her friend introduced her to nwPlus, the UBC club behind UBC Local Hack Day, nwHacks, and cmd-f. Through this club, she discovered the hacker community which in turn helped her feel more secure about her technical abilities.\n\nHaving found a home within the UBC hacker community, Allison wanted to give back and joined as a coordinator. Ultimately she became the UBC Local Hack Day Director and an organizing team member for the 2020 Canadian Undergraduate Computer Science Conference. As an organizer, she works to bring diversity, inclusion, and accessibility to tech.\n\nHer favorite project was still her first-ever hackathon project, acaMEDia which was named a top finalist. Having always been an organizer, her first time hanking was a memorable experience. This was her first hands-on contact with the hacker experience. She worked alongside two other developers where they took turns working on the project and attending workshops. They succeeded in demoing and were named one of the top six finalists.\n\nAllison is currently working on co-op with one45 Software, a cloud-based solution for medical education management in North America. In all her work, Allison hopes to promote equity and inclusion to help others like she once was to feel comfortable and confident in the tech world.",
    "url": "https://top.mlh.io/2020/profiles/allison-chiang"
  },
  {
    "name": "Qianyun “Aria” Chang",
    "age": "25",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Aria came to the United States by herself as an international student at the age of fifteen. She had to teach herself English and is proud to have completed her education on her own in another country and secured her dream job as a software engineer at MediaMath.\n\nAria’s exposure to the hacker community stemmed from a fascination in the math behind artificial intelligence, machine learning, and game AI algorithms. However, Aria lacked confidence as she had little experience in coding prior to her sophomore year of college. When she finally decided to take more computer science courses during her junior year, she felt behind compared to her peers. Soon, Aria found that she had nothing to worry about: she won two awards at her first hackathon at UC Berkeley.\n\nAria’s team worked with Google Cloud’s Speech to Text API and IBM’s Watson’s Sentiment Analysis API. It was a lot of work to get the project to track student’s learning progress, but it was worth it. Their project won the best education hack and CalHacks fellowship award. This gave Aria the validation and recognition she needed to continue pursuing computer science. Addicted to the high of winning, Aria started attending hackathons left and right.\n\nHackathons inspired Aria to jump into projects in unfamiliar domains. She has taken up multiple research projects with professors and created her own side projects. Hackathons also led her to an internship doing smart grid research. In this internship, she created the prototype for a deep reinforcement learning agent to control power grid settings and fix contingencies. The paper based on the model she created won her colleagues and her the best IEEE paper award. She received an offer from MediaMath for a full-time software engineering position on a data engineering team doing large scale machine learning projects.\n\nHer favorite project came from her team at HackDavis when she worked with the Muse headband which utilizes brainwave detection. Their project Brainalyzer used the headband to record a user’s brain waves in order to detect abnormalities and predict seizures. They found a brainwave dataset and performed feature selection and created an LSTM model to predict brainwaves. This project won the best use of Google Cloud Platform.",
    "url": "https://top.mlh.io/2020/profiles/qianyun-chang"
  },
  {
    "name": "Matthew Gaiser",
    "age": "23",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Matthew first found himself coming into contact with the hacker community in a route alternative to most. While many of our hackers come through hackathons, Matthew found himself joining through online innovation contests. In his second year of university, he was searching for an online internship and stumbled upon a company called MindSumo. MindSumo hosts innovation contests (a somewhat generalized hackathon only involving a pitch) with a prize pool split between the best entries. He did this for about a year and skyrocketed to the top of the leaderboard, but MindSumo is neither very technical nor is the work done in teams.\n\nBecause he enjoyed the concept and wanted to have it apply to his software work, Matthew began looking for in-person innovation events. However, most of them were still not technical at all and were mostly pitch competitions in practice. McHacks, his first hackathon, promised competition with technology, a concept which he thought would be interesting and it truly delivered on its promise. He had a great time, met a team he has hacked with 5 other times, and it inspired him to apply for nearly every hackathon he could plausibly attend in the 2019 season. When Hack the 6ix came along in August, he just kept on going and didn’t stop. By the end of the season, Matthew had won five MLH medals.\n\nLast year, he attended one hackathon a weekend for nearly the entire school year. Starting with Hack the 6ix in August, he finished the year strong and concluded with Hack Lassonde in March. Most of the time, the hackathons were relatively close to Kingston, Ontario where he studies. Some of the farther away hackathons Matthew attended included events in Los Angeles, San Francisco, Santa Barbara, Atlanta, and Madison. In that year, he got to travel to the United States more times than in his lifetime.\n\nNow that Matthew is working full-time as a software developer for the Calgary Parking Authority, and he finds himself missing hackathons more and more. He misses the puzzles and chasing after a goal into the early hours of the morning. He misses spending one weekend in warm Santa Barbara and the next in cosmopolitan Montreal.\n\nMatthew says, “One hackathon a weekend is probably not something I will ever get to do again as I can’t just sleep through Monday, but it will be a cherished experience for the rest of my life. It was such a rapid diet of fun.”\n\nHis favorite project was made a year after his first at McHacks 2019. He wanted to do something related to the Internet of Things that was relevant to the city of Montreal. The theme of many of the prizes was “smart cities.” Montreal had a major bridge collapse back in 2006 and the city is beset with infrastructure challenges, with much of it falling apart in a very visible way. One of the reasons infrastructure falls apart is because the conditions it experiences have not been accurately estimated.\n\nBridge Owl keeps track of the environmental factors of a bridge, especially the temperature swings, humidity, and level of usage over the course of the day. It then sends the information to an online system that puts the data through algorithms that estimate the stress experienced by the bridge. Over time, a cumulative stress score for each piece of infrastructure would be generated and the infrastructure would be inspected once a certain score was hit.\n\nIt was an absolute hit with the judges, with many of them staying after to talk about the hack. Matthew won 2nd place overall with Bridge Owl. His hacker journey started just one year before at the same event, so it was a proud moment to have risen from a beginner hacker to one of the overall winners from McHacks 2018 to McHacks 2019.",
    "url": "https://top.mlh.io/2020/profiles/matthew-gaiser"
  },
  {
    "name": "Cameron Brill",
    "age": "19",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "A great part of college is that almost everything is within walking distance. TAMUhack was only a five-minute walk for Cameron. So naturally, he went to check it out.\n\nTAMUhack changed his perception of software development. Cameron found his computer science classes boring, but at hackathons, software development was something magical that offered an escape from everyday life. Since TAMUhack, Cameron has attended 13 hackathons and has won prizes at five.\n\nSo enthralled with hackathons, Cameron joined the organizing team at TAMUhack. As an organizer, he has helped work on their registration system, landing page, and hackathon strategy around company challenges and prizes. He has also spent time mentoring at HowdyHack 2019, the university’s beginner hackathon.\n\nCameron has gained internships at Statefarm and Microsoft, as well as lifelong friends directly through his involvement with hackathons. As well, they taught him how to architect and build every aspect of the software he needed to start his own company.\n\nHis favorite project was the Sustainability Index, the first place winner and winner of multiple company challenges at HackTX. This project provided a stock index aggregator that took into account not only financial factors like traditional stock prices, but also the environmental impact of a company, their treatment of employees, and a company’s stance on certain social issues. As a result, it allows people to invest in public companies who do good.",
    "url": "https://top.mlh.io/2020/profiles/cameron-brill"
  },
  {
    "name": "Natalie DellaMaria",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "During Natalie’s freshman year of college, she switched her major several times from engineering to biology to pre-physical therapy, and finally to computer science. While she had just made the best decision of her life, it didn’t feel that way at first. At the start of her sophomore year, she questioned her choice. She felt out of place and had no friends in her classes. Normally an outgoing person, she found herself sitting in the back of the classroom, afraid to participate, and too intimidated to talk to her peers. Her older brother was in the same major and encouraged her to continue at it. He promised her that there was a community of smart, funny, kind, and empowering individuals who are passionate about technology; that she would find her place in the community if she worked hard and kept an open mind. This seemed unlikely as she looked around the classroom and found a predominantly awkward group of men. Although skeptical, she persisted.\n\nThen she met Courtney. Courtney was a year older than her in her major. They were both a part of the honors college and were connected through mutual friends. Courtney became a role model for Natalie. She was smart, a runner, and had social gatherings at her house. She was also extremely passionate about programming. For the first time, Natalie began to have hope that she would find others like her in the field.\n\nCourtney mentioned how she had gotten funding from their school to fly to San Francisco to attend a ‘hackathon’ last year. She spoke of wanting to bring one to Clemson. As a first-semester sophomore in a new major, Natalie was still looking for ways to get involved. She had been leading outdoor adventure trips for the school’s recreation department but wanted to do something related to her major and career goals. When Courtney mentioned how she had been thinking about organizing a hackathon at Clemson, Natalie jumped on board despite not knowing what a hackathon was.\n\nDetermined to find that community her brother promised, she started recruiting other students to join the planning committee. Very early into their planning stages, they realized their group was lacking in one fundamental area of expertise: what a hackathon actually was. Out of the six of them, Courtney was the only one who had ever been to a hackathon. So one spontaneous Tuesday, four of them including Courtney, cleared their calendars for the upcoming weekend and registered to attend HackNC. They left at 6 am on Saturday. Little did Natalie know how this weekend would impact not only her entire college experience but also her future goals and career path.\n\nHackNC was everything and more. They made friends, went for a walk at 2 AM and got chased by deer. Natalie learned how to make a website and learned what Soylent was. At the end of the weekend, they were exhausted but mostly excited at what they had to look forward to. This was the community she had been promised and boy, did they deliver.\n\nThey spent the five-hour drive back talking about project ideas for their next hackathon and planning Clemson’s first-ever CUhackit. In the two years since Natalie was introduced to the hackathon community, she has attended seven hackathons in six different states from Georgia to Massachusetts to California. She’s helped to organize four: the first student-led hackathon in South Carolina, the largest hackathon in South Carolina, and two hackathons for Clemson freshmen. In addition to planning CUhackit 2020, Natalie is working with a faculty member who is doing research at Botho University in Botswana on a Fulbright to expand the hackathon community on a global scale and put on the first-ever hackathon in Botswana.\n\nIn addition to her hackathon activity, Natalie wants to make the tech community more inclusive. As part of an outreach initiative she started at CUhackit, Natalie has been working to include younger students. The local high school recently stopped teaching AP Computer Science A and the faculty lacked the proper background to teach it. She has helped to create opportunities for Clemson hackers to volunteer at the high school and introduce students to technology and programming through demonstrations and workshops. Also, she has started a chapter of Girls Who Code at the high school and formal meetings began in January 2020.\n\nOutside of Clemson, Natalie volunteers for Future Engineers, an afterschool program to excite elementary school students about STEM disciplines through hands-on project experiences. Upon graduating from Clemson in the spring, Natalie will be starting a job as a full-time software engineer at Samsara next fall.\n\nHer favorite hackathon project is called FemmeCare and it allows one to easily and continuously donate to a nonprofit focused on women’s issues.  Each user creates a profile and enters their bank account information. They would then choose a nonprofit from a provided list chosen of their contributions to women’s empowerment and health. Every time a user makes a payment, the difference between the payment and the next whole dollar amount is automatically donated to their currently selected nonprofit. This project won a prize for the best use of API and storage.",
    "url": "https://top.mlh.io/2020/profiles/natalie-dellamaria"
  },
  {
    "name": "Rodolfo Ferro",
    "age": "27",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Rodolfo had a lot of doubts about his studies. Majoring in mathematics, a lot of his courses are shared with computer science students. Like many others, he struggled to see where the material he learned in class would translate to the real world and how it would enable him to help others.\n\nRodolfo’s friend brought him to a hackathon and everything clicked for him. He participated in his first hackathon in April 2016 where he developed a biometric system designed for security in ATMs. With this project, he won his very first hackathon and felt confident in his decision.\n\nIt was also through this project that Rodolfo and his friend won a national hackathon. The prize allowed him to pay for an internship at Harvard University for two months, where he was able to improve his Machine Learning skills by applying them to a chemistry project.\n\nRodolfo has continued to put himself into situations of growth and learning. He won first place at HackBajío FinTech 2016, was one of the finalists in the national Hackathon 2017 for Smart Cities, and won the first IBM national hackathon, Hackapalooza. He was also just named a winner of the TensorFlow online hackathon and will be attending the next TensorFlow Dev Summit in March.\n\nIt was through his major and the science workshop program he participated in that helped him to get to where he is today. As a result, Rodolfo has been able to create a career for himself as a data scientist. He spent a year as a public worker for his local government, he worked as a remote developer on automation tasks for an international company and is now part of the organizing teams of the local hackathons in his state. In addition to this, he is a co-organizer of science workshops (Clubes de Ciencia México) which he had once participated in as a student.\n\nRodolfo is currently working at Codeando México, a company that creates civic technology and uses open data to help citizens and improve their relationship with the government. He is also working on machine learning projects and collaborating on research on Facial Expression Recognition tasks at an HCC lab.\n\nHis favorite project that he has ever worked on is a citizen reporting system for smart cities that he worked on with his best friend. They designed a whole system, with its own dashboard, to assist citizens in reporting of public services. The idea was to take advantage of the existing infrastructure provided by different companies, instead of developing a new app with the risk of no one downloading it. So, they designed social network bots (starting with Twitter and Facebook) so users did not have to download new apps or unknown functionalities. Instead, they just had to follow or text the users on social media to report their issues.",
    "url": "https://top.mlh.io/2020/profiles/rodolfo-ferro"
  },
  {
    "name": "Elena Lape",
    "age": "22",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Elena always had a knack for coding. She started with Runescape and other various games where she found a hack that got her unlimited coins which she could spend within the game. She went on to sell these on PayPal. It wasn’t until Elena left Lithuania and moved to the United Kingdom for university that she found the hacker community.\n\nShe was looking for something to do over the weekend and stumbled upon a Facebook event for a hackathon in Glasgow, Do you have the GUTS. While her programming skills weren’t far developed past video game hacks, she decided to attend. At the event, a group of locals took her onto their team and 36 hours later, they presented their winning hack (an Alexa skill) on stage.\n\nElena feels her life has largely been shaped by Facebook groups such as Hackathon Hackers. These are hubs for hackathon goers. It was through these groups that Elena learned about events all over the globe, discovering interesting research and getting to interact with wildly intelligent people whom she later befriended. She even found her current residence at a hacker house in Panama on Hackathon Hackers.\n\nElena interrupted her education at the University of Edinburgh in 2019. During her time at school, she studied computer science and organized Hack the Burgh. One of her favorite memories was organizing with her team a made-to-order waffle van for participants to have at breakfast and they gave out seconds. She says, “I dare argue these waffles were some of the best in the country.”\n\nIn her third year of university, Elena was working for a local software company. She was getting a lot of practical experience but felt herself being driven across the Atlantic for the summer. She was interviewing with various companies. After attending Hackcon, Elena was reminded of the internships GitHub was offering and she ended up getting an internship working in partnerships on their Student Developer Pack in San Francisco.\n\nAfter her internship ended, Elena was offered a remote contracting job for GitHub. Because she was remote, she realized she could live anywhere in the world. Elena lived in Panama for several months and recently settled in London for the near future. In Panama, she volunteered at a non-profit, Espacio Explora, where she taught teenagers how to code with HTML and CSS to build websites.\n\nElena claims that her favorite project was all of the friends she has made along the way. If not that, she says it would have to be a hackathon simulator she worked on at Hack Cambridge with Justin Gilbert. Her team-based it on GTA San Andreas (Multitheft Auto) and completely replicated the hackathon venue, branding, swag, organizers’ faces and recorded some typical sound bites. The goal of the game was to keep the hackers happy by constantly sourcing pizza and cleaning up the trash.",
    "url": "https://top.mlh.io/2020/profiles/elena-lape"
  },
  {
    "name": "Gabriel Ting",
    "age": "20",
    "devpost": "",
    "github": "",
    "linkedin": "",
    "website": "",
    "about": "Born and raised in small-town Missouri, Gabriel had never done any programming prior to starting college at Vanderbilt University. His freshman year, he went in thinking he’d be a physics major and took a CS course just for fun. It was during this course that he fell in love with the problem-solving nature of CS.\n\nOne fateful day, Gabriel’s neighbor convinced him to go to HackGT, a hackathon at Georgia Tech University. Even though he lacked confidence in his coding ability, going to this hackathon changed his life. Seeing crystallizations of creativity and skill at the final expo got him hooked on both hackathons and CS as a potential career.\n\nAfter his experience at HackGT, just two years ago, Gabriel started organizing VandyHacks. He wanted to bring the energy he felt from hackathons to the Vanderbilt community, not only through the main hackathon but through smaller workshops and events throughout the year.\n\nAccording to Gabriel, hackathons have been the highlight of his college experience. In his words, hackathons are a manifestation of creativity that he finds inspiring amidst the deluge of homework, tests, and coursework. It’s a time for people to learn what they want to, and utilize their skills to make something they’re proud of. Gabriel believes hackathons are especially important to people that are minorities in the field and to people just getting started. This setting feeds a passion for creation and provides a chance for anybody to start coding.\n\nHe currently is the co-president of VandyHacks where his role is to make sure that  LGBTQ+ people feel included in the CS space. Diversity and inclusion are more important than just a statistic. His goal is to give support through visibility and create a genuine, inclusive environment. He works towards this goal by hosting conversations around authenticity in the workplace, acceptance of ourselves and others, how to parse identities, and more. He wants to create a place where people could share what was on their minds, especially as many are coming from different schools with different sets of norms.\n\nHis favorite hackathon project is from HackIllinois last year. There were open-source mentors from all over the industry. He started talking to a mentor from NPM, the Node.js package manager company. Even though he lacked any real JavaScript background, his team decided to work on a lightweight source mapping package to help programmers understand debugging messages in minified or transpiled files.\n\nGabriel is currently a junior at Vanderbilt and triple majoring in computer science, Asian studies, and applied mathematics. This summer, he will be working on surface simulation tools on the 2020 Mars Rover at NASA Jet Propulsion Laboratory. In addition to his work at VandyHacks, he is heavily involved in Juni Learning where he helps to make the CS community more accessible by teaching computer science to students and developing curricula.",
    "url": "https://top.mlh.io/2020/profiles/gabriel-ting"
  }
]